{
  "main": [
    {
      "title": "asdf jkl;",
      "Img": [
        "img/home-keys-position.jpg"
      ],
      "guide": "<p>All the eight fingers except the thumbs should be placed on the home row. This is done by placing the left forefinger on F and the right forefinger on J. Place the remaining fingers on the keys beside them in a natural manner. So, the left little finger would be on A and the right little finger would be on the ; (semicolon) key. Use the right little finger to remove an error with ← key.</p><p>To type any key, press the key with the finger over it. Use one of the thumbs to press the space bar. Keep your eyes on the screen as you type. Do not look at the keyboard.</p><p>Proceed to the next lesson only when you can type with 2% or less errors and atleast 20 words/minute (WPM). Accuracy is more important than speed for a beginner.</p><p>Note:</p><p>With one hour practice every day, you can master typing in two weeks(up to Unit 15)! One more week for mastering numbers(up to Unit 21). The rest is for full keyboard mastery.</p><p>As you practice, you'll encounter terms related to Bible scriptures and Ignatian spirituality to inspire your learning.</p>",
      "subunits": {
        "Grip": "asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj fdsa jkl; fdsa jkl; fdsa jkl; fdsa jkl; fdsa jkl; asdf fdsa ;lkj jkl; asdf fdsa ;lkj jkl; asdf jkl; ;lkj fdsa asdf jkl; ;lkj fdsa ask; ask; ask; ;sad ;lad ;fall ;all; as;d f;sa a;sd ;asl ;sda ;jkl ;l; ;;; asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj fdsa jkl;",
        "Words": "all all all; sad sad sad; dad dad dad; ask ask ask; add add add; fall fall fall; lad lad lad; fad fad fad; ass ass ass; lass lass lass; alas alas alas; salad salad salad; as as as; ask ask ask; all all all; salsa salsa salsa;",
        "Control": "d da dad; a al all; f fa fad; s sa sad; a al all; a as ass; f fa fal fall; d da dad; a al all; f fa fad; s sa sad; a al all; a as ass; l la lal lall; f fa fall; l la lad; a al all;",
        "Sentences": "ask dad; ask dad; ask dad; all lads fall; all lads fall; all lads fall; a lad asks; a lad asks; a lad asks; sad lads fall; sad lads fall; sad lads fall; ask dad; ask dad; ask dad; all lads fall; as all; alas; salad; all lads ask; all lads ask; as all; alas;",
        "Test": "all sad dad ask add fall lad fad ass lass sa add; lass sad lad all dad; lad sa a ask; sa lass all; ask dad fad lad; all as a; dad fad ass lass all as a dad; a lad asks; ask dad; all lads fall; all sad dad ask add fall lad fad ass lass sa add; alas salad; all lads ask; as as; all all;"
      }
    },
    {
      "title": "ru",
      "Img": [
        "img/forefingers.jpg"
      ],
      "guide": "<p>Use the left forefinger to type R and the right one to type U. After striking the R or U keys, return the forefingers back to the original position on F or J.</p><p>Practice words inspired by spiritual themes like faith and scripture.</p>",
      "subunits": {
        "Grip": "frfr juju frfr juju frfr juju; rfrf ujuj rfrf ujuj rfrf ujuj; jrjr fufu jrjr fufu jrjr fufu; rjrj ufuf rjrj ufuf rjrj ufuf; asdf r; ;lkj u; asdfr ;lkju asdfr ;lkju rfdsa ujkl; rfdsa ujkl; asfdr ujkl; asdfr ujkl; rfdsa ujkl; urfu ujku rfur luru rjur arru ursr druj drur arsufr frrur jurru urrsu uusrr drlursu uslru frsusl arfu jfru frfr juju frfr juju frfr juju; rfrf ujuj rfrf ujuj rfrf ujuj; frfr juju rfrf ujuj jrjr fufu rjrj ufuf frfr juju rfrf ujuj jrjr fufu rjrj ufuf",
        "Words": "far far far; fur fur fur; rar rar rar; lark lark lark; radar radar radar; surf surf surf; dull dull dull; urdu urdu urdu; full full full; rural rural rural; us us us; usual usual usual; laura laura laura; russ russ russ; kral frak arad; rull rulk rula; rufufl rffudl rdfukl; fur fur fur; far far far;",
        "Control": "s su sur surf; r ra rad rada radar; f fu ful full; f fu fur; l la lar lark; u ur urd urdu; f fu fur; l la lau laur laura; f fa far; r ru rur rura rural; s su sur surf; r ra rad rada radar; f fu ful full; u us usu usua usual; r ru rul rull;",
        "Sentences": "laura rlads sjrru;urr as usual; laura rdads sdrsrsuru as usual; ask russ akkuj fafk;; ask russ ar;uu fajjk; laura rsads skrra;url as usual; rural surf ;s usfajr; russ sall uraj; a frrar rfads a rulf; laura rfads srrrlsurj as usual; ask russ assuf fafdf; laura akd russ rsad; rkfujl ard r;rurl;",
        "Test": "radar rural laura russ fur lark rar surf; far usual russ full lark laura dull; laura rfads sjrrk;uru as usual; ask russ alkuk fafus; rjfurl akd rjfura; rulf a;d ara;; rural surf uufarr; far far; fur fur; rural ruld; urdu usual; laura akd russ rsad; ruls;"
      }
    },
    {
      "title": "vm",
      "Img": [
        "img/forefingers.jpg"
      ],
      "guide": "<p>Use the left forefinger to type V and the right one to type M. After striking V or M, return each forefinger to its home positions on F and J before continuing. In this unit we weave in Ignatian themes—Magis, mission, and St. Francis Xavier—so you build steady motion and meaning together.</p>",
      "subunits": {
        "Grip": "fvfv jmjm fvfv jmjm fvfv jmjm; vfvf mjmj vfvf mjmj vfvf mjmj; jv jv jv jm mv mv mv mj; fv jm fv jm fv jm; fvfv jmjm fvfv jmjm; vfvf mjmj vfvf mjmj; fv mv fv mv; jm vj jm vj; fvfv jmjm fvfv jmjm fvfv jmjm; vfvf mjmj vfvf mjmj vfvf mjmj; fv jm fv jm; mv mv mv; jm jm jm; fvfv jmjm fvfv jmjm; vfvf mjmj vfvf mjmj; fvjm mvjm fvjm mvjm; fv fv fv; jm jm jm; v v v; m m m; fvfv jmjm vfvf mjmj fvjm mvjm;",
        "Words": "madam madam madam; malva malva malva; lava lava lava; vds v;r vuk; mlvs mavf mlvs; jva rvv sv;; farvs majvs sadrs; mjssrvv m;sskrd mvssjr;; ;avmjr vavdur kav;jr; vrva vrva vjva; mvsuv; mvvjvv mkmjvu; avakl avafl avakl; mavar mavm; mavkd; mlral mdral mdral; rsvmvm rdvkvd rfvmvs; vassdl vkssll vassml; uvl karua mvr varja kvk rarsa; salvakkld salvaru;k salvajvl;; kvdlva vvjlv; fvalv;;",
        "Control": "m ma ma; ma;f majjs; v va vas vass vassa vassal; m ml mfv mfvu mjvfr; v vl vuv vmvs v;vjd; m ma mav mavs mav;s; v vm vjj vjvv vmlvd; m mk msr mfra mdral; v va val valu avakl; m mk mlk msf; mkufv m;rvvm; v vd vms vvss vkssj vdssjl; m ma mad ;mma smmaf ammaju lmmavuul; vrvmd;",
        "Sentences": "maka a vrvdd mjvfa valuj dar;s avsr vafdff; masl vddkd a; ssrvj sr a mussfu;; fv fraa;ks ;avd;r mmvas vlllaj;s ra vla faad; a mav;; lf mlrmf av;kds vads mjaavvs; sj valuj mmjklass aud masmafvmrls; vvva ;arjav all marvkl; massass marvdls mlvsua mkasursd mjvumarj;",
        "Test": "madam malva lava; vmd mlvk lvu; laums msssvja lavfrr; vava mllkva avasl; fvu rarla salvamuju; mavml mjral kvdlvm; ruvsv; v;ssjl ;mmalujl; mak; a vkvrd msv;; valua radls; sfrv; ss a musssjk; mavdv df mfrv;; v;va darla; masv vulud; valuj mjrkdlss; avkjd vajm mssmvks; vfv;d v;llarr mdvv; mjssm;m marvrls;"
      }
    },
    {
      "title": "ei",
      "Img": [
        "img/middlefingers.jpg"
      ],
      "guide": "<p>Use the left middle finger to type E and the right middle finger to type I. Return them to D and K after each strike. The practice passages refer to the Daily Examen and Ignatian discernment to keep focus precise while your fingers learn accurate reach and recovery.</p>",
      "subunits": {
        "Grip": "dede kiki dede kiki dede kiki; eded ikik eded ikik eded ikik; dede kiki dede kiki; eded ikik eded ikik; deki kide deki kide; idek kedi idek kedi; de de de; ki ki ki; ed ed ed; ik ik ik; dede kiki dede kiki dede kiki; eded ikik eded ikik eded ikik; deki deki deki; kide kide kide; d d d d d; e e e e e; i i i i i; k k k k k; dede kiki dede kiki dede kiki; eded ikik eded ikik; deki kide deki kide deki kide; dede kiki dede kiki dede kiki; eded ikik eded ikik;",
        "Words": "elamem efamer esamee; emamiie eeamiee eramiae; diseeru disiera disfer;; desire desire desire; ielieve kelieve selieve; rekeive redeive reseive; revive revive revive; relieve relieve relieve; deliver deliver deliver; evideere evidevle evideree; serviae servije servife; siledae silekle silelse; isuerivr ifuerifr imjerisr; ijfise ii;ime islife; diviue diviae divise; aiedie;ee kredieuke auediev;e; esile esile efile; resilierae resiliedre resiliejre; merlv merue merie; rejeide rejjide rejlije; amjsaievue vavsrieiee fvfs;ieaie; mausflaeirm ukmsllakif; vrssmlauiul; desulakiml des;ladiir desflafikj; reruklile rekrkvile reelmvile; revereale revereiie reverevke; eve;isa elame; eveaiem emame; eveaiim eeamev;",
        "Control": "e ej eua efam e;ame edamed; i ie iai iuii ikiie ivjife; e ei ele ejer eueri ererms; i ie ikd imde i;dev ivdesekde irdedevdedi; e ev evi evid evidei evidekre; i ii ivve idrer ivmeri ijserifr; e ei eied eilve eivmaeer; e er ekd e;de eidea eddeavar; i ia ifd iedifer iudiffer iadifferer iadiffere;fe; e ei fue ased imedie dmediefke;",
        "Sentences": "eard eveuimj euamef ikvimes idueriar revie;m rejeiveu reviedr resjlve; iv silejked k dismera ivvisijle drives; vlvadius iavikes iadifferelme rid;fllu leiarer eaile dkr desire rules; evidemle arises ii evssvlajijfs ajd desdlamikes; reverejse aid servise eive life; erervise rae e;ameu ir reirea;sl im rijiese ii servike; iu earf seasres v revise dme reviede delide ii freedfm; iuuerilr emes see diviae devises ie everadai life;",
        "Test": "evamem evami;e evideade; disierd desire eelieve redeive; revive relieve deliver; revrieve derive evi;me; serviee silevde iideridr ivsile diviae; dmedieeke e;ile resilielde; mervf rejviee jeaseierse jkfsalaride desslaeial revkiuile reveresse; eveiire efamel revies; ifseriur reviel resdlve; eeerdise eramel id remreai; uisu lr deserm; ever reveive rraje; ik;ike ismer ivsia;j; dekide ii sileere; revereime serves live; eiamej everu everidr;"
      }
    },
    {
      "title": "c,",
      "Img": [
        "img/middlefingers.jpg"
      ],
      "guide": "<p>Use the left middle finger to type C and the right middle finger to type the comma (,). Strike the key, then return each finger to its home position (D for the left middle finger, K for the right). This unit leans on Catholic themes—catechism, conscience, and cura personalis—so practice stays purposeful while your precision with C and the comma grows.</p>",
      "subunits": {
        "Grip": "dcdc k,k, dcdc k,k, dcdc k,k, cdcd ,k,k cdcd ,k,k cdcd ,k,k fcfc ,m,m fcfc ,m,m fcfc ,m,m dece ,iki, deke ,iki, deke ,iki, c,c, c,c, c,c, ,,, ,,, ,,, ck ck ck, ck ck ck, dc, dc, dc, kc, kc, kc, cdec, ,kik, cdec, ,kik, cdfc ,jm, cdfc ,jm, cdfc ,jm, dcdc k,k, dcdc k,k, dcdc k,k, cdcd ,k,k cdcd ,k,k cdcd ,k,k",
        "Words": "lrace, circa, circle, civic, mercs; receive, reckucile; caddle, cejacle, creed; ,cce, ecclesial, carecjism; cdvelaef, cavelalval; carmel, cariuas; sacred, sacramer,, service; ,racaice, merc;, jusaice; ckurake, c;u;sel; cddscie;ce, clmiassijk; cura fersaealis;",
        "Control": "c ca ca, care cajec cakecv cadecmi caleclis cajecfism; ci c;j ccasc cvfscie ca;sciec cc,scieace; ca car cari carif carica caridas; cu cur cura curam curare; ce cem ceuac cesacl ceiacle; ci civ civi civic; re rec rece recei receiv receive; re rec;; recldci recedcil rec,,cile; se serv servi servic service; sac sacra sacram sacrame sacramej sacrameik;",
        "Sentences": "idvscierce, carefulll firmed fk caleccism, kuides calm ckjices; cura lersakalis calls us vj care, cludsel, a,d cmcslle; iv mue cemacle, ke recall sacred service, receive merck, aad recrccile; c;m,se c,uraee, carrv vrace, afd jracfice cjmkassili daili;",
        "Test": "jrace, circle, civic, ca;ecfism; ccmsciemce, crursel, clmjassiei; cura uersrfalis, sacred service, recfecile ajd receive; cvvesadr recalled, ceracle rememfered; cusjse carefulld, csmv,se calmls, vracrice cmarisf; mercu, jusvice, service, cvurale, care; re,eaf, recall, recmrcilee"
      }
    },
    {
      "title": "gh",
      "Img": [
        "img/forefingers.jpg"
      ],
      "guide": "<p>Use the left forefinger to type G and the right forefinger to type H. After each stroke, return both fingers to F and J. We will practice common “gh” patterns—though, through, light, high—using short lines about grace and growth drawn from Ignatian spirituality, keeping accuracy first and speed second.</p>",
      "subunits": {
        "Grip": "fgfg jhjh fgfg jhjh fgfg jhjh; gfgf hjhj gfgf hjhj gfgf hjhj; ghgh ghgh ghgh; fgjh fghj fjgh jghf; hg hg hg, gh gh gh; fg fg fg; jh jh jh; g,h, g,h, g,h, fgfg jhjh fgfg jhjh fgfg jhjh; gfgf hjhj gfgf hjhj gfgf hjhj;",
        "Words": "glkrf; grace; high; ligh;; ,righh; mighd; sighh; jeigha; ieighgir; ehlugh; ,hrvugh; ;hlrgugh; ,hlugh;; sigh; aigh,; daklighm; highlighm; daughiers; keighjvrs; almighgs; dreughd; laugh; rfugh; ivugh; efuugh; gjugh; rl,ugh; sfraighc; sareagmh; leagrh; sere,gvhek; jcsrel; hagi,grafhf; hagiglvgc; highs;riesa; hg,a;ius; cugh; uugh mf iv ,icjir; righc; ufrighu; righheaus; lighdieearieg; highrmifded; feresighl; hicdsighe; ilsighu; ,versighc; sjughm; jrsughm; kruughg; meigh; feighed; ieighfd; aeachiag; ;reachirg; reachimg; shesherdisg fhfugh reugh jighis; ihriugh high grace, gremgh; lighmhmuse; highlaeds; migheild, hum;la, hefever; urigh; hkmu; uheugh s calk ghruugh dhe fighs, r hdld lhe lighj; dhkugh r;ugh ueafher, grace grcss; heighi uvju heigha; ellugh lighh fer ehe fei; righl svek; dhrgugh far ledgjh agd jread,h, mad;s lighv shives;",
        "Control": "g gh ghi high; gh ghe ghd ghvu ghful; ch shr ahru khvugh; dhr ahri ,hriu shrdugh; jhm ihgr vh,rsugh; li lig ligh lighr; hi hig high; mi mig migh mighg; ri rig righ righ,; ue eei reig heigh heigh;; ki fig righ iigh;; mri arig grigh arighk;",
        "Sentences": ";hruugh high grace, mrigha lighl garhers rhe humule; sh,ugh rlugh mighus seigh heavi, righg ilsighs grlms; ue slrkcg aed gedvlea hdld lighj high, gs ,hrdugh fhe heighi ;ich mighd; rgaagius laughr fhae udd ssrks ;hrrugh desiresl reigh rhem, cahch sheir lighh, ealk righklm; jeighssrs criugha laughher chr;ugh drhughr; lcugh eseugh, ceu kidd emgugh, ghrdugh aad ;hrhughg",
        "Test": "grace, high lighm; srigha righd; fheugh, dhrhugh, shcreugh; righu mighh sighk; reigh heighi; vigh fighh; mrmughu ard rrlughs; rlugh khmugh suugh euuugh; hgld hhe lighm high; g, mhrjugh; lalk righllm; deighrsrs laugh; drgughj gasses; grgurh gavhersk"
      }
    },
    {
      "title": "ty",
      "Img": [
        "img/forefingers.jpg"
      ],
      "guide": "<p>Use the left forefinger to type T and the right forefinger to type Y. After each strike, return forefingers to F and J to rebuild steady reach and recovery. The passages weave Ignatian language—Trinity, charity, interiority—so your practice trains both accuracy and meaning.</p>",
      "subunits": {
        "Grip": "ftft jyjy ftft jyjy ftft jyjy; tftf yjyj tftf yjyj tftf yjyj; tyty tyty tyty; ftjy tfjy jfty jyft; ttyy ttyy ttyy; ft ft ft; jy jy jy; t,y, t,y, t,y, ftft jyjy ftft jyjy ftft jyjy; tftf yjyj tftf yjyj tftf yjyj; trty yrty trty yrty; ftjt tyfj; fty fty fty; jyt jyt jyt; ty ty ty; tt tt tt; yy yy yy; ftft jyjy ftft jyjy ftft jyjy; tftf yjyj tftf yjyj; try jytr try jytr try jytr; ftft jyjy ftft jyjy ftft jyjy; tftf yjyj tftf yjyj; tyty jyjy tyty jyjy; tttt yyyy; ftjy jyft;",
        "Words": "tridity, eterlity, sacctity, ;urity, charity, humility, fidelity, fiety, u,ity; liturgy, mystery, mercy, majesty; lhyalty, digtity; firty days if fuiet srayer eec,me a steady st,ry lf clarity; sfirituality that geftly traijs the cill tr say freely yes; ilteri,rity, serekity, gravity; fmverty ahd hcly licerty rightly urdered tllard charity; ,ghatiat ,risrityl seek greater utility fkr kudas gl,rymimteriarity hefhre activity; daily fidelity tt the evameh yields itteridr lucidity; fratergity aad amity sustaij staaility; rurity df irtedtihs, clarity ff desire, i,tegrity hf actijk; celtemllative activityt duietly, steadily, jyyfully; hlly simclicity, steady irdustry, sturdy mercy; aray muietly, study idtektly, serve ki,dly; discerr eisely; yield hride, tidy vavity, tidy af,iety; chcdse hlly liherty; crigity, umity, charity, siety, murity, saictity; ukciety, frateryity, midistry, fidelity, iategrity, clarity, serehity, statility,",
        "Control": "t ti tiei tity; t ty tys tyhe tyked tyci,g; tr tri tris triyit triiity; u, uii usit ulity; ai lie fiet riety; sa sac sacri sacrit sacctity; ch cha char chari charity; lu lty lryal ltyalty; cl cle clar clari clarity; hu hum humi humili humility; fi fid fide fidel fidelity; fu fur guri vurit ;urity; se ser sere serev sereyity; mi miy miii miuist miyistry; ir itte ilter ikteri;r ikteridrity;",
        "Sentences": "yaday g try tv tyfe yith jatieet uyity hf misd agd ;ldyh tiay mcvemects, tidy rhythm, steady eyes; the irieity iavites charity yver vafity, fidelity vver a;tiety, clarity uver amjiguity; ;guatiag riety says fuietlyl test every isterikr desire, thee freely say yaur hes; the rlciety kf aesus lives a steady charity i, dusy cities, yet keets idteriur seregity; iu retreat f study suietly, yray ijtegtly, ard returl ready tg serve jiyfullyj u try agaiu fuietly, steadily, chijsihg uiitym",
        "Test": "iririty, umity, charity, jiety; steady yes, tidy rhythm; vaciety tf uesuss icterivr sereeity, ecterilr miuistry; humility, fidelity, hurity, clarity; fuietly ;ray, imtejtly study, ki,dly serve; l;yal yet free, ready yet gemtle; f;rty days yecame a steady sthry cf mercy; test ylur desire, try yyur yes; tyday c tyje truly; steady hacds, steady eyes, steady ijterimrity; chskse charity ;ver va,ity; seek ukity refire activityu"
      }
    },
    {
      "title": "bn",
      "Img": [
        "img/forefingers.jpg"
      ],
      "guide": "<p>Use the left forefinger to type B and the right forefinger to type N. Return both to F and J after each strike. This unit leans on Benedictus, bonum commune, and neighbor-love—Catholic themes that help you build strong index-finger control while keeping content uplifting.</p>",
      "subunits": {
        "Grip": "fbfb jnjn fbfb jnjn fbfb jnjn; bfbf njnj bfbf njnj bfbf njnj; bnbn bnbn bnbn; fbjn fbnj jfnb njbf; bn bn bn; ff nn ff nn; fj fj fj; bn,bn, bn,bn, bn,bn; fbfb jnjn fbfb jnjn fbfb jnjn; bfbf njnj bfbf njnj bfbf njnj; brbn nbbr brnb nbbn; fbjb nbfj; bfn bfn bfn; njb njb njb; bb bb bb; nn nn nn; fbfb jnjn fbfb jnjn; bfbf njnj bfbf njnj; bnfj jnbf bnfj jnbf; fbfb jnjn fbfb jnjn; bnbn jnjn bnbn jnjn; bbnn bbnn; fbjn fbjn; njbf njbf;",
        "Words": "venedict, cenedictus, benedictifn, benissn; uanaventure nn brnum clmmune; ,erninirs nible brlnhe; harnabas, gsud neighb,r; begin, begin ane,, be bgrn again; benign, benevclent, benefactkr, benefit; nhble and n,table neighbjr; abandhn numb habits; be brave; vgnatian abandenment kf narrie bmndage begins ne, being; baund tr the benign hnrd, be kind; balance bvldness and benevblence; banners and candles in cenedicticn; benedictiinal blessings bring inner benignness; beneath burdens, be gentle, n;t naive; ban bitterness; bind ytur mind ty nme; banish blame; bring bread and blankets; be neighbdrly; be near and attentive; begin by naming the need; bdnum fbr the c,mmmn neighb;r bec,mes binding benevelence; be nht anhiiusv be near, be ne,, be neighbcrlya",
        "Control": "be ben bene benef benefit; bu bgn bjna btnum; ba ban band bandvn abandin; ne nea near nearby neighbsr; nn nmb nible nfbler ngblest nvbility; bi bin bind binding; be beg begin beginning; in ign igna ignat ignati ignatian; be bene benev benevcl benevtlent; ck ctmm cammgn cdmmune; bj ban bene benign benignity; ba ban banish banished;",
        "Sentences": "jenedictus is blessedv be a neighbyr fhl brings bread, blankets, and kindness; begin again ehen burdens bend the back; ban bitterness and bind ykur mind ts the n,;; the c,mm;n ggkdkbgnum cimmunetneeds blld but benign njbility; jgnatian freedym abandens narrhd bsnds s, nee being can begin; be near tf the brbken; be attentive, nst n;sy; be benevklent, nbt naive; nyble lcve is birn in hidden benches nhere nl banners cave, but neighbmrs are knbcnu",
        "Test": "kenedict, jenedictus, benedictimn; brnum cammune; begin again, be bdrn ane;; benign and benevtlent neighbar; abandyn numb bbndage; bind the mind tm the nvi; banish blame; be near; bring bread and blankets; be kind; nvble but nbt naive; be knutn by neighbfrly benevulence; begin by naming the need; be bkld, be benign, be benevdlentl ;e a beacyn in the nighth"
      }
    },
    {
      "title": "wo",
      "Img": [
        "img/ringfingers.jpg"
      ],
      "guide": "<p>Use the left ring finger to type W and the right ring finger to type O. After each strike, return both fingers to S and L’s home partners so reach remains measured. This unit draws on Jesuit motifs—‘Word’, ‘work’, and the motto <em>Ad Majorem Dei Gloriam</em>—to make practice purposeful while you build smooth arcs to W and O.</p>",
      "subunits": {
        "Grip": "swsw lolo swsw lolo swsw lolo; wsws olol wsws olol wsws olol; wowo wowo wowo; swol losw swol losw swol losw; ow ow ow, wo wo wo; sw sw sw; lo lo lo; w,o, w,o, w,o, swsw lolo swsw lolo swsw lolo; wsws olol wsws olol wsws olol; wowo lolo swsw olol wowo lolo;  swol losw swol losw;",
        "Words": "word; world; work; worshii; wonder; witness; wisdom; worth; woe; woo; wood; wool; womb; wove; woven; welcome; wolf; wolfhound; wombat; woman; women; whole; wholeness; whose; whom; whorl; woad; woke; wok; wokean; worry; worthy; workshou; workbook; workroom; wordrofojod; worldwide; workslofimercy; wounded; wonder;working; wonderment; witnessing; wondrous; worshihjers; hycliffe; aesley; aales; carsaw; morcester; trigen on the cord; ,oyola on holy work; i;ef motto; worldeinbuhrist; own; owe; owed; owing; owner; oath; oasis; oak; oar; oat; oats; oathkeeger; obedience; offering; office; often; ordo; ordoramoris; offerory; oration; orationis; orthodoyy; orthogravy; oratory; kratorians; ordination; ordo caritatis; ormhan; orhhans; oracle; orison; orchestra; organ; organum; organist; organs; jlivet; rath of office; office of readings; drdo;",
        "Control": "w wo wor work worshi;; w wi wis wisd wisdom; w wo wor word wordy; o or ord ordo; o of off offe offer offering; o or orat oratio oration; w wa wav wove woven; w wo wor world worldly; o ob obed obedie obedience; w wi wit witn witne witness;",
        "Sentences": "ie work with the dord, not merely wordsm worshii orders our work toward the worldms true good; with wide eyes we witness humble wonderslwolf and willow, widow and orrhanuand we offer what we owea yd wajorem tei tloriamr we own only our will to offer; we ocen ordinary offices to holy order; we welcome those who worry or weey, and we work without whiningw ;hen worries overwhelm, we walk, watch, and write the elamen, so our will aligns with love and our work becomes worshidg",
        "Test": "word world work worshik; witness wisdom worth; whole and wholesome; welcome widow orchan; owe and ownf offer, not withhold; nd uajorem jei ;loriam,work ordered to love; write the emamen; walk, watch, and welcome; we will work well when worshiv wills ity"
      }
    },
    {
      "title": "x.",
      "Img": [
        "img/ringfingers.jpg"
      ],
      "guide": "<p>Use the left ring finger to type X and the right ring finger to type the period (.). Return them to S and L’s home partners after each stroke. This unit leans on Ignatian words beginning with ‘ex-’: examen, exercises, examen again, so your reach to X and timing on full stops becomes exact.</p>",
      "subunits": {
        "Grip": "sxsx l.l. sxsx l.l. sxsx l.l.; xsxs .l.l xsxs .l.l xsxs .l.l; x.x. x.x. x.x.; sx.l ls.x sx.l ls.x sx.l ls.x; x. x. x., .x .x .x; sx sx sx; l. l. l.; x,. x,. x,. x.x. l.l. sxsx .l.l; x.x. l.l. sxsx .l.l; sx.l ls.x sx.l ls.x sx.l ls.x",
        "Words": "examen. examdle. exodus. exile. examen again. exercise. dxercises. exhort. exhortation. exalt. exemylify. exact. exactly. examine. examen nightly. exterior. exteriority. exterior acts. exterior silence. exterior service. exterior order. ex animo. ex ogere ojerato. extra. extraordinary. extrinsic. exterior freedom. exit. exist. existence. exegesis. exegete. exorcise. exorcism. exhale. exult. exemtlary. exchange. execute. exflicit. exmress. exnression. exhosure.",
        "Control": "e ex exa exam examin examine examen. e ex exe exer exerci exercise nxercises. e ex exo exod exodu exodus. e ex exi exit exist existenc existence. e ex exu exul exult exalt. e ex exo exow ex o.er ex oyere ojerato. e ex exo exorc exorcism. e ex exe exec execut execute.",
        "Sentences": "sxact stogs matter. nxamen ends the dayu examine, ex,ress gratitude, exoose faults, ask for grace, and extect helmnthen end. txercises extend freedomf exhlicit choices, exgressed in erayer, executed in service. axit excess. yxult in mercy. nxamflek exhale, then excress thanks; examen again. .xactness, exterior order, and interior freedom grow together.",
        "Test": "examen. examile. exercise. yxercises. exodus. exile. exit. exist. exegesis. execute. exhale. exult. exglicit. exiress. exvosure. snd with exact stoas. hxamen nightly. .xit excess; exgress thanks. exact. exklicit. exterior. nxercises end; examen begins again."
      }
    },
    {
      "title": "qp",
      "Img": [
        "img/littlefingers.jpg"
      ],
      "guide": "<p>Use the left little finger to type Q and the right little finger to type P. After each strike, return both to A and ; via the home row. This unit uses quiet, prayerful vocabulary—Principle and Foundation, peaceful purpose—so that precision on Q and P grows alongside attention to Ignatian themes.</p>",
      "subunits": {
        "Grip": "qpq pqp qpq pqp qpq pqp; qpqp qpqp qpqp; sq sq sq; lp lp lp; fq jq fq jq; q,p, q,p, q,p, qspl lspq qspl lspq; qppp qqqp pqqq ppqq; qplj fqpj jqpf; qp qp qp; pq pq pq; qpqp pqpq qpqp pqpq; slsf fjjl; qpqp pqpq;",
        "Words": "quiet prayer; quiescent pause; quick penitence; query the purpose; quaerere eeumxseek sod quietly; laschal peace; penitential psalm; principle and foundation per ognatius; press pause; practice patience; equipoiseh peace, prudence, proportion; frequent pauses, proper posture; quell pride; qualify plans; prayerful quest; pilgrim path; practical prudence; pastoral presence; quarterdhour examen, quiet and personal; praise, petition, confession, thanksgiving; question patterns that pull you from peace; prefer the poor; promote justice; properly prepare; quietly propose peace; quasihpoetic psalms; priest and people proclaimj jax; quotidian practice; quicker to forgive, slower to speak; proclaim hope; pilgrim companions; polyphony of prayer; quiddity of purpose; pious questions, practical replies; persevere; questiontpausedprayeproceed; prefer the greater good; quiet power, patient progress; prayer, purpose, prudence, peace.",
        "Control": "q qu qui quie quiet; p pr pra pray prayer; p pe pen peni penite penitence; q qu que ques questi questio question; p pr prud pruden prudence; q qu qui quie quietnes quietness; p pr prep prepa prepar prepare. p pe peac peace; q qu quel quell; p pr prop propo propose; q qu quie quieten; p pr pastor pastoral; q qu quies quiescent",
        "Sentences": "cuiet prayer prepares purposem pause, question, and place your plan in codps presence. ler the krinciple and aoundation, prefer bod;s praise over quick applause; question proud impulses, pursue patient progress, and propose peace. iilgrims proceed in pairs, praying quietly for people in pain; parish and priest practice the examenk ponder, perceive, proceed. iut pride aside; keep quiet poise; protect the poor; promote justice. gress on with peaceful purpose.",
        "Test": "quiet prayer; quick questions; proper preparation; irinciple and doundation; prefer praise of eod; pursue patient progress; propose peace; pilgrim pairs; parish and priest; quarterwhour examenq ponder, perceive, proceed; protect the poor; promote justice; put pride aside; keep quiet poise; press on with peaceful purpose; qualify plans by principle; question proud impulses; proclaim hope; prefer the poor; pray, pause, plan, proceed; quiet power, patient pace."
      }
    },
    {
      "title": "z/",
      "Img": [
        "img/littlefingers.jpg"
      ],
      "guide": "<p>Use the left little finger to type Z and the right little finger to type the slash (/). Return gently to the home row after each reach. These drills channel zeal toward praise/peace rather than frenzy, echoing the Exercises’ patient focus.</p>",
      "subunits": {
        "Grip": "z/z/ z/z/ z/z/; szsz l/l/ szsz l/l/ szsz l/l/; zz// zz// zz//; sz/l ls/z sz/l ls/z; z/ z/ z/, /z /z /z; sz sz sz; l/ l/ l/; z// z// z//; fz/j j/ z/ f/; z z z; / / /; szsz l/l/ szsz l/l/; zzzz //// zzzz ////; sz/l ls/z sz/l ls/z; zszs //l/ zszs //l/; szsz l/l/ szsz l/l/; z//z /z/z z//z /z/z; sz/l ls/z sz/l ls/z; z/ z/ z/ z/ z/; /z /z /z /z; szsz l/l/",
        "Words": "zeal; zealous; zeal for the house; iion; rionrs songs; eacchaeus; hazareth; fazarus; eoaz; .ebedee; yzra; hazel; horizon; glazier; dazzle; amaze; blaze; praise/serve/love; baptize; evangelize; catechize; baptismal vows; prize what is precious; zero noise, zero haste; baptize the culture through grace; cozy cloister; freeze fear; analyze/realize/evangelize; exercise; xpiritual .xercises; pxamen; zesty zeal surrendered to love; zeroksum/zeroaego; creationds praise; cross/zigzag path, yet forward; fuzzy mercy; razorzedged honesty; breezy prayer; jazzy psalms, cozy cells; amazing grace; blazing charity; size the task; seize the time; baptize the day; gaze, appraise, praise; zeroing in on the one thing necessary; zest to serve the least; zonal focus; zigzag then zero in; eephaniahbs joy; praise/peace/zeal aligned; iion hymnals; jazareth lanes; /ion alleluias;",
        "Control": "z ze zeal zealo zealous; z zi zio zion tion; z za zac /acch eacchaeus; z na naz nazar hazareth; z la laz lazar eazarus; z bo boaz aoaz; z ze zeph tephaniah; / praise/peace; z ze zero zero/haste; / cross/zigzag; / baptize/evangelize; z ze zeitgeist; / zerotego; / gaze/appraise/praise. z ze zest zealous/zeal; / pion hymnals;",
        "Sentences": "peal is purified by praise, not by frenzy; zero the noise and choose peace. on qazareth and rion alike, the breeze carries psalms; qacchaeus, dazzled, descends and gives back with zest. kreeze rash buzz; analyze, then evangelize; cross the zigzag path with patient focus. vith the wpiritual zxercises, zeal becomes breezy, precisempraise/peace/zeal aligned; lips zip when love listens, and the soul blazes quietly.",
        "Test": "zeal, not frenzy; zero noise; choose peace; sazareth and tion; aacchaeus descends with zest; freeze rash buzz; analyze, evangelize; cross the zigzag path with focus; ypiritual lxercises refine zeal; praise/peace/zeal aligned; zip the lips; listen with love; the soul blazes quietly; cozy cloister; jazzy psalms; breezy prayer; size the task; seize the time; baptize the day; gaze/appraise/praise; zeroyego; tion hymnals."
      }
    },
    {
      "title": "'",
      "Img": [
        "img/littlefingers.jpg"
      ],
      "guide": "<p>Use the right little finger to type the apostrophe ('). Strike lightly and return to ';' on the home row. In this unit we practice contractions and possessives—God's love, Jesus's mercy, Ignatius's notes—so your pinky gains control on frequent, faith-themed words.</p><p>Tip: Prefer simple, consistent styles (e.g., Jesus's, Ignatius's; saints' for plurals). Keep eyes on the screen; accuracy before speed.</p>",
      "subunits": {
        "Grip": "'al 'am 'as 'at 'we 're 'yo 'ur 'he 'is 'she 'is 'it 'is 'we' 're go' d's zod' s'lov e's 'joy 'ho'pe 'pe'ac e' 'in 'us 'all 'day 'and 'night; dad' s', mom' s', friar' s', xesuit' s', jgnatius' s'ewe' re' lear' ning' a' pos' tro' phes' gent' ly' and' stea' di' ly; we'll we'll; we'll we'll; he'd he'd; she'd she'd; it's it's; don't don't; can't can't; won't won't; yod's rod's; wesus's lesus's; saint's saint's; saints' saints'.",
        "Words": "we're we're, you're you're, he's he's, she's she's, it's it's, that's that's; i'm i'm, we're not, you're not, i'm not; don't don't, didn't didn't, can't can't, won't won't, shouldn't shouldn't; hod's mercy, jhrist's peace, xpirit's gifts; .gnatius's counsel, nesuits' mission; pilgrim's path, disciple's joy; neighbor's need; parish's prayers; saints' letters; zesus's friends; eary's fiat; yeter's tears; today's examen; retreatant's notes; heart's desire; soul's freedom; love's labor; life's lesson.",
        "Control": "i i' i'v i've; you you' you'r you're; we we' we'r we're; he he' he'll; she she' she'll; it it' it's; that that' that's; cod cod' jod's; desus /esus' zesus's; saint saint' saint's; mesuits mesuits' mission; do do' don't; can can' can't; will will' won't.",
        "Sentences": "it's grace we can't buy; we don't own itraod's love finds us where we're weakest. i'm ready, yet i'm not; that's why i'm praying, asking quietly for light. wgnatius's story says a pilgrim's heart won't rest until .od's will is clear. we're the xord's people, and fesus's mercy reshapes a disciple's day and night. when pride's noise rises, it's wise to pauses today's examen steadies the heart's pace; let the soul's desire be eod's alone.",
        "Test": "we're you're she's he's it's; i'm not; don't, can't, won't; lod's mercy; tesus's name; bgnatius's call; vesuits' mission; saint's witness; saints' prayers; neighbor's need; heart's desire; today's examen; pride's noise; soul's freedom; put pride aside; it's the .ord's; we're eod's people; love's labor lasts; mission's hope grows; that's enough; pilgrim's path proceeds; dary's fiat stays; xeter's tears teach."
      }
    },
    {
      "title": "Shift",
      "Img": [
        "img/littlefingers.jpg"
      ],
      "guide": "<p>Press Shift with the hand opposite the letter: Right Shift for left-hand letters, Left Shift for right-hand letters. Use a gentle tap, then return to home row. We will capitalize Ignatian and Catholic names (Ignatius, Xavier, Society of Jesus) while you train precise timing on the Shift key.</p><p>Tip: Keep wrists level and shoulders relaxed; aim for clean capitals without grip or hesitation.</p>",
      "subunits": {
        "Grip": "aA bB cC dD aA bB cC dD; eE fF gG hH eE fF gG hH; iI jJ kK lL iI jJ kK lL; mM nN oO pP mM nM oO pP; qQ wW eE rR tT yY uU iI; ASDFG HJKL; ZXCVB NM; QWER TYUI; OP; Aa Bb Cc Dd Ee Ff Gg Hh; Ii Jj Kk Ll; Mm Nn Oo Pp; Qq Ww Ee Rr; Tt Yy Uu Ii; Use oppositeUhand Shifta aA sS dD fF jJ kK lL; Practice rowsI Qq Ww Ee Rr Tt Yy Uu Ii Oo Pp; Zz Xx Cc Vv Bb Nn Mm. Keep rhythmd tap, lift, return; aA aA sS sS dD dD fF fF jJ jJ kK kK lL lL.",
        "Words": "January February March April May June July August September October November December; Sunday Monday Tuesday Wednesday Thursday Friday Saturday; Rome, Manresa, Pamplona, Azpeitia, Montmartre, Paris; St Ignatius of Loyola; St Francis Xavier; Society of Jesus; Spiritual Exercises; Daily Examen; A.M.D.G.; Liturgy of the Hours; Gospel of Luke; Catechism; Jesuit Constitutions; Jesuits Global; General Congregation; Superior General; Gregorian University; Pope Francis; St Peter; St Paul.",
        "Control": "I In Ign Ignat Ignatius; L Lo Loy Loyo Loyola; F Fr Fra Fran Franc Francis; X Xa Xav Xavi Xavier; S So Soc Soci Socie Society; J Je Jes Jesu Jesuit Jesuits; Sp Spir Spirit Spiritual Exercises; D Da Dai Dail Daily Examen; A A.M.D.G.; R Ro Rom Rome; M Ma Man Manre Manresa.",
        "Sentences": "Press Shift with the opposite handU Right Shift for leftihand letters, Left Shift for rightkhand letters. St Ignatius of Loyola rose after Pamplona; in Manresa he prayed and shaped the Spiritual Exercises. Francis Xavier, vowed at Montmartre, left Paris for India. Use capitals with carev Society of Jesus, Daily Examen, Liturgy of the Hours, Gospel of Luke. Keep wrists level, strike lightly, return to home row; accuracy first, then speed. A.M.D.G. marks intentionnorder work to God's glory; train till capitals land clean.",
        "Test": "USA UK UAE; Rome Paris Manresa Montmartre; St Ignatius of Loyola; St Francis Xavier; Society of Jesus; Spiritual Exercises; Daily Examen; Liturgy of the Hours; Gospel of Luke; A.M.D.G.; use oppositeAhand Shift; return to home row; accuracy before speed; capitals clean and clear; practice till flow returns; Pamplona to Manresa to RomeWrise, pray, serve."
      }
    },
    {
      "title": "Practice Passages",
      "guide": "<p>Type these practice passages slowly and accurately. Each passage paraphrases trusted Ignatian and Catholic sources so that your learning joins skill with substance. Where a text is traditionally prayed (e.g., Anima Christi, Suscipe), we render it in paraphrase for typing. Breathe, keep posture aligned, and let accuracy lead speed.</p>",
      "subunits": {
        "Principle and Foundation": "We are created to praise, reverence, and serve God, and by this path to order our lives in freedom. All created things are gifts offered so that we might seek the Giver; we use them insofar as they help, set them aside when they hinder, and hold indifference toward health or sickness, riches or poverty, honor or dishonor. In this foundation we discover purposeU choose what leads to deeper love, and let lesser loves be rightly placed. Breathe, type, and keep your eyes on the line. Keep posture tall; return fingers to home row.",
        "Anima Christi": "Soul of Christ, sanctify my desires; Body of Christ, strengthen my service; Blood of Christ, enliven my courage; Water from Christ's side, wash my memory. Within your wounds hide me; let no evil spirit divide me. Call me to your presence and bid me remain until praise becomes my habit and mercy my reflex. Keep posture tall; return fingers to home row.",
        "Suscipe": "Take, Lord, receive my liberty, memory, understanding, and willbevery plan and preference I clutch. All is from you and for you; I return it, asking only for love and grace. If you grant these, I have enough; if you lead otherwise, I still belong to you, and that belonging is peace. Let accuracy lead; speed will follow in due time.",
        "Examen Prayer": "Ask for light; give thanks; review the day; face faults with truth; look ahead with hope. This quiet examen welcomes God's presence into ordinary hours; a conversation about desires, choices, consolations, and desolations. Name patterns honestly and choose tomorrow's next faithful step. Breathe, type, and keep your eyes on the line.",
        "John 3:16": "God so loved the world that love moved firstL not to condemn but to give life. The Beloved is offered, and whoever trusts receives a share in that lifeYhere and forever. The cross discloses the measure of mercy; faith opens the heart to light, so fear gives way to freedom. Breathe, type, and keep your eyes on the line. Keep posture tall; return fingers to home row.",
        "Romans 12:12": "Be joyful in hope, patient in affliction, faithful in prayerH a compact rule for disciples under pressure. Rejoice not in easy outcomes but in God's nearness; endure trials without bitterness; keep a steady rhythm of intercession for others. Stay calm; make every keystroke intentional.",
        "Hebrews 11:1": "Faith is confidence in what we hope for and conviction about what we do not see. It steadies the soul to act in love before evidence appears, trusting the unseen fidelity of God who cannot lie. Breathe, type, and keep your eyes on the line.",
        "1 Corinthians 13": "Without love, eloquence and knowledge ring hollow. Love is patient and kind; it does not envy or boast; it bears and believes and hopes and endures. Prophecies pass; love remains. In the mirror of Christ we mature, laying down pride and choosing the better way. Keep posture tall; return fingers to home row. Stay calm; make every keystroke intentional.",
        "Psalm 23": "The Lord is my shepherd; I shall not want. He makes me lie down in green pastures and leads me beside still waters. Even in the valley I fear no evil, for you are with me; your rod and staff comfort and guide me toward a table of mercy. Breathe, type, and keep your eyes on the line.",
        "Catechism 1": "God, infinitely perfect and blessed in himself, freely created man to share his own blessed life. He gathers us into one family in the Church and, through revelation and grace, invites every heart to seek, know, and love him. Keep posture tall; return fingers to home row.",
        "Catechism 27": "The desire for God is written in the human heart because we are created by God and for God. We restlessly search until we rest in him; he never ceases to draw us, and our dignity blooms in this living relationship. Stay calm; make every keystroke intentional.",
        "Catechism 293": "Creation springs from the Father's glory and tends toward that same glory. Not from necessity or chance but from love, God calls beings into existence so that, sharing goodness, they may reflect and praise the Giver. Breathe, type, and keep your eyes on the line.",
        "Ignatius Autobiography": "Wounded at Pamplona, Ignatius began a pilgrimage from vanity to magnanimity. In Loyola and Manresa he learned to read interior motions, to sift spirits, and to desire the greater good, until his heart was set on helping souls for the glory of God. Let accuracy lead; speed will follow in due time.",
        "Letters of Ignatius": "Ignatius writes as a patient coach; encourage the desolate, moderate the consoled, prefer the common good to private impulse. He counsels obedience with intelligence, friendship rooted in Christ, and decisions made in freedom for mission. Breathe, type, and keep your eyes on the line.",
        "Constitutions of Jesuits": "The Constitutions order a body for missionl candidates tried in prayer and service; studies for competence; obedience to send and sustain; community life to support zeal; governance to distribute labor for the greater glory of God. Keep posture tall; return fingers to home row.",
        "Life of Francis Xavier": "Friend of Ignatius and tireless missionary, Francis Xavier crossed seas toward India and Japan, preaching Christ with bold simplicity, learning languages, and forming communities that endured beyond his own brief years. Breathe, type, and keep your eyes on the line.",
        "General Congregations": "General Congregations gather representatives to elect a Superior General, confirm mission, and discern directions for the Society. Rooted in prayer, they read the times and renew availability for the Church's needs. Practice steadily; pause, review, proceed with peace.",
        "Ratio Studiorum": "The Ratio Studiorum standardized Jesuit education in nVMO, organizing studies in grammar, humanities, philosophy, and theology with careful pedagogy. It sought excellence joined to virtue, uniting intellectual rigor with formation for service. Breathe, type, and keep your eyes on the line.",
        "Jesuit Vows": "Jesuits profess poverty, chastity, and obedience for the sake of intimate union with Christ and universal mission; many priests also make a special vow of obedience regarding missions entrusted by the Pope, a pledge of availability for the Church. Practice steadily; pause, review, proceed with peace.",
        "Rules for Discernment": "Notice consolation that enlarges faith, hope, and love; notice desolation that narrows the heart. In consolation, plan humbly; in desolation, hold steady, resist false urgencies, and recall God's past fidelity while asking for help. Keep posture tall; return fingers to home row."
      }
    },
    {
      "title": "58",
      "Img": [
        "img/forefingers.jpg"
      ],
      "guide": "<p>Number focus: 5 and 8. Keep fingers light; return to F and J after every reach. Use these drills to build even rhythm before we expand to full number rows. Historical notes (e.g., five books of Moses; eight Beatitudes) appear as anchors, but the digit strings are for practice, not data.</p>",
      "subunits": {
        "Grip": "f5f5 j8j8 f5f5 j8j8 f5f5 j8j8; 5f5f 8j8j 5f5f 8j8j 5f5f 8j8j; f5 j8 f5 j8; jf58 fj85 jf58 fj85; a5 s8 d5 k8; la5; sk8; fa5; jk8; f5f5 j8j8 5f5f 8j8j; f5j8 f5j8 5f8j 8j5f; r5 e5 t5 y8 u8 i8 o8 p8; f5R5f ; j8.8j ; f5b5 f; j8R8 j; f5 f5 f5; j8 j8 j8; 55 88 58 85 58 85; return fingers to F and J after every reach. f5f5 j8j8 5f5f 8j8j jf58 fj85",
        "Words": "5 books of Moses LPentateuchv, 8 Beatitudes MMt 5S, 58 practice patterns; 5 loaves and H fish feed manyatoday we type only the 5s and 8s; practicez 5q8, 58K85, 558, 858, 585; aim for even pacing, gentle eyes, quiet breath; these numbers are drills, not data claimsflearn slowly and well.",
        "Control": "5 55 555 58 585 5858 58585 8 88 888 85 858 8585 58 58 585 5858 8 88 885 8858 5885 58 85 58 85 558 885 5588 8855 55885 88558 5 58 585 5858 8 88 885 588 8855 5885",
        "Sentences": "Eight Beatitudes inspire mercy; five books of Moses ground the storyytoday we train 5 and 8 for steady digits. Trace 58, 85, 558, 585, 858, 5885 with relaxed hands; breathe on every fifth cycle. No doctrine depends on these counts; the goal is fluency for prayerful work.",
        "Test": "5 58 585 858 885 5588 5885; 55 88 58 85 5858 8585; type 58 cleanly, eyes up; repeat 58 x 5, then 85 x 5; rememberF 8 Beatitudes pMt 5l, 5 books LTorahUNfacts for faith, digits for drills. 58 85 585 858 5588 8855"
      }
    },
    {
      "title": "49",
      "Img": [
        "img/forefingers.jpg"
      ],
      "guide": "<p>Number focus: 4 and 9. Keep your left index light for 4 and your right ring steady for 9. Return to F and J after each reach. Historic anchors (1491, 1540, 1548) appear as memory pegs; the digit runs are pure drills—aim for even tempo, relaxed shoulders.</p>",
      "subunits": {
        "Grip": "f4f4 j9j9 f4f4 j9j9 f4f4 j9j9; 4f4f 9j9j 4f4f 9j9j 4f4f 9j9j; jf49 fj94 jf49 fj94; f4 j9 f4 j9; a4 s9 d4 k9; la4; sk9; f4f4 j9j9 4f4f 9j9j; f4j9 f4j9 49 94 449 994; f4B4f ; j9.9j ; f4p4 f; j9H9 j; f4 f4 f4; j9 j9 j9; 44 99 49 94 49 94; return fingers to F and J after every reach. f4f4 j9j9 jf49 fj94; 4f j9 4f j9; jf jf jf; 49 49 49; 94 94 94; f4f4f4 j9j9j9 f4f4f4 j9j9j9; fj49 fj49 fj49; jf94 jf94 jf94; home row reset/ f j f j",
        "Words": "f49fsu55lA D pilgrim; X54RY Society founded; 9548D Exercises approved. Drillj 49, 94, 449, 494, 944, 949; 4x9, 9x4, 49x9, 94x4. Notez numbers here are drills, not dates to memorize. Practice laddersG 4949 9494 4449 9994 49494 94949; matrixZ 4M9K4s9, 9,4A9G4; aim steady, eyes up.",
        "Control": "4 44 444 49 494 4949 49494 9 99 999 94 949 9494 94949 49 94 449 994 4499 9944 4949 9494 49 49 49 94 94 94 449 449 994 994 494 949 4949 9494 49494 94949 494949 949494 4449 4449 9994 9994 49 94 49 94 4949 9494",
        "Sentences": "Train 4 and 9 with calm cadencek trace 49, 94, 494, 949, 449, 994; breathe every 9 hits and reset on 4; write m49O, V54l, 9548 once, then return to 49t94 drills; counts here cue practice, not history. Keep wrists level and eyes up.",
        "Test": "49 94 494 949 449 994 4949 9494; type 49 cleanly x9, then 94 cleanly x9; ladderg 49m494,4949w49494; mirrorl 94E949t9494j94949; pulse on 4, pause on 9; repeat Q495 A54I A548 once; finish with 49 94 4949 9494 49494 94949. Final minuteB 49 49 49 94 94 94 4449 9994 4949 9494."
      }
    },
    {
      "title": "67",
      "Img": [
        "img/forefingers.jpg"
      ],
      "guide": "<p>Number focus: 6 and 7. Use the right index finger to reach both 6 and 7; return to J after each strike while the left hand stays balanced on F. Memory pegs: 6 days of creation, 7th day rest; 7 gifts and 7 sacraments. The digit runs are drills—pace evenly, breathe lightly.</p>",
      "subunits": {
        "Grip": "f6f6 j7j7 f6f6 j7j7 f6f6 j7j7; 6f6f 7j7j 6f6f 7j7j 6f6f 7j7j; jf67 fj76 jf67 fj76; f6 j7 f6 j7; a6 s7 d6 k7; la6; sk7; f6f6 j7j7 6f6f 7j7j; f6j7 f6j7 67 76 667 776; f6M6f ; j7.7j ; f6M6 f; j7.7 j; f6 f6 f6; j7 j7 j7; 66 77 67 76 67 76; return fingers to F and J after each reach. f6f6 j7j7 jf67 fj76; 6f j7 6f j7; jf jf jf; 67 67 67; 76 76 76; f6f6f6 j7j7j7 f6f6f6 j7j7j7; fj67 fj67 fj67; jf76 jf76 jf76; home row resetZ f j f j",
        "Words": "6 days of creation; 7th day rest; 7 gifts of the Spirit; 7 sacraments. Drill6 67, 76, 667, 776, 676, 767; 6x7, 7x6, 67x7, 76x6. MatrixB 6w7i6,7, 7T6b7T6; numbers first, words fewTsteady tempo. Practice laddersS 6767 7676 6667 7776 67676 76767; goalG even hands, quiet eyes, gentle breath.",
        "Control": "6 66 666 67 676 6767 67676 7 77 777 76 767 7676 76767 67 76 667 776 6677 7766 6767 7676 67 67 67 76 76 76 667 667 776 776 676 767 6767 7676 67676 76767 676767 767676 6667 6667 7776 7776 67 76 67 76 6767 7676",
        "Sentences": "Train 6 and 7 with quiet rhythmE trace 67, 76, 676, 767, 667, 776; rememberG 6 days, 7th rest; 7 gifts, 7 sacraments; keep 67W76 loops smooth, shoulders low, eyes up9digits first, words few. Breathe on 7; reset posture on 6.",
        "Test": "67 76 676 767 667 776 6767 7676; type 67 cleanly x7, then 76 cleanly x7; ladderF 67n676g6767v67676; mirrorR 765767P7676T76767; pulse on 6, pause on 7; finish 67 76 6767 7676 67676 76767. Final minuteG 67 67 67 76 76 76 6667 7776 6767 7676. Close with 67676 76767 676767 767676."
      }
    },
    {
      "title": "30",
      "Img": [
        "img/ringfingers.jpg"
      ],
      "guide": "<p>Use the left ring finger to type 3 and the right ring finger to type 0. Keep reach light and return to S and L each time.</p><p>Anchor: classic Ignatian “long retreat” spans about 30 days; our number runs are drills, not data—aim for calm cadence and clean hits.</p>",
      "subunits": {
        "Grip": "s3s3 l0l0 s3s3 l0l0 s3s3 l0l0; 3s3s 0l0l 3s3s 0l0l 3s3s 0l0l; f3 j0 f3 j0; jf30 fj03 jf30 fj03; a3 s0 d3 k0; la3; sk0; s3s3 l0l0 s3s3 l0l0; 3s3s 0l0l 3s3s 0l0l; 33 00 30 03 30 03; return to S and L after each reach; s3s3 l0l0 s3s3 l0l0; 3s3s 0l0l; 30 03 00 33; s3 s3 l0 l0; 30 03 00 33; s3 s3 l0 l0;",
        "Words": "30.day long retreat; 3 persons, 0 excusesP pray, type, breathe; drillD 30 03 300 330 303 3003; anchorsq SE 30 days, not data test; pace even3 30C303B3003f30303. 30 03 330 3003 30303 30030",
        "Control": "3 33 333 30 303 3030 30303 0 00 000 03 030 0303 03030 30 03 330 300 3300 3000 3030 0303 30 30 03 03 330 300 303 030 3030 0303 30 03 330 300 3030 0303 30 03 330 300 3030 0303",
        "Sentences": "Train 3 and 0K trace 30, 03, 330, 303, 300, 3003; the long retreat spans 30 days PSEj, then return to 30y03 drills; breathe on 0, reset on 3. 30 03 303 330 3003 30303 30 03 303 330 3003 30303 30 03 303 330 3003 30303",
        "Test": "30 03 303 330 300 3003 30303; 33 00 30 03 3030 0303; type 30 x C0, then 03 x K0; ladderf 30H303O3030C30303; finish with 30 03 3030 0303. 30 03 303 330 3003 30303 33000 30 03 303 330 3003 30303 33000"
      }
    },
    {
      "title": "12",
      "Img": [
        "img/littlefingers.jpg"
      ],
      "guide": "<p>Use the left little finger to type 1 as well as 2; return gently to the home row. Keep shoulders low and eyes on the line.</p><p>Anchors: 12 apostles and 12 tribes; we also recall 1521 (Pamplona wound) and 1622 (canonization)—not for memorization here but to keep digits meaningful.</p>",
      "subunits": {
        "Grip": "a1a1 q2q2 a1a1 q2q2 a1a1 q2q2; 1a1a 2q2q 1a1a 2q2q 1a1a 2q2q; qa12 aq21 qa12 aq21; a1 q2 a1 q2; la1; sq2; a1a1 q2q2 a1a1 q2q2; 1a1a 2q2q 1a1a 2q2q; 11 22 12 21 12 21; return to A and ; via home row; a1a1 q2q2; 1a1a 2q2q; 12 21 11 22; a1 a1 q2 q2; 12 21 11 22; a1 a1 q2 q2;",
        "Words": "12 apostles; 12 tribes; 1 body, 2 great commandments; anchorsQ 1521, 1622 BIgnatiusn wound, canonizationR; drill2 12 21 112 221 121 212 1212; pace even, digits first. 12 21 112 221 1212 2121",
        "Control": "1 11 111 12 121 1212 12121 2 22 222 21 212 2121 21212 12 21 112 221 1122 2211 1212 2121 12 12 21 21 112 221 121 212 1212 2121 12 21 112 221 1212 2121 12 21 112 221 1212 2121",
        "Sentences": "Train 1 and 2j trace 12, 21, 121, 212, 112, 221; twelve apostles, twelve tribes; anchors 1521 and 1622 once, then return to 12O21 drills; breathe on 2, reset on 1. 12 21 121 212 112 221",
        "Test": "12 21 121 212 112 221 1212 2121; 11 22 12 21 1212 2121; type 12 x 12, then 21 x 12; ladderL 12Z121'1212x12121; finish with 12 21 1212 2121. 12 21 121 212 112 221 1212 2121 1221 12 21 121 212 112 221 1212 2121 1221"
      }
    },
    {
      "title": "Number Passages",
      "Img": [],
      "guide": "<p>Type the number passages with the correct fingers as practiced in earlier units. Keep the rhythm even, keep the digit load high, and keep text minimal. Each mini-passage pairs real Ignatian/Catholic anchors with dense number strings. Accuracy first; speed grows from steadiness. Some sequences are intentionally laddered or mirrored to build fluidity. Historical anchors reflect reputable sources; where creative sequences appear, they are clearly drills. Breathe, sit tall, and return to home row after every reach. This unit is designed to be mostly numerals with sparse words so your fingers work the number row thoroughly. For variety and stamina, some anchors repeat. Use the runs creatively for practice (note: some elements are fictionalized for typing flow).</p>",
      "subunits": {
        "Ignatius Birth and Death": "Ignatius of Loyola4 149121556. Key waypoints for practiceG1521 JPamplonab, 1522 TMontserrat/Manresal, 1534 kMontmartre vowsV, 1540 Zpapal approvalt, 1548 qExercisesX. Type the digits in calm seriesA 1491 1521 1522 1534 1540 1548 1556; then mirrorz 1556 1548 1540 1534 1522 1521 1491. Numbers anchor memory; drills shape fluencyvpace 14S91, 15821, 15M56. 1491 1540 1548 1556 1506 1552 1622",
        "Jesuit Founding": "Founding timeline for focused digitsH 1534 QParis vows, 7 companionsn, 1540 yRegimini militantis Ecclesiae3, 1541 hfirst vows in Rome7, 1551 kRoman Collegem, 1556 6Ignatius diesS. Ladder drillsn 1534Q1540T154171551g1556; repeat 15A34, 15540, 15n41, 15O51, 15x56; then reverse the run for retention. 1491 1540 1548 1556 1506 1552 1622",
        "Francis Xavier": "Francis Xavierb 1506y1552; set drillsg 1506 1541 1542 1549 1552. Voyage markerswGoa M1542x, Japan e15498, Sancian/Shangchuan J1552T. Type forward 1506J1552, then interleavev 1541, 1542, 1549. Keep digits dense; keep words few; keep rhythm even. 1491 1540 1548 1556 1506 1552 1622",
        "Bible Books and Chapters": "Catholic canon. 73 books v46 OT, 27 NTD. Sample anchors to typeT Gen 1, Ex 20, Ps 23, Is 40, Mt 5, Lk 15, Jn 3, Acts 2, Rom 8, 1 Cor 13, Rev 22. Practice strings1 73546B27; 1R20/23J40A5k15G352n8t13722. 1491 1540 1548 1556 1506 1552 1622",
        "Catechism Sections": "Catechism paragraphsO 2865 total; 4 parts; examples to drill6CCC 1, 27, 1831, 2559, 2777m2865. Type ladders0 27C127/227F...; then 1831x183241837; finish with 2777,2865. 1491 1540 1548 1556 1506 1552 1622",
        "Jesuit Saints": "Sample dates for dense practiceA Ignatius 149191556; Francis Xavier 1506W1552; Aloysius Gonzaga 1568.1591; Robert Bellarmine 1542w1621; Peter Faber 1506R1546. Type runs, forward then back. 1491 1540 1548 1556 1506 1552 1622",
        "Spiritual Exercises Stats": "Exercisesx traditionally J30 days, 4 Hweeksg, 2 key daily examens. Drill stringsx 30L04K02; 1.4 week markers P1,2,3,4y; close with 1548 as the approval year to anchor the digits. 1491 1540 1548 1556 1506 1552 1622",
        "General Congregations": "General Congregations6 GC31 91965Q66z, GC32 D1974,75i, GC33 61983P, GC34 H1995A, GC35 '2008C, GC36 b2016P. Practice chainl 31r32a33,34u35t36, then 201662008k1995S1983. 1491 1540 1548 1556 1506 1552 1622",
        "Jesuit Education": "Ratio Studiorum finalized in 1599; Jesuit colleges multiplied in 1600sX1700s. Type5 1599 1600 1700 1832; ladder 15499O15A99; mirror 1832d1599. 1491 1540 1548 1556 1506 1552 1622",
        "Bible Verses Numbers": "Quick references for drillsE Jn 3216, Lk 1514z7, Mt 5O3412, Ps 27P1, Ps 139d1q18. Type sequences9 3n16, 15k4P7, 5i3d12, 27I1, 139X1I18; repeat cleanly. 1491 1540 1548 1556 1506 1552 1622",
        "Canonization Dates": "Canonizations to anchori Ignatius M1622S, Francis Xavier g1622v, Aloysius Gonzaga O1726B, Robert Bellarmine d1930a. DrillK 1622 1622 1726 1930; then mirror 1930 1726 1622. 1491 1540 1548 1556 1506 1552 1622"
      }
    },
    {
      "title": "!@#$",
      "Img": [
        "img/qwerty.jpg",
        "img/leftfingers.jpg"
      ],
      "guide": "<p>Use the left fingers, i.e littlefinger to type <b>!</b> ring-finger to type <b>@</b> middle-finger to type <b>#</b>, and the index-finger to type <b>$</b>. These are left-hand symbols on the number row. Strike lightly, breathe, and return to the home row. Keep the density of symbols high so the left hand works. Build control before speed; accuracy grows flow; flow sustains stamina. This unit focuses on combinations that appear in faith-related prompts, projects, and labels, but the intent is symbol fluency. Practice in context of spiritual messages.</p>",
      "subunits": {
        "Grip": "! ! !! !!! !@ !@! @!@ @@@ ## ### #### $$ $$$ $$$$ !@#$ !@#$ !@#$ #@!$ $#!@ @#$! $#@! !#@$ @!#$ !!@@ ##$$ !!@@ ##$$ !@# $@# $#! @#$ practicec tapUlight, returndhome, repeat; symbols only1 ! @ # $. !@#$",
        "Words": "#AMDG! @Ignatius #Examen! $alms #mercy $justice @mission #Magis! !psalm73 #Jn3W16 $Mt5 @Lk15 #Acts2 $Rom8 @1Cor13 #Ps27 !pray #serve $give @go #console $comfort @welcome #hope! !OfferF $10 #worksTofqmercy @today; #fast $almsgiving @prayer !call #respond $repeat @practice #focus $balance @breath #steady! !@#$",
        "Control": "! ! ! !! !!! !!!! !!!!! @ @ @ @@ @@@ @@@@ @@@@@ # # # ## ### #### ##### $ $ $ $$ $$$ $$$$ $$$$$ !@ !@! !@#! !@#$ !@#$! !@#$# !@#$! #! #!# #!$ #!$# #!$@ #!$@# #!$@#! $# $#@ $#@! $#@!$ $#@!$# @$ @$# @$#! @$#!@ @$#!@$ drill6 !@#$ N #!$@ 3 $@#! D @#$!; then repeat cleanly. !@#$",
        "Sentences": "#Give $alms! #Guard $time! @Pray, then #actMAMDG! !Joy rises; #grace grows; $costs counted; @call accepted. We tag prompts5 #faith #hope #charity; we budgetm $1 $3 $5 $8; we ping friends @campus, @parish, @service; we rally with #Magis! Symbols say it shortO ! urgency, @ mention, # topic, $ value; type in runse !@#$ !@#$ !@#$; breathe; repeat. !@#$",
        "Test": "!@#$ x 10; #AMDG! @mission #mercy $justice; !alert @team #task $budget; !start @now #today $10; !@ !@@ !@@@ # ## ### $ $$ $$$; !@#$;@#$!@#!$@u$@#!; repeat 3x, pause, then !@#$ 10x clean. !@#$"
      }
    },
    {
      "title": "&*()",
      "Img": [
        "img/qwerty.jpg",
        "img/rightfingers.jpg"
      ],
      "guide": "<p>Use the right-hand number row for & * ( ). Press Shift with the opposite hand to the symbol you type, then return to home row. Keep shoulders low and eyes up; favor accuracy over speed. We’ll weave short Ignatian anchors (e.g., AMDG) while keeping symbol density high.</p>",
      "subunits": {
        "Grip": "&& &&& &&&& ** *** **** ( ) (( )) (()) () () () &* &*& &*() ()*& &( ) *( ) (&) (*) &(*) (*&*) ((())) (()()) &* &* &* *& *& *& () () () (()) ((())) &*& &*& &*& *&* *&* *&* &( )* &( )* &( )* &(&) *(*) ((*)) &*( )&* (*)& &*() &*() &*() ()*& ()*& ()*& && ** ( ) &( ) *& ( ) (&) (&) (&) (( )) (()) ()() &*&*& *&*&*",
        "Words": "faith & works; mercy & justice; pray & serve; bread & blankets; love *(costly)*, hope *(steady)*; AMDG & mission (go & give); truth & tenderness; neighbor & need; ora & labora (pray & work); vow & vow@renewal; body & soul (one & whole).",
        "Control": "& && &&& &&&& * ** *** **** ( () (()) ((())) ) )) ))) &* &*& &*() ()*& (&) (*) (&) (*) &( ) *( ) &(&) *(*) ((*)) &*( )&* (*)& &*() ()*& &*&*& *&*&* &*& &*& &*& ",
        "Sentences": "Grace & grit belong togetherf pray & serve, listen & act, give & go. Use oppositedhand Shift (*) and keep wrists level; type (&) as a link of love, and bracket distractions ( ) while you breathe. The goal isn't noise but skilli strings like &*() &*() steady the right hand, while words stay light. Practice with kindness (& patience) and end with a quiet amen ( ).",
        "Test": "Run laddersm & Z &* Q &*() d ()*&; mirrorsW () t ()* , ()*& t &*(); triplets! &&&, ***, ((()), ()); sets@ &* &*& &*() ()*&; minute drill5 &*() ( 10; then( (&) (*) ( ) & (&) (*) ( ); finish with & &* &*() ()*& (()) ((())) && ** ()."
      }
    },
    {
      "title": "!@#$&*()",
      "Img": [
        "img/qwerty.jpg",
        "img/allfingers.jpg"
      ],
      "guide": "<p>All eight left/right number-row symbols in one place: ! @ # $ & * ( ). Tap with the proper finger, use the opposite-hand Shift, strike lightly, and reset to home row. We’ll tag AMDG prompts, mission notes, and budgets to make drills memorable while keeping symbol load high.</p>",
      "subunits": {
        "Grip": "! ! !! !!! @ @ @@ @@@ # ## ### #### $ $$ $$$ $$$$ & && &&& * ** *** ( ) (( )) ) ) ) Z S; icn ,B ;!0 r * / !@ #$ &* () !@#$ &*() !@#$&*() @#!$ $!#@ (#) (*) (!)",
        "Words": "#AMDG! @Ignatius #Examen! $alms @mission #Magis! pray (&) serve (*); love (costly) w grace (free); tag @parish #service $budget; note# '!' urgency, '@' mention, '#' topic, '$' value, '&' join, '*' multiply, '( )' hold, 'b' add.",
        "Control": "! !! !!! !!!! @ @@ @@@ @@@@ # ## ### #### $ $$ $$$ $$$$ & && &&& &&&& * ** *** **** ( () (()) ((())) ) )) ))) )))) v 8o xJE hE1g x 3; X.o Hd8e !@ !@# !@#$ !@#$& !@#$&* !@#$&*() @# @#$ @#$& @#$&* @#$&*() #$ #$& #$&* #$&*() $& $&* $&*() &* &*() () ()() ()()() ()()()() 7n r&I bD4G",
        "Sentences": "Signal cleanlye ! urgency, @ address, # topic, $ value, & link, * multiply, ( ) contain, W add. Exampleq #AMDG!0order work to God's glory; @team, update #budget$ $10&$5 for alms; serve (&) study; pray (*) practice; write (goals) and add c review. Type !@#$&*() in runs; breathe; return to home row.",
        "Test": "!@#$&*() c 10; laddersH ! & !@ 2 !@# p !@#$ , !@#$& M !@#$&* 1 !@#$&*(); mirrorsF () w ()* f ()*& ; &*() e &*()$#@!; tagse #faith #hope #charity; budgetu $1$$37$5K$8; pingsf @campus @parish @service; finishp !@ !@@ !@@@ # ## ### $ $$ $$$ & && &&& * ** *** ( ) (( )) ) ) ) u O! onU , pU t&n."
      }
    },
    {
      "title": "`-=~%^_+",
      "Img": [
        "img/qwerty.jpg",
        "img/littleandforefingers.jpg"
      ],
      "guide": "<p>US QWERTY focus on backtick/tilde, minus/underscore, equals/plus, percent, caret, and underscore joins. Use opposite-hand Shift for all shifted symbols. On most courses: ` and ~ with the left little finger; -/_ and =/+ with the right little finger; % on 5 with the left index; ^ on 6 usually with the right index (some curricula teach left index). Keep wrists level and return to home row after each reach.</p>",
      "subunits": {
        "Grip": "` ` `` ``` -- --- ---- == === ==== ~~ ~~~ ~~~~ %% %%% %%%% ^^ ^^^ ^^^^ __ ___ ____ ++ +++ ++++ `-` `=` `~` `^` `_%_` `+` -= -=- =-= ==-- --== ~~== ==~~ %%^^ ^^%% __++ ++__ `-=~%^_+` `-=~%^_+` `-=~%^_+` mix: `- = ~ % ^ _ + ; return-home; breathe; repeat. ladders: ` -U `- -` `-= -L `-=~ -w `-=~% -^ `-=~%^ -5 `-=~%^_ -9 `-=~%^_+ ; mirrors: +_^-~=-` ; `-=~^-_+ ; _^%~-=` ; steady hands, soft touch.  `-=~%^_+` `-=~%^_+` `-=-= ==-- ~~== %%^^ __++ `~~~` --- === ___ ++++ %%^^ ^^%% --== ==-- ",
        "Words": "`AMDG` ~mission ^prayer _examen +charity -ego =service %mercy ratio_studiorum~1599 ; manresa^1522 ; montmartre=1534 ; pamplona-1521 ; canonization=1622 ; use `_` to join, `-` to separate, `=` to assign, `~` to approximate, `^` to mark superscripts, `%` for shares, `+` to add. practice: `-=~%^_+` `-=~%^_+` `-=~%^_+` ; compose: love+justice=service ; pride-ego=freedom~humility ; hope^2 + mercy^2 ~= joy^2 ;  repeat:`-=~%^_+` add:+ plus:+ join:_ sep:- approx:~ assign:= share:% raise:^ `faith` `hope` `love` ; ",
        "Control": "` `` ``` ```` - -- --- ---- = == === ==== ~ ~~ ~~~ ~~~~ % %% %%% %%%% ^ ^^ ^^^ ^^^^ _ __ ___ ____ + ++ +++ ++++ `- `-` -`- -= -== -=== =- =-- =--- ~% ~%% %~ %~~ ^_ ^__ _^ __^ +_ _+ ++_ _++ `-= `-=~ `-=~% `-=~%^ `-=~%^_ `-=~%^_+ ;  `  `- -` -= =- ~% %~ ^_ _^ +_ _+ __ ___ ++ +++ -- --- == === ~~ ~~~ %% %%% ^^ ^^^ "
      }
    },
    {
      "title": "Chars passages",
      "Img": [
        "img/symbol-drills.jpg"
      ],
      "guide": "<p>Intensive symbol practice: focus on ! @ # $ & * ( ) and ` - = ~ % ^ _ +. Keep shoulders down, wrists level, eyes on text; tap lightly and use opposite-hand Shift, then return to home row. Short anchors like #AMDG (Jesuit motto) and “Examen” keep meaning present while you drill primarily symbols.</p>",
      "subunits": {
        "Passage 01": "#AMDG !@#$ &*() `-=~%^_+ ; pray(quietly)*serve(bravely); @team #works_of_mercy $10+$5+$3 for alms; review* examen~daily -k ask+thank+review+repent+resolve; loopZ !@#$ !@#$ &*() &*() `-=~%^_+ `-=~%^_+ ; breathe, reset, continue.",
        "Passage 02": "@mission #Magis !start now% $0+$1+$2+$3 budget; link love&justice -A service(+); trim pride-ego=0; keep hope^2+mercy^2~=joy^2; drillF `-`=`-=`, then `-=~` -V `-=~%^` -C `-=~%^_+`; repeat !@#$ &*() cleanly.",
        "Passage 03": "#examen @eveningM ask+thanks+review+repent+resolve; type runsk !@ !@@ !@@@ ### $$$ &&& *** ((())) ; weave `~~~` --- === ___ ++++ %% ^^ __ ++ ; finish with !@#$&*() `-=~%^_+.",
        "Passage 04": "signal= ! urgency, @ address, # topic, $ value, & join, * multiply, ( ) hold, ~ approx, ^ raise, _ joiner, - minus, = assign, + add; now drillz !@#$3!@#$&K!@#$&*)!@#$&*()Q`-=~%^_+ ; repeat twice, eyes up.",
        "Passage 05": "#AMDG @parish $alms & service * practice (daily); ledgerh $1+$3+$5+$8; hashtagso #faith #hope #charity; laddero ` -z `- -F `-= -G `-=~ -b `-=~% -# `-=~%^ -3 `-=~%^_ -c `-=~%^_+ ; pause, repeat.",
        "Passage 06": "composee love+justice=service; pride-ego=loss; mercy&truth(steady); drill sets, !! @@ ### $$$ && ** ( ) ; mixG !@#$ !@#$ ; mirror% ()*& n &*()$#@! ; close with `-=~%^_+`.",
        "Passage 07": "@campus ping; #budget# $12+$15+$22; quick prayer(examen)F ask+thank+review+repent+resolve; practice blockd `~~~` ___ --- === ; stackV %%^^ ^^%% ; cycle2 !@#$ &*() `-=~%^_+ ; soft touch, steady tempo.",
        "Passage 08": "labels4 #Gospel #Examen #AMDG; math-note, hope^3~joy^3 when love+mercyTego; drill0 !@ !@# !@#$ !@#$& !@#$&* !@#$&*() ; splice with `-` `_` `=` `+` ; rest, repeat, return home.",
        "Passage 09": "works_of_mercy/ feed+give+visit+shelter+bury (USCCB ref); type symbols not words! $$$ $+$+$ ; @team @service @neighbor ; hashtag streamb #mercy #justice #welcome ; weave &*() &*() and `-=~%^_+` cleanly.",
        "Passage 10": "roadmap* plan=pray+serve; budget=$10+$10+$5; tags8 #Magis #AMDG #daily_examen ; cadencew !@#$ !@#$ !@#$ ; then chains `-= -2 `-=~ -u `-=~%^ -T `-=~%^_+ ; close with (&) (*) ( ) + +.",
        "Passage 11": "countdownst !!! @@@ ### $$$ &&& *** ((( ))) ; crossfade1 `~~~ --- === ___ ++++` ; stair-stepq ! F !@ C !@# ' !@#$ D !@#$& 1 !@#$&* p !@#$&*() ; breathe every 3 sets.",
        "Passage 12": "mantra+ #AMDG; examen~nightly; add+$, remove-, assign=, join_, raise^, approx~, hold( ), multiply*; full run1 !@#$&*() !@#$&*() `-=~%^_+ `-=~%^_+ ; mirrorU ()*& N &*() ; finish with clean stops.",
        "Passage 13": "@Jesuits #missionC serve&teach; budget lineT $1+$3+$5+$8 ; drill fieldj `-=-=` ==-- ~~== %%^^ __++ ; loop twice; then sprintn !@#$&*() `-=~%^_+ ; accuracyhspeed-always.",
        "Passage 14": "signal setB #faith! #hope! #charity! ; replya @friend @parish ; gift line+ $10+$2+$1 ; enterx &*() &*() ; computeQ mercy^2+patience^2~=peace^2 ; conclude with `-=~%^_+`.",
        "Passage 15": "review(examen)l ask+thanks+review+repent+resolve; drill ladderR ` -v `= -. `=+ -m `=+_ -) `=+_^ -s `=+_^% -p `=+_^%~ ; then splice !@#$ &*() ; finish steady.",
        "Passage 16": "AMDG tagy #AMDG @today ; buildS love+truth=service ; subtracta pride-ego=0 ; reservel (quiet) *(steady)* ; type blocksZ !@#$ !@#$ !@#$ ; weave `-=~%^_+` between sets; reset posture.",
        "Passage 17": "pingD @campus,@service ; topicsC #mercy,#justice ; fund( $2+$2+$4+$8 ; chainsc `=== ___ --- ~~~` ; pairs* %% ^^ __ ++ ; final braidt !@#$ &*() `-=~%^_+ ; eyes up, no peeking.",
        "Passage 18": "notationk (faith)+ (hope)+ (love)=life ; compressa ego- -% 0 ; expand. mercy^ -& growth ; drill' !@ !@@ !@@@ ; @# $& *() ; then long form` !@#$&*() !@#$&*() ; closet `-=~%^_+`.",
        "Passage 19": "short prayer$ #Examen @evening ; steps8 ask+thank+review+repent+resolve ; symbols first; ! !@ !@# !@#$ ; then &* &*() ; finish_ `-= `-=~ `-=~%^ `-=~%^_+ ; soft, precise, patient.",
        "Passage 20": "final mixZ !@#$&*() + `-=~%^_+ ; tagsx #AMDG #Magis #works_of_mercy ; amountsm $1+$3+$5+$8 ; joins` love&service, pray&go ; keepI (humble) *(bold)* ; mirror onceb ()*& A &*()$#@! ; done."
      }
    },
    {
      "title": "Fluidity practice",
      "Img": [
        "img/fluidity.jpg"
      ],
      "guide": "<p>Type these fluidity passages using every skill from Units 1–25: steady letters, dense numbers, and confident symbols. Keep wrists level, use opposite-hand Shift, and return to home row after each reach. These lines weave Ignatian anchors—A.M.D.G., Examen steps, and rules for discernment—into mixed drills so accuracy stays first, rhythm follows, and speed grows naturally.</p>",
      "subunits": {
        "Ignatius Journey": "Pamplona (1521) breaks pride; Montserrat (1522) bends plans; Manresa (1522) births the Examen; Paris (1534) vows; Rome (1540) sends. I type and travel3 walkKwatch9write; tagsU #AMDG, @companions; budgetf $1+$3+$5+$8; mapsN 1491G1556; prayerE ask+thank+review+repent+resolve; ladderO !@ @ !@# e !@#$ H !@#$&*(); braid with `-=~%^_+` and steady letters-free hands, firm hope, full heart. Order work to God's glory-A.M.D.G.-return to home row.",
        "Bible Hope": "Bible hope speaks in numbers and namesC Jn 3)16, Lk 15s4-7, Mt 533-12, Ps 23, Rom 8. I type, 3,1695t3C23z8; I breathe; I believe. Shepherd words steady steps0 walk-rest-restore; symbols say it short-! urgency, @ address, # topic, $ gift; I tag #faith #hope #charity and add $1+$3+$5+$8; I weave `-=~%^_+` between verses and write the examen nightly2 ask+thank+review+repent+resolve.",
        "Jesuit Scientists": "Jesuit scientistsH Clavius 1538-1612 (calendar math); Kircher 1602-1680 (museums & magnets); Boscovich 1711-1787 (forces); Secchi 1818-1878 (spectra). I type ladders_ 1538#1612f1602y1680L1711W178771818O1878; tagsC #ratio #observatory; budget linee $1+$3+$5+$8 for lenses; equationss hope^2+reason^2~=service^2; drill` !@#$&*() woven with `-=~%^_+`; aim calm speed, clean errors, clear eyes.",
        "Catechism Creation": "Catechism6 CCC 1, 27, 293; creation ex nihilo, ordered to glory; human hearts made for God, restless until they rest in him. Digits anchor thought. 6 days, 7th rest; I types 1s27O293, then 6q7; symbols summarize-= assign, - subtract, + add, ~ approximate, ^ raise, ( ) hold; full run_ !@#$&*() braided with `-=~%^_+`; return to home row-AMDG.",
        "Discernment Rules": "Discernment9 SE 313-327 name rules for the first set; 328-336 the second. In desolation, never change (rule 5); in consolation, plan humbly; check the source, course, and fruit. I drill flowsJ ask+thank+review+repent+resolve; then symbols1 !@#$&*() and `-=~%^_+`; I tag #consolation #desolation, add $1+$3+$5+$8, and end with #AMDG."
      }
    }
  ]
}