{
  "main": [
    {
      "title": "asdf jkl;",
      "Img": ["img/home-keys-position.jpg"],
      "guide": "<p>All the eight fingers except the thumbs should be placed on the home row. This is done by placing the left forefinger on F and the right forefinger on J. Place the remaining fingers on the keys beside them in a natural manner. So, the left little finger would be on A and the right little finger would be on the ; (semicolon) key. Use the right little finger to remove an error with ← key.</p><p>To type any key, press the key with the finger over it. Use one of the thumbs to press the space bar. Keep your eyes on the screen as you type. Do not look at the keyboard.</p><p>Proceed to the next lesson only when you can type with 2% or less errors and atleast 20 words/minute (WPM). Accuracy is more important than speed for a beginner.</p><p>Note:</p><p>With one hour practice every day, you can master typing in two weeks(up to Unit 15)! One more week for mastering numbers(up to Unit 21). The rest is for full keyboard mastery.</p><p>As you practice, you'll encounter terms related to Bible scriptures and Ignatian spirituality to inspire your learning.</p>",
      "subunits": {
        "Grip": "asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj fdsa jkl; fdsa jkl; fdsa jkl; fdsa jkl; fdsa jkl; asdf fdsa ;lkj jkl; asdf fdsa ;lkj jkl; asdf jkl; ;lkj fdsa asdf jkl; ;lkj fdsa ask; ask; ask; ;sad ;lad ;fall ;all; as;d f;sa a;sd ;asl ;sda ;jkl ;l; ;;; asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj fdsa jkl;",
        "Words": "all all all; sad sad sad; dad dad dad; ask ask ask; add add add; fall fall fall; lad lad lad; fad fad fad; ass ass ass; lass lass lass; alas alas alas; salad salad salad; as as as; ask ask ask; all all all; salsa salsa salsa;",
        "Control": "d da dad; a al all; f fa fad; s sa sad; a al all; a as ass; f fa fal fall; d da dad; a al all; f fa fad; s sa sad; a al all; a as ass; l la lal lall; f fa fall; l la lad; a al all;",
        "Sentences": "ask dad; ask dad; ask dad; all lads fall; all lads fall; all lads fall; a lad asks; a lad asks; a lad asks; sad lads fall; sad lads fall; sad lads fall; ask dad; ask dad; ask dad; all lads fall; as all; alas; salad; all lads ask; all lads ask; as all; alas;",
        "Test": "all sad dad ask add fall lad fad ass lass sa add; lass sad lad all dad; lad sa a ask; sa lass all; ask dad fad lad; all as a; dad fad ass lass all as a dad; a lad asks; ask dad; all lads fall; all sad dad ask add fall lad fad ass lass sa add; alas salad; all lads ask; as as; all all;"
      }
    },
    {
      "title": "ru",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type R and the right one to type U. After striking the R or U keys, return the forefingers back to the original position on F or J.</p><p>Practice words inspired by spiritual themes like faith and scripture.</p>",
      "subunits": {
        "Grip": "frfr juju frfr juju frfr juju; rfrf ujuj rfrf ujuj rfrf ujuj; jrjr fufu jrjr fufu jrjr fufu; rjrj ufuf rjrj ufuf rjrj ufuf; asdf r; ;lkj u; asdfr ;lkju asdfr ;lkju rfdsa ujkl; rfdsa ujkl; asfdr ujkl; asdfr ujkl; rfdsa ujkl; urfu ujku rfur luru rjur arru ursr druj drur arsufr frrur jurru urrsu uusrr drlursu uslru frsusl arfu jfru frfr juju frfr juju frfr juju; rfrf ujuj rfrf ujuj rfrf ujuj; frfr juju rfrf ujuj jrjr fufu rjrj ufuf frfr juju rfrf ujuj jrjr fufu rjrj ufuf",
        "Words": "far far far; fur fur fur; rar rar rar; lark lark lark; radar radar radar; surf surf surf; dull dull dull; urdu urdu urdu; full full full; rural rural rural; us us us; usual usual usual; laura laura laura; russ russ russ; pray pray pray; rule rule rule; refuel refuel refuel; fur fur fur; far far far;",
        "Control": "s su sur surf; r ra rad rada radar; f fu ful full; f fu fur; l la lar lark; u ur urd urdu; f fu fur; l la lau laur laura; f fa far; r ru rur rura rural; s su sur surf; r ra rad rada radar; f fu ful full; u us usu usua usual; r ru rul rule;",
        "Sentences": "laura reads scripture as usual; laura reads scripture as usual; ask russ about faith; ask russ about faith; laura reads scripture as usual; rural surf is unfair; russ will pray; a friar reads a rule; laura reads scripture as usual; ask russ about faith; laura and russ read; refuel and return;",
        "Test": "radar rural laura russ fur lark rar surf; far usual russ full lark laura dull; laura reads scripture as usual; ask russ about faith; refuel and return; rule and pray; rural surf unfair; far far; fur fur; rural rule; urdu usual; laura and russ read; rule;"
      }
    },
    {
      "title": "vm",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type V and the right one to type M. After striking V or M, return each forefinger to its home positions on F and J before continuing. In this unit we weave in Ignatian themes—Magis, mission, and St. Francis Xavier—so you build steady motion and meaning together.</p>",
      "subunits": {
        "Grip": "fvfv jmjm fvfv jmjm fvfv jmjm; vfvf mjmj vfvf mjmj vfvf mjmj; jv jv jv jm mv mv mv mj; fv jm fv jm fv jm; fvfv jmjm fvfv jmjm; vfvf mjmj vfvf mjmj; fv mv fv mv; jm vj jm vj; fvfv jmjm fvfv jmjm fvfv jmjm; vfvf mjmj vfvf mjmj vfvf mjmj; fv jm fv jm; mv mv mv; jm jm jm; fvfv jmjm fvfv jmjm; vfvf mjmj vfvf mjmj; fvjm mvjm fvjm mvjm; fv fv fv; jm jm jm; v v v; m m m; fvfv jmjm vfvf mjmj fvjm mvjm;",
        "Words": "madam madam madam; malva malva malva; lava lava lava; vow vow vow; move move move; eve eve eve; Magis Magis Magis; mission mission mission; Xavier Xavier Xavier; viva viva viva; motive motive motive; avail avail avail; maven maven maven; moral moral moral; revive revive revive; vessel vessel vessel; Ave Maria Ave Maria Ave Maria; salvation salvation salvation; evolve evolve evolve;",
        "Control": "m ma mag magi magis; v va vas vass vassa vassal; m mo mov move mover; v vi viv vivi vivid; m ma mav mave maven; v vo vow vowe vowed; m mo mor mora moral; v va val vali avail; m mo mot moti motiv motive; v ve ves vess vesse vessel; m ma man Imma Imman Immanu Immanuel; vivid;",
        "Sentences": "make a vivid move: value Magis over vanity; many vowed to serve in a mission; St Francis Xavier moves villages to the font; a maven of mercy avoids vain motives; we value meekness and magnanimity; viva Maria, all marvel; mission marvels invite measured movement;",
        "Test": "madam malva lava; vow move eve; Magis mission Xavier; viva motive avail; Ave Maria salvation; maven moral evolve; revive vessel Immanuel; make a vivid move; value Magis; serve in a mission; maven of mercy; viva Maria; many vowed; value meekness; avoid vain motives; vivid village move; mission marvels;"
      }
    },
    {
      "title": "ei",
      "Img": ["img/middlefingers.jpg"],
      "guide": "<p>Use the left middle finger to type E and the right middle finger to type I. Return them to D and K after each strike. The practice passages refer to the Daily Examen and Ignatian discernment to keep focus precise while your fingers learn accurate reach and recovery.</p>",
      "subunits": {
        "Grip": "dede kiki dede kiki dede kiki; eded ikik eded ikik eded ikik; dede kiki dede kiki; eded ikik eded ikik; deki kide deki kide; idek kedi idek kedi; de de de; ki ki ki; ed ed ed; ik ik ik; dede kiki dede kiki dede kiki; eded ikik eded ikik eded ikik; deki deki deki; kide kide kide; d d d d d; e e e e e; i i i i i; k k k k k; dede kiki dede kiki dede kiki; eded ikik eded ikik; deki kide deki kide deki kide; dede kiki dede kiki dede kiki; eded ikik eded ikik;",
        "Words": "examen examen examen; examine examine examine; discern discern discern; desire desire desire; believe believe believe; receive receive receive; revive revive revive; relieve relieve relieve; deliver deliver deliver; evidence evidence evidence; service service service; silence silence silence; interior interior interior; ignite ignite ignite; divine divine divine; obedience obedience obedience; exile exile exile; resilience resilience resilience; mercy mercy mercy; rejoice rejoice rejoice; conscience conscience conscience; consolation consolation consolation; desolation desolation desolation; reconcile reconcile reconcile; reverence reverence reverence; evening examen evening examen evening examen;",
        "Control": "e ex exa exam exame examen; i in ini init inite ignite; e en ene ener energ energy; i in ind inde indep independe independent; e ev evi evid eviden evidence; i in inte inter interi interior; e ei eigh eight eighteen; e en end ende endea endeavor; i in ind indifer indiffer indifferen indifference; e ob obe obed obedie obedience;",
        "Sentences": "each evening examen invites interior review: receive, review, resolve; in silence, I discern invisible drives; Ignatius invites indifference rightly: neither exile nor desire rules; evidence arises in consolations and desolations; reverence and service give life; exercise the examen in retreats, in cities, in service; in each season, I revise the review, decide in freedom; interior eyes see divine devises in everyday life;",
        "Test": "examen examine evidence; discern desire believe receive; revive relieve deliver; retrieve derive evince; service silence interior ignite divine; obedience exile resilience; mercy rejoice conscience consolation desolation reconcile reverence; evening examen review; interior review resolve; exercise examen in retreat; city or desert; ever receive grace; ignite inner insight; decide in silence; reverence serves love; examen every evening;"
      }
    },
    {
      "title": "c,",
      "Img": ["img/middlefingers.jpg"],
      "guide": "<p>Use the left middle finger to type C and the right middle finger to type the comma (,). Strike the key, then return each finger to its home position (D for the left middle finger, K for the right). This unit leans on Catholic themes—catechism, conscience, and cura personalis—so practice stays purposeful while your precision with C and the comma grows.</p>",
      "subunits": {
        "Grip": "dcdc k,k, dcdc k,k, dcdc k,k, cdcd ,k,k cdcd ,k,k cdcd ,k,k fcfc ,m,m fcfc ,m,m fcfc ,m,m dece ,iki, deke ,iki, deke ,iki, c,c, c,c, c,c, ,,, ,,, ,,, ck ck ck, ck ck ck, dc, dc, dc, kc, kc, kc, cdec, ,kik, cdec, ,kik, cdfc ,jm, cdfc ,jm, cdfc ,jm, dcdc k,k, dcdc k,k, dcdc k,k, cdcd ,k,k cdcd ,k,k cdcd ,k,k",
        "Words": "grace, circa, circle, civic, mercy; receive, reconcile; candle, cenacle, creed; Ecce, ecclesial, catechism; covenant, covenantal; carmel, caritas; sacred, sacrament, service; practice, mercy, justice; courage, counsel; conscience, compassion; cura personalis;",
        "Control": "c ca cat cate catec catech catechi catechis catechism; co con consc conscie conscien conscience; ca car cari carit carita caritas; cu cur cura curam curare; ce cen cenac cenacl cenacle; ci civ civi civic; re rec rece recei receiv receive; re recon reconci reconcil reconcile; se serv servi servic service; sac sacra sacram sacrame sacramen sacrament;",
        "Sentences": "Conscience, carefully formed by catechism, guides calm choices; cura personalis calls us to care, counsel, and console; in the cenacle, we recall sacred service, receive mercy, and reconcile; choose courage, carry grace, and practice compassion daily.",
        "Test": "grace, circle, civic, catechism; conscience, counsel, compassion; cura personalis, sacred service, reconcile and receive; covenant recalled, cenacle remembered; choose carefully, compose calmly, practice charity; mercy, justice, service, courage, care; repeat, recall, reconcile."
      }
    },
    {
      "title": "gh",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type G and the right forefinger to type H. After each stroke, return both fingers to F and J. We will practice common “gh” patterns—though, through, light, high—using short lines about grace and growth drawn from Ignatian spirituality, keeping accuracy first and speed second.</p>",
      "subunits": {
        "Grip": "fgfg jhjh fgfg jhjh fgfg jhjh; gfgf hjhj gfgf hjhj gfgf hjhj; ghgh ghgh ghgh; fgjh fghj fjgh jghf; hg hg hg, gh gh gh; fg fg fg; jh jh jh; g,h, g,h, g,h, fgfg jhjh fgfg jhjh fgfg jhjh; gfgf hjhj gfgf hjhj gfgf hjhj;",
        "Words": "glory; grace; high; light; bright; might; sight; weight; neighbor; though; through; thorough; thought; nigh; night; daylight; highlight; daughters; neighbors; almighty; drought; laugh; rough; tough; enough; bough; plough; straight; strength; length; strengthen; Gospel; hagiography; hagiology; high-priest; Ignatius; Hugh; Hugh of St Victor; right; upright; righteous; light-bearing; high-minded; foresight; hindsight; insight; oversight; sought; wrought; brought; weigh; weighed; weighty; teaching; preaching; reaching; shepherding though rough nights; through high grace, growth; lighthouse; highlands; mightily, humbly, however; bright hymn; Though I walk through the night, I hold the light; though rough weather, grace grows; height upon height; enough light for the next right step; through far length and breadth, God's light shines;",
        "Control": "g gh ghi high; gh ghe gho ghou ghoul; th tho thou though; thr thro throu through; tho thor thorough; li lig ligh light; hi hig high; mi mig migh might; ri rig righ right; we wei weig weigh weight; ni nig nigh night; bri brig brigh bright;",
        "Sentences": "Through high grace, bright light gathers the humble; though rough nights weigh heavy, right insight grows; be strong and gentle: hold light high, go through the height with might; Ignatius taught that God works through desires: weigh them, watch their light, walk rightly; neighbors brought laughter through drought; tough enough, yet kind enough, through and through.",
        "Test": "grace, high light; bright night; though, through, thorough; right might sight; weigh weight; nigh night; brought and wrought; rough though tough enough; hold the light high; go through; walk rightly; neighbors laugh; drought passes; growth gathers."
      }
    },
    {
      "title": "ty",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type T and the right forefinger to type Y. After each strike, return forefingers to F and J to rebuild steady reach and recovery. The passages weave Ignatian language—Trinity, charity, interiority—so your practice trains both accuracy and meaning.</p>",
      "subunits": {
        "Grip": "ftft jyjy ftft jyjy ftft jyjy; tftf yjyj tftf yjyj tftf yjyj; tyty tyty tyty; ftjy tfjy jfty jyft; ttyy ttyy ttyy; ft ft ft; jy jy jy; t,y, t,y, t,y, ftft jyjy ftft jyjy ftft jyjy; tftf yjyj tftf yjyj tftf yjyj; trty yrty trty yrty; ftjt tyfj; fty fty fty; jyt jyt jyt; ty ty ty; tt tt tt; yy yy yy; ftft jyjy ftft jyjy ftft jyjy; tftf yjyj tftf yjyj; try jytr try jytr try jytr; ftft jyjy ftft jyjy ftft jyjy; tftf yjyj tftf yjyj; tyty jyjy tyty jyjy; tttt yyyy; ftjy jyft;",
        "Words": "Trinity, eternity, sanctity, purity, charity, humility, fidelity, piety, unity; liturgy, mystery, mercy, majesty; loyalty, dignity; forty days in quiet prayer become a steady story of clarity; spirituality that gently trains the will to say freely yes; interiority, serenity, gravity; poverty and holy liberty rightly ordered toward charity; Ignatian priority: seek greater utility for God’s glory—interiority before activity; daily fidelity to the examen yields interior lucidity; fraternity and amity sustain stability; purity of intention, clarity of desire, integrity of action; contemplative activity: quietly, steadily, joyfully; holy simplicity, steady industry, sturdy mercy; pray quietly, study intently, serve kindly; discern wisely; yield pride, tidy vanity, tidy anxiety; choose holy liberty; Trinity, unity, charity, piety, purity, sanctity; Society, fraternity, ministry, fidelity, integrity, clarity, serenity, stability.",
        "Control": "t ti tini tiny; t ty typ type typed typing; tr tri trin trinit trinity; un uni unit unity; pi pie piet piety; sa sac sacri sacrit sanctity; ch cha char chari charity; lo loy loyal loyalty; cl cle clar clari clarity; hu hum humi humili humility; fi fid fide fidel fidelity; pu pur puri purit purity; se ser sere seren serenity; mi min mini minist ministry; in inte inter interior interiority;",
        "Sentences": "Today I try to type with patient unity of mind and body: tiny movements, tidy rhythm, steady eyes; the Trinity invites charity over vanity, fidelity over anxiety, clarity over ambiguity; Ignatian piety says quietly: test every interior desire, then freely say your Yes; the Society of Jesus lives a steady charity in busy cities, yet keeps interior serenity; in retreat I study quietly, pray intently, and return ready to serve joyfully. I try again quietly, steadily, choosing unity.",
        "Test": "Trinity, unity, charity, piety; steady yes, tidy rhythm; Society of Jesus: interior serenity, exterior ministry; humility, fidelity, purity, clarity; quietly pray, intently study, kindly serve; loyal yet free, ready yet gentle; forty days become a steady story of mercy; test your desire, try your yes; today I type truly; steady hands, steady eyes, steady interiority; choose charity over vanity; seek unity before activity."
      }
    },
    {
      "title": "bn",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type B and the right forefinger to type N. Return both to F and J after each strike. This unit leans on Benedictus, bonum commune, and neighbor-love—Catholic themes that help you build strong index-finger control while keeping content uplifting.</p>",
      "subunits": {
        "Grip": "fbfb jnjn fbfb jnjn fbfb jnjn; bfbf njnj bfbf njnj bfbf njnj; bnbn bnbn bnbn; fbjn fbnj jfnb njbf; bn bn bn; ff nn ff nn; fj fj fj; bn,bn, bn,bn, bn,bn; fbfb jnjn fbfb jnjn fbfb jnjn; bfbf njnj bfbf njnj bfbf njnj; brbn nbbr brnb nbbn; fbjb nbfj; bfn bfn bfn; njb njb njb; bb bb bb; nn nn nn; fbfb jnjn fbfb jnjn; bfbf njnj bfbf njnj; bnfj jnbf bnfj jnbf; fbfb jnjn fbfb jnjn; bnbn jnjn bnbn jnjn; bbnn bbnn; fbjn fbjn; njbf njbf;",
        "Words": "Benedict, Benedictus, benediction, benison; Bonaventure on bonum commune; Bernini’s noble bronze; Barnabas, good neighbor; begin, begin anew, be born again; benign, benevolent, benefactor, benefit; noble and notable neighbor; abandon numb habits; be brave; Ignatian abandonment of narrow bondage begins new being; bound to the benign Lord, be kind; balance boldness and benevolence; banners and candles in Benediction; benedictional blessings bring inner benignness; beneath burdens, be gentle, not naive; ban bitterness; bind your mind to now; banish blame; bring bread and blankets; be neighborly; be near and attentive; begin by naming the need; bonum for the common neighbor becomes binding benevolence; be not anxious: be near, be new, be neighborly.",
        "Control": "be ben bene benef benefit; bo bon bona bonum; ba ban band bandon abandon; ne nea near nearby neighbor; no nob noble nobler noblest nobility; bi bin bind binding; be beg begin beginning; in ign igna ignat ignati ignatian; be bene benev benevol benevolent; co comm common commune; bo bon bene benign benignity; ba ban banish banished;",
        "Sentences": "Benedictus is blessed: be a neighbor who brings bread, blankets, and kindness; begin again when burdens bend the back; ban bitterness and bind your mind to the now; the common good—bonum commune—needs bold but benign nobility; Ignatian freedom abandons narrow bonds so new being can begin; be near to the broken; be attentive, not nosy; be benevolent, not naive; noble love is born in hidden benches where no banners wave, but neighbors are known.",
        "Test": "Benedict, Benedictus, benediction; bonum commune; begin again, be born anew; benign and benevolent neighbor; abandon numb bondage; bind the mind to the now; banish blame; be near; bring bread and blankets; be kind; noble but not naive; be known by neighborly benevolence; begin by naming the need; be bold, be benign, be benevolent. Be a beacon in the night."
      }
    },
    {
      "title": "wo",
      "Img": ["img/ringfingers.jpg"],
      "guide": "<p>Use the left ring finger to type W and the right ring finger to type O. After each strike, return both fingers to S and L’s home partners so reach remains measured. This unit draws on Jesuit motifs—‘Word’, ‘work’, and the motto <em>Ad Majorem Dei Gloriam</em>—to make practice purposeful while you build smooth arcs to W and O.</p>",
      "subunits": {
        "Grip": "swsw lolo swsw lolo swsw lolo; wsws olol wsws olol wsws olol; wowo wowo wowo; swol losw swol losw swol losw; ow ow ow, wo wo wo; sw sw sw; lo lo lo; w,o, w,o, w,o, swsw lolo swsw lolo swsw lolo; wsws olol wsws olol wsws olol; wowo lolo swsw olol wowo lolo;  swol losw swol losw;",
        "Words": "word; world; work; worship; wonder; witness; wisdom; worth; woe; woo; wood; wool; womb; wove; woven; welcome; wolf; wolfhound; wombat; woman; women; whole; wholeness; whose; whom; whorl; woad; woke; wok; wokpan; worry; worthy; workshop; workbook; workroom; word-of-God; worldwide; works-of-mercy; wounded; wonder-working; wonderment; witnessing; wondrous; worshippers; Wycliffe; Wesley; Wales; Warsaw; Worcester; Origen on the Word; Loyola on holy work; AMDG motto; world-in-Christ; own; owe; owed; owing; owner; oath; oasis; oak; oar; oat; oats; oathkeeper; obedience; offering; office; often; ordo; ordo-amoris; offerory; oration; orationis; orthodoxy; orthopraxy; oratory; Oratorians; ordination; ordo caritatis; orphan; orphans; oracle; orison; orchestra; organ; organum; organist; organs; Olivet; Oath of office; office of readings; Ordo;",
        "Control": "w wo wor work worship; w wi wis wisd wisdom; w wo wor word wordy; o or ord ordo; o of off offe offer offering; o or orat oratio oration; w wa wav wove woven; w wo wor world worldly; o ob obed obedie obedience; w wi wit witn witne witness;",
        "Sentences": "We work with the Word, not merely words: worship orders our work toward the world’s true good; with wide eyes we witness humble wonders—wolf and willow, widow and orphan—and we offer what we owe. Ad Majorem Dei Gloriam: we own only our will to offer; we open ordinary offices to holy order; we welcome those who worry or weep, and we work without whining. When worries overwhelm, we walk, watch, and write the examen, so our will aligns with love and our work becomes worship.",
        "Test": "word world work worship; witness wisdom worth; whole and wholesome; welcome widow orphan; owe and own: offer, not withhold; Ad Majorem Dei Gloriam—work ordered to love; write the examen; walk, watch, and welcome; we will work well when worship wills it."
      }
    },
    {
      "title": "x.",
      "Img": ["img/ringfingers.jpg"],
      "guide": "<p>Use the left ring finger to type X and the right ring finger to type the period (.). Return them to S and L’s home partners after each stroke. This unit leans on Ignatian words beginning with ‘ex-’: examen, exercises, examen again, so your reach to X and timing on full stops becomes exact.</p>",
      "subunits": {
        "Grip": "sxsx l.l. sxsx l.l. sxsx l.l.; xsxs .l.l xsxs .l.l xsxs .l.l; x.x. x.x. x.x.; sx.l ls.x sx.l ls.x sx.l ls.x; x. x. x., .x .x .x; sx sx sx; l. l. l.; x,. x,. x,. x.x. l.l. sxsx .l.l; x.x. l.l. sxsx .l.l; sx.l ls.x sx.l ls.x sx.l ls.x",
        "Words": "examen. example. exodus. exile. examen again. exercise. Exercises. exhort. exhortation. exalt. exemplify. exact. exactly. examine. examen nightly. exterior. exteriority. exterior acts. exterior silence. exterior service. exterior order. ex animo. ex opere operato. extra. extraordinary. extrinsic. exterior freedom. exit. exist. existence. exegesis. exegete. exorcise. exorcism. exhale. exult. exemplary. exchange. execute. explicit. express. expression. exposure.",
        "Control": "e ex exa exam examin examine examen. e ex exe exer exerci exercise Exercises. e ex exo exod exodu exodus. e ex exi exit exist existenc existence. e ex exu exul exult exalt. e ex exo exop ex oper ex opere operato. e ex exo exorc exorcism. e ex exe exec execut execute.",
        "Sentences": "Exact stops matter. Examen ends the day: examine, express gratitude, expose faults, ask for grace, and expect help—then end. Exercises extend freedom: explicit choices, expressed in prayer, executed in service. Exit excess. Exult in mercy. Example: exhale, then express thanks; examen again. Exactness, exterior order, and interior freedom grow together.",
        "Test": "examen. example. exercise. Exercises. exodus. exile. exit. exist. exegesis. execute. exhale. exult. explicit. express. exposure. End with exact stops. Examen nightly. Exit excess; express thanks. exact. explicit. exterior. Exercises end; examen begins again."
      }
    },
    {
      "title": "qp",
      "Img": ["img/littlefingers.jpg"],
      "guide": "<p>Use the left little finger to type Q and the right little finger to type P. After each strike, return both to A and ; via the home row. This unit uses quiet, prayerful vocabulary—Principle and Foundation, peaceful purpose—so that precision on Q and P grows alongside attention to Ignatian themes.</p>",
      "subunits": {
        "Grip": "qpq pqp qpq pqp qpq pqp; qpqp qpqp qpqp; sq sq sq; lp lp lp; fq jq fq jq; q,p, q,p, q,p, qspl lspq qspl lspq; qppp qqqp pqqq ppqq; qplj fqpj jqpf; qp qp qp; pq pq pq; qpqp pqpq qpqp pqpq; slsf fjjl; qpqp pqpq;",
        "Words": "quiet prayer; quiescent pause; quick penitence; query the purpose; quaerere Deum—seek God quietly; Paschal peace; penitential psalm; principle and foundation per Ignatius; press pause; practice patience; equipoise: peace, prudence, proportion; frequent pauses, proper posture; quell pride; qualify plans; prayerful quest; pilgrim path; practical prudence; pastoral presence; quarter-hour examen, quiet and personal; praise, petition, confession, thanksgiving; question patterns that pull you from peace; prefer the poor; promote justice; properly prepare; quietly propose peace; quasi-poetic psalms; priest and people proclaim: Pax; quotidian practice; quicker to forgive, slower to speak; proclaim hope; pilgrim companions; polyphony of prayer; quiddity of purpose; pious questions, practical replies; persevere; question—pause—pray—proceed; prefer the greater good; quiet power, patient progress; prayer, purpose, prudence, peace.",
        "Control": "q qu qui quie quiet; p pr pra pray prayer; p pe pen peni penite penitence; q qu que ques questi questio question; p pr prud pruden prudence; q qu qui quie quietnes quietness; p pr prep prepa prepar prepare. p pe peac peace; q qu quel quell; p pr prop propo propose; q qu quie quieten; p pr pastor pastoral; q qu quies quiescent",
        "Sentences": "Quiet prayer prepares purpose: pause, question, and place your plan in God’s presence. Per the Principle and Foundation, prefer God’s praise over quick applause; question proud impulses, pursue patient progress, and propose peace. Pilgrims proceed in pairs, praying quietly for people in pain; parish and priest practice the examen: ponder, perceive, proceed. Put pride aside; keep quiet poise; protect the poor; promote justice. Press on with peaceful purpose.",
        "Test": "quiet prayer; quick questions; proper preparation; Principle and Foundation; prefer praise of God; pursue patient progress; propose peace; pilgrim pairs; parish and priest; quarter-hour examen: ponder, perceive, proceed; protect the poor; promote justice; put pride aside; keep quiet poise; press on with peaceful purpose; qualify plans by principle; question proud impulses; proclaim hope; prefer the poor; pray, pause, plan, proceed; quiet power, patient pace."
      }
    },
    {
      "title": "z/",
      "Img": ["img/littlefingers.jpg"],
      "guide": "<p>Use the left little finger to type Z and the right little finger to type the slash (/). Return gently to the home row after each reach. These drills channel zeal toward praise/peace rather than frenzy, echoing the Exercises’ patient focus.</p>",
      "subunits": {
        "Grip": "z/z/ z/z/ z/z/; szsz l/l/ szsz l/l/ szsz l/l/; zz// zz// zz//; sz/l ls/z sz/l ls/z; z/ z/ z/, /z /z /z; sz sz sz; l/ l/ l/; z// z// z//; fz/j j/ z/ f/; z z z; / / /; szsz l/l/ szsz l/l/; zzzz //// zzzz ////; sz/l ls/z sz/l ls/z; zszs //l/ zszs //l/; szsz l/l/ szsz l/l/; z//z /z/z z//z /z/z; sz/l ls/z sz/l ls/z; z/ z/ z/ z/ z/; /z /z /z /z; szsz l/l/",
        "Words": "zeal; zealous; zeal for the house; Zion; Zion’s songs; Zacchaeus; Nazareth; Lazarus; Boaz; Zebedee; Ezra; hazel; horizon; glazier; dazzle; amaze; blaze; praise/serve/love; baptize; evangelize; catechize; baptismal vows; prize what is precious; zero noise, zero haste; baptize the culture through grace; cozy cloister; freeze fear; analyze/realize/evangelize; exercise; Spiritual Exercises; Examen; zesty zeal surrendered to love; zero-sum/zero-ego; creation’s praise; cross/zigzag path, yet forward; fuzzy mercy; razor-edged honesty; breezy prayer; jazzy psalms, cozy cells; amazing grace; blazing charity; size the task; seize the time; baptize the day; gaze, appraise, praise; zeroing in on the one thing necessary; zest to serve the least; zonal focus; zigzag then zero in; Zephaniah’s joy; praise/peace/zeal aligned; Zion hymnals; Nazareth lanes; Zion alleluias;",
        "Control": "z ze zeal zealo zealous; z zi zio zion Zion; z za zac Zacch Zacchaeus; z na naz nazar Nazareth; z la laz lazar Lazarus; z bo boaz Boaz; z ze zeph Zephaniah; / praise/peace; z ze zero zero/haste; / cross/zigzag; / baptize/evangelize; z ze zeitgeist; / zero-ego; / gaze/appraise/praise. z ze zest zealous/zeal; / Zion hymnals;",
        "Sentences": "Zeal is purified by praise, not by frenzy: zero the noise and choose peace. In Nazareth and Zion alike, the breeze carries psalms; Zacchaeus, dazzled, descends and gives back with zest. Freeze rash buzz; analyze, then evangelize; cross the zigzag path with patient focus. With the Spiritual Exercises, zeal becomes breezy, precise—praise/peace/zeal aligned; lips zip when love listens, and the soul blazes quietly.",
        "Test": "zeal, not frenzy; zero noise; choose peace; Nazareth and Zion; Zacchaeus descends with zest; freeze rash buzz; analyze, evangelize; cross the zigzag path with focus; Spiritual Exercises refine zeal; praise/peace/zeal aligned; zip the lips; listen with love; the soul blazes quietly; cozy cloister; jazzy psalms; breezy prayer; size the task; seize the time; baptize the day; gaze/appraise/praise; zero-ego; Zion hymnals."
      }
    },
    {
      "title": "'",
      "Img": ["img/littlefingers.jpg"],
      "guide": "<p>Use the right little finger to type the apostrophe ('). Strike lightly and return to ';' on the home row. In this unit we practice contractions and possessives—God's love, Jesus's mercy, Ignatius's notes—so your pinky gains control on frequent, faith-themed words.</p><p>Tip: Prefer simple, consistent styles (e.g., Jesus's, Ignatius's; saints' for plurals). Keep eyes on the screen; accuracy before speed.</p>",
      "subunits": {
        "Grip": "'al 'am 'as 'at 'we 're 'yo 'ur 'he 'is 'she 'is 'it 'is 'we' 're go' d's God' s'lov e's 'joy 'ho'pe 'pe'ac e' 'in 'us 'all 'day 'and 'night; dad' s', mom' s', friar' s', Jesuit' s', Ignatius' s'—we' re' lear' ning' a' pos' tro' phes' gent' ly' and' stea' di' ly; we'll we'll; we'll we'll; he'd he'd; she'd she'd; it's it's; don't don't; can't can't; won't won't; God's God's; Jesus's Jesus's; saint's saint's; saints' saints'.",
        "Words": "we're we're, you're you're, he's he's, she's she's, it's it's, that's that's; i'm i'm, we're not, you're not, i'm not; don't don't, didn't didn't, can't can't, won't won't, shouldn't shouldn't; God's mercy, Christ's peace, Spirit's gifts; Ignatius's counsel, Jesuits' mission; pilgrim's path, disciple's joy; neighbor's need; parish's prayers; saints' letters; Jesus's friends; Mary's fiat; Peter's tears; today's examen; retreatant's notes; heart's desire; soul's freedom; love's labor; life's lesson.",
        "Control": "i i' i'v i've; you you' you'r you're; we we' we'r we're; he he' he'll; she she' she'll; it it' it's; that that' that's; God God' God's; Jesus Jesus' Jesus's; saint saint' saint's; Jesuits Jesuits' mission; do do' don't; can can' can't; will will' won't.",
        "Sentences": "it's grace we can't buy; we don't own it—God's love finds us where we're weakest. i'm ready, yet i'm not; that's why i'm praying, asking quietly for light. Ignatius's story says a pilgrim's heart won't rest until God's will is clear. we're the Lord's people, and Jesus's mercy reshapes a disciple's day and night. when pride's noise rises, it's wise to pause: today's examen steadies the heart's pace; let the soul's desire be God's alone.",
        "Test": "we're you're she's he's it's; i'm not; don't, can't, won't; God's mercy; Jesus's name; Ignatius's call; Jesuits' mission; saint's witness; saints' prayers; neighbor's need; heart's desire; today's examen; pride's noise; soul's freedom; put pride aside; it's the Lord's; we're God's people; love's labor lasts; mission's hope grows; that's enough; pilgrim's path proceeds; Mary's fiat stays; Peter's tears teach."
      }
    },
    {
      "title": "Shift",
      "Img": ["img/littlefingers.jpg"],
      "guide": "<p>Press Shift with the hand opposite the letter: Right Shift for left-hand letters, Left Shift for right-hand letters. Use a gentle tap, then return to home row. We will capitalize Ignatian and Catholic names (Ignatius, Xavier, Society of Jesus) while you train precise timing on the Shift key.</p><p>Tip: Keep wrists level and shoulders relaxed; aim for clean capitals without grip or hesitation.</p>",
      "subunits": {
        "Grip": "aA bB cC dD aA bB cC dD; eE fF gG hH eE fF gG hH; iI jJ kK lL iI jJ kK lL; mM nN oO pP mM nM oO pP; qQ wW eE rR tT yY uU iI; ASDFG HJKL; ZXCVB NM; QWER TYUI; OP; Aa Bb Cc Dd Ee Ff Gg Hh; Ii Jj Kk Ll; Mm Nn Oo Pp; Qq Ww Ee Rr; Tt Yy Uu Ii; Use opposite-hand Shift: aA sS dD fF jJ kK lL; Practice rows: Qq Ww Ee Rr Tt Yy Uu Ii Oo Pp; Zz Xx Cc Vv Bb Nn Mm. Keep rhythm: tap, lift, return; aA aA sS sS dD dD fF fF jJ jJ kK kK lL lL.",
        "Words": "January February March April May June July August September October November December; Sunday Monday Tuesday Wednesday Thursday Friday Saturday; Rome, Manresa, Pamplona, Azpeitia, Montmartre, Paris; St Ignatius of Loyola; St Francis Xavier; Society of Jesus; Spiritual Exercises; Daily Examen; A.M.D.G.; Liturgy of the Hours; Gospel of Luke; Catechism; Jesuit Constitutions; Jesuits Global; General Congregation; Superior General; Gregorian University; Pope Francis; St Peter; St Paul.",
        "Control": "I In Ign Ignat Ignatius; L Lo Loy Loyo Loyola; F Fr Fra Fran Franc Francis; X Xa Xav Xavi Xavier; S So Soc Soci Socie Society; J Je Jes Jesu Jesuit Jesuits; Sp Spir Spirit Spiritual Exercises; D Da Dai Dail Daily Examen; A A.M.D.G.; R Ro Rom Rome; M Ma Man Manre Manresa.",
        "Sentences": "Press Shift with the opposite hand: Right Shift for left-hand letters, Left Shift for right-hand letters. St Ignatius of Loyola rose after Pamplona; in Manresa he prayed and shaped the Spiritual Exercises. Francis Xavier, vowed at Montmartre, left Paris for India. Use capitals with care: Society of Jesus, Daily Examen, Liturgy of the Hours, Gospel of Luke. Keep wrists level, strike lightly, return to home row; accuracy first, then speed. A.M.D.G. marks intention—order work to God’s glory; train till capitals land clean.",
        "Test": "USA UK UAE; Rome Paris Manresa Montmartre; St Ignatius of Loyola; St Francis Xavier; Society of Jesus; Spiritual Exercises; Daily Examen; Liturgy of the Hours; Gospel of Luke; A.M.D.G.; use opposite-hand Shift; return to home row; accuracy before speed; capitals clean and clear; practice till flow returns; Pamplona to Manresa to Rome—rise, pray, serve."
      }
    },
    {
      "title": "Practice Passages",
      "guide": "<p>Type these practice passages slowly and accurately. Each passage paraphrases trusted Ignatian and Catholic sources so that your learning joins skill with substance. Where a text is traditionally prayed (e.g., Anima Christi, Suscipe), we render it in paraphrase for typing. Breathe, keep posture aligned, and let accuracy lead speed.</p>",
      "subunits": {
        "Principle and Foundation": "We are created to praise, reverence, and serve God, and by this path to order our lives in freedom. All created things are gifts offered so that we might seek the Giver; we use them insofar as they help, set them aside when they hinder, and hold indifference toward health or sickness, riches or poverty, honor or dishonor. In this foundation we discover purpose: choose what leads to deeper love, and let lesser loves be rightly placed. Breathe, type, and keep your eyes on the line. Keep posture tall; return fingers to home row.",
        "Anima Christi": "Soul of Christ, sanctify my desires; Body of Christ, strengthen my service; Blood of Christ, enliven my courage; Water from Christ’s side, wash my memory. Within your wounds hide me; let no evil spirit divide me. Call me to your presence and bid me remain until praise becomes my habit and mercy my reflex. Keep posture tall; return fingers to home row.",
        "Suscipe": "Take, Lord, receive my liberty, memory, understanding, and will—every plan and preference I clutch. All is from you and for you; I return it, asking only for love and grace. If you grant these, I have enough; if you lead otherwise, I still belong to you, and that belonging is peace. Let accuracy lead; speed will follow in due time.",
        "Examen Prayer": "Ask for light; give thanks; review the day; face faults with truth; look ahead with hope. This quiet examen welcomes God’s presence into ordinary hours: a conversation about desires, choices, consolations, and desolations. Name patterns honestly and choose tomorrow’s next faithful step. Breathe, type, and keep your eyes on the line.",
        "John 3:16": "God so loved the world that love moved first: not to condemn but to give life. The Beloved is offered, and whoever trusts receives a share in that life—here and forever. The cross discloses the measure of mercy; faith opens the heart to light, so fear gives way to freedom. Breathe, type, and keep your eyes on the line. Keep posture tall; return fingers to home row.",
        "Romans 12:12": "Be joyful in hope, patient in affliction, faithful in prayer: a compact rule for disciples under pressure. Rejoice not in easy outcomes but in God’s nearness; endure trials without bitterness; keep a steady rhythm of intercession for others. Stay calm; make every keystroke intentional.",
        "Hebrews 11:1": "Faith is confidence in what we hope for and conviction about what we do not see. It steadies the soul to act in love before evidence appears, trusting the unseen fidelity of God who cannot lie. Breathe, type, and keep your eyes on the line.",
        "1 Corinthians 13": "Without love, eloquence and knowledge ring hollow. Love is patient and kind; it does not envy or boast; it bears and believes and hopes and endures. Prophecies pass; love remains. In the mirror of Christ we mature, laying down pride and choosing the better way. Keep posture tall; return fingers to home row. Stay calm; make every keystroke intentional.",
        "Psalm 23": "The Lord is my shepherd; I shall not want. He makes me lie down in green pastures and leads me beside still waters. Even in the valley I fear no evil, for you are with me; your rod and staff comfort and guide me toward a table of mercy. Breathe, type, and keep your eyes on the line.",
        "Catechism 1": "God, infinitely perfect and blessed in himself, freely created man to share his own blessed life. He gathers us into one family in the Church and, through revelation and grace, invites every heart to seek, know, and love him. Keep posture tall; return fingers to home row.",
        "Catechism 27": "The desire for God is written in the human heart because we are created by God and for God. We restlessly search until we rest in him; he never ceases to draw us, and our dignity blooms in this living relationship. Stay calm; make every keystroke intentional.",
        "Catechism 293": "Creation springs from the Father’s glory and tends toward that same glory. Not from necessity or chance but from love, God calls beings into existence so that, sharing goodness, they may reflect and praise the Giver. Breathe, type, and keep your eyes on the line.",
        "Ignatius Autobiography": "Wounded at Pamplona, Ignatius began a pilgrimage from vanity to magnanimity. In Loyola and Manresa he learned to read interior motions, to sift spirits, and to desire the greater good, until his heart was set on helping souls for the glory of God. Let accuracy lead; speed will follow in due time.",
        "Letters of Ignatius": "Ignatius writes as a patient coach: encourage the desolate, moderate the consoled, prefer the common good to private impulse. He counsels obedience with intelligence, friendship rooted in Christ, and decisions made in freedom for mission. Breathe, type, and keep your eyes on the line.",
        "Constitutions of Jesuits": "The Constitutions order a body for mission: candidates tried in prayer and service; studies for competence; obedience to send and sustain; community life to support zeal; governance to distribute labor for the greater glory of God. Keep posture tall; return fingers to home row.",
        "Life of Francis Xavier": "Friend of Ignatius and tireless missionary, Francis Xavier crossed seas toward India and Japan, preaching Christ with bold simplicity, learning languages, and forming communities that endured beyond his own brief years. Breathe, type, and keep your eyes on the line.",
        "General Congregations": "General Congregations gather representatives to elect a Superior General, confirm mission, and discern directions for the Society. Rooted in prayer, they read the times and renew availability for the Church’s needs. Practice steadily; pause, review, proceed with peace.",
        "Ratio Studiorum": "The Ratio Studiorum standardized Jesuit education in 1599, organizing studies in grammar, humanities, philosophy, and theology with careful pedagogy. It sought excellence joined to virtue, uniting intellectual rigor with formation for service. Breathe, type, and keep your eyes on the line.",
        "Jesuit Vows": "Jesuits profess poverty, chastity, and obedience for the sake of intimate union with Christ and universal mission; many priests also make a special vow of obedience regarding missions entrusted by the Pope, a pledge of availability for the Church. Practice steadily; pause, review, proceed with peace.",
        "Rules for Discernment": "Notice consolation that enlarges faith, hope, and love; notice desolation that narrows the heart. In consolation, plan humbly; in desolation, hold steady, resist false urgencies, and recall God’s past fidelity while asking for help. Keep posture tall; return fingers to home row."
      }
    },
    {
      "title": "58",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Number focus: 5 and 8. Keep fingers light; return to F and J after every reach. Use these drills to build even rhythm before we expand to full number rows. Historical notes (e.g., five books of Moses; eight Beatitudes) appear as anchors, but the digit strings are for practice, not data.</p>",
      "subunits": {
        "Grip": "f5f5 j8j8 f5f5 j8j8 f5f5 j8j8; 5f5f 8j8j 5f5f 8j8j 5f5f 8j8j; f5 j8 f5 j8; jf58 fj85 jf58 fj85; a5 s8 d5 k8; la5; sk8; fa5; jk8; f5f5 j8j8 5f5f 8j8j; f5j8 f5j8 5f8j 8j5f; r5 e5 t5 y8 u8 i8 o8 p8; f5-5f ; j8.8j ; f5_5 f; j8+8 j; f5 f5 f5; j8 j8 j8; 55 88 58 85 58 85; return fingers to F and J after every reach. f5f5 j8j8 5f5f 8j8j jf58 fj85",
        "Words": "5 books of Moses (Pentateuch), 8 Beatitudes (Mt 5), 58 practice patterns; 5 loaves and 2 fish feed many—today we type only the 5s and 8s; practice: 5–8, 58–85, 558, 858, 585; aim for even pacing, gentle eyes, quiet breath; these numbers are drills, not data claims—learn slowly and well.",
        "Control": "5 55 555 58 585 5858 58585 8 88 888 85 858 8585 58 58 585 5858 8 88 885 8858 5885 58 85 58 85 558 885 5588 8855 55885 88558 5 58 585 5858 8 88 885 588 8855 5885",
        "Sentences": "Eight Beatitudes inspire mercy; five books of Moses ground the story—today we train 5 and 8 for steady digits. Trace 58, 85, 558, 585, 858, 5885 with relaxed hands; breathe on every fifth cycle. No doctrine depends on these counts; the goal is fluency for prayerful work.",
        "Test": "5 58 585 858 885 5588 5885; 55 88 58 85 5858 8585; type 58 cleanly, eyes up; repeat 58 x 5, then 85 x 5; remember: 8 Beatitudes (Mt 5), 5 books (Torah)—facts for faith, digits for drills. 58 85 585 858 5588 8855"
      }
    }
  ]
}
