{
  "main": [
    {
      "title": "asdf jkl;",
      "Img": ["img/home-keys-position.jpg"],
      "guide": "<p>All the eight fingers except the thumbs should be placed on the home row. This is done by placing the left forefinger on F and the right forefinger on J. Place the remaining fingers on the keys beside them in a natural manner. So, the left little finger would be on A and the right little finger would be on the ; (semicolon) key. Use the right little finger to remove an error with ← key.</p><p>To type any key, press the key with the finger over it. Use one of the thumbs to press the space bar. Keep your eyes on the screen as you type. Do not look at the keyboard.</p><p>Proceed to the next lesson only when you can type with 2% or less errors and atleast 20 words/minute (WPM). Accuracy is more important than speed for a beginner.</p><p>Note:</p><p>With one hour practice every day, you can master typing in two weeks(up to Unit 15)! One more week for mastering numbers(up to Unit 21). The rest is for full keyboard mastery.</p><p>As you practice, you'll encounter terms related to Bible scriptures and Ignatian spirituality to inspire your learning.</p>",
      "subunits": {
        "Grip": "asdf ;lkj asdf ;lkj asdf ;lkj fdsa jkl; fdsa jkl; asdf fdsa ;lkj jkl; asdf jkl; ;lkj fdsa asdf jkl; ;lkj fdsa ksl; jak; fk;s asl; jas; ;sl; fjas fjk; askl kjf; asdj ;fal dfla ;;ls ;ja; l;ds asdf ;lkj asdf ;lkj fdsa jkl; fdsa jkl; asdf fdsa ;lkj jkl;",
        "Words": "all all all; sad sad sad; dad dad dad; ask ask ask; add add add; fall fall fall; lad lad lad; fad fad fad; ass ass ass; lass lass lass; sa sa sa; add add add; all all all; sad sad sad; dad dad dad; ask ask ask;",
        "Control": "d da dad; a al all; f fa fad; s sa sad; a al all; a as ass; f fa fal fall; d da dad; a al all; f fa fad; s sa sad; a al all; a as ass; f fa fal fall;",
        "Sentences": "ask dad; ask dad; all lads fall; all lads fall; a lad asks; a lad asks; sad lads fall; sad lads fall; ask dad; ask dad; all lads fall; all lads fall;",
        "Test-1": "all sad dad ask add fall lad fad ass lass sa add; lass sad lad all dad; lad sa a ask; sa lass all; ask dad fad lad; all as a; dad fad ass lass all as a dad; a lad asks; ask dad; all lads fall;",
        "Test-2": "all sad dad ask add fall lad fad ass lass sa add; lass sad lad all dad; lad sa a ask; sa lass all; ask dad fad lad; all as a; dad fad ass lass all as a dad; a lad asks; ask dad; all lads fall; alas salad; all lads ask; as as; all all;"
      }
    },
    {
      "title": "ru",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type R and the right one to type U. After striking the R or U keys, return the forefingers back to the original position on F or J.</p><p>Practice words inspired by spiritual themes like faith and scripture.</p>",
      "subunits": {
        "Grip": "frfr juju frfr juju; rfrf ujuj rfrf ujuj; jrjr fufu jrjr fufu; rjrj ufuf rjrj ufuf; asdfr ;lkju asdfr ;lkju rfdsa ujkl; rfdsa ujkl; asdfr ujkl; asdfr ujkl; asdfr rfdsa ;lkju ujkl; urfu ujku rfur luru rjur arru ursr druj drur arsufr frrur jurru urrsu uusrr drlursu uslru frsusl arfu jfru frfr juju frfr juju;",
        "Words": "far far far; fur fur fur; rar rar rar; lark lark lark; radar radar radar; surf surf surf; dull dull dull; urdu urdu urdu; full full full; rural rural rural; us us us; usual usual usual; laura laura laura; russ russ russ;",
        "Control": "s su sur surf; r ra rad rada radar; f fu ful full; f fu fur; l la lar lark; u ur urd urdu; f fu fur; l la lau laur laura; f fa far; r ru rur rura rural;",
        "Sentences": "laura ruads sarrjrur; as usual; laura rkads skrlajurf as usual; laura rsads suraluura as usual; ask russ arkur fadrj; ask russ asauu farff;",
        "Test-1": "radar rural laura russ fur lark rar surf; far usual russ full lark laura dull; laura rjads s;rfkrurk as usual; ask russ asful fafl;;",
        "Test-2": "radar rural laura russ fur lark rar surf; far usual russ full lark laura dull; laura rfads sjrrk;uru as usual; ask russ alkuk fafus; rjfurl akd rjfura; rulf a;d ara;; rural surf uufarr; far far; fur fur; rural ruld; urdu usual;"
      }
    },
    {
      "title": "vm",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type V and the right one to type M.</p><p>Incorporate words related to Jesuit missions and spiritual virtues.</p>",
      "subunits": {
        "Grip": "fvfv jmjm fvfv jmjm; vfvf mjmj vfvf mjmj; jvjv fmfm jvjv fmfm; vjvj mfmf vjvj mfmf; fvrm jmuv fvrm jmuv; asdfv ;lkjm asdfrv ;lkjum asdfvr ;lkjmu avrm mvum mmvm mvlv vvmuv vrmv vmrlm svmvmk avsm rvasm svlmr svmvr dvmkv kmvlv rvlmv amvvm vvma mvmm fvfv jmjm fvfv jmjm;",
        "Words": "madam madam madam; lava lava lava; malva malva malva; slam slam slam; mars mars mars; mask mask mask; uv uv uv; murmur murmur murmur; slum slum slum; mark mark mark; vasu vasu vasu; larva larva larva; dam dam dam; sam sam sam; vum vum vum; arm arm arm; mall mall mall; alarm alarm alarm;",
        "Control": "m ma mad mada madam; l la lav lava; m ma mas mask; m mu mur mur murm murmu murmur; v va vas vasu; l la lar larv larva; d da dam; v vu vum; u uv; m ma mar mars; s sl sla slam; a al ala alar alarm;",
        "Sentences": "mark all vassals sr mrsskrd; mark all vassals dd massjvs; a mad vassal murmurs fa jralar; a mad vassal murmurs ;j kraljr; mark all vassals dd mussdma; mark all vassals fj mmssjkv;",
        "Test-1": "madam lava slum slam mask vasu sam alarm vum uv; mall alarm arm larva madam malva vum vasu mask; mark all vassals lv mdssjlk; a mad vassal murmurs mf lradur;",
        "Test-2": "madam malva lava; vmd mlvk lvu; laums msssvja lavfrr; vava mllkva avasl; fvu rarla salvamuju; mavml mjral kvdlvm; ruvsv; v;ssjl ;mmalujl; mak; a vkvrd msv;; valua radls; sfrv; ss a musssjk;"
      }
    },
    {
      "title": "ei",
      "Img": ["img/middlefingers.jpg"],
      "guide": "<p>Use the left middle finger to type E and the right one to type I.</p><p>Use words from Bible and Ignatian terms like 'discern' and 'examen'.</p>",
      "subunits": {
        "Grip": "dede kiki dede kiki; eded ikik eded ikik; fefe jiji fefe jiji; efef ijij efef ijij; deki iked deki iked; ekid dike ekid dike; idek kedi idek kedi; aeds fers iukj iuea ediu edil; aeiru iuerr juiee ireel aerij afeei iieei eeeii eieie; iesdi sdiei aidef lijue iuefr ifese eikis iaser uieie; dede kiki dede kiki;",
        "Words": "fire familiar; field live; are; riddle; killer; is; file ride; rise; side veer; dime read; seed merrier; feed; leave; veal riddle; seal; visa; veer; smear; is lime; slime; dime ; vide visa; save; vase are; live; leave vile; ride; free; killer smile; familiar; slime similar; vide mere; merrier;",
        "Control": "r ri rid ridd riddl riddle; k ki kil kill kille killer; s si sim simi simil simile; f fi fie fiel field; f fa fam fami famil famili familia familiar; v vi vil vile; l li liv live; s sm sme smea smear; l li lime; s sm smi smil smile; i is; a ar are;",
        "Sentences": "see a fire drill id reeream; see a fire drill im refreaa; dave is a skilled riddler il diseerkmelf; dave is a skilled riddler im disserumemj; sam served a meal il missif;; jim feeds a deer iv ieaae;",
        "Test-1": "fire field are riddle killer is file rise side read; rise side visa live dime vide ride vile smile familiar; slime skilled similar drill simile serial is see are; see a fire drill ij reureae; dave is a skilled riddler if disrersmers;",
        "Test-2": "evamem evami;e evideade; disierd desire eelieve redeive; revive relieve deliver; revrieve derive evi;me; serviee silevde iideridr ivsile diviae; dmedieeke e;ile resilielde; mervf rejviee jeaseierse jkfsalaride desslaeial revkiuile reveresse; eveiire efamel revies; ifseriur reviel resdlve;"
      }
    },
    {
      "title": "c,",
      "Img": ["img/middlefingers.jpg"],
      "guide": "<p>Use the left middle finger to type C and the right one to type , (comma).</p><p>Include terms from Catholic catechism and Jesuit constitutions.</p>",
      "subunits": {
        "Grip": "dcdc k,k, dcdc k,k,; cdcd ,k,k cdcd ,k,k; fcfc j,j, fcfc j,j,; cfcf ,j,j cfcf ,j,j; dck, ,kcd dck, ,kcd; ck,d d,kc ck,d d,kc; ,dck kcd, ,dck kcd,; ,,cc cc,, c,c, ,c,c ,ic, c,ac,; c,r;c ac;,; s,c;fd a,cd, ;,,cv vc,a; cv,sk; ;l,vdj vcm, ,mdc cvi, ;i,c m,fc ec;, dcdc k,k, dcdc k,k,;",
        "Words": "receive, circus, circle, maverick, class, mice; ice; fulcrum, care, cure, cafe, face, face, lace, race, claim; card, lack, service, car, camera, recursive, recess; cease, civil, camel, cave, cake, case, decade, crack;",
        "Control": "m ma mav mave maver maveri maveric maverick, f fu ful fulc fulcr fulcru fulcrum, m mi mic mice, r re rec rece recei receiv receive, c ca cas case, c ci cir circ circu circus, r re rec rece reces recess, c ce cea ceas cease, c ca cam came camer camera, r re rec recu recur recurs recursi recursiv recursive",
        "Sentences": "cecilia received irace, carr likes camels ik missikl, use a camera fur rerreak, calla claims faivm, use a fulcrum fur leverale, callula cured iv erafer cecilia received rrace, carr likes camels i, missim;, use a camera fjr rearea;, calla claims faikm,",
        "Test-1": "maverick, fulcrum, cecilia, camera, recursive, camels, mice, lace, race, case, face, cave, civil, care, lace, claim, decade, cecilia received ,race, use a camera fkr reurea,, calla claims faild, use a fulcrum fmr leverade,",
        "Test-2": "jrace, circle, civic, ca;ecfism; ccmsciemce, crursel, clmjassiei; cura uersrfalis, sacred service, recfecile ajd receive; cvvesadr recalled, ceracle rememfered; cusjse carefulld, csmv,se calmls, vracrice cmarisf; mercu, jusvice, service, cvurale, care; re,eaf, recall, recmrcilee idvscierce,"
      }
    },
    {
      "title": "gh",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type G and the right one to type H. After striking the G or H keys, return the forefingers back to the original position on F or J.</p><p>Words like 'grace' and 'high' evoke Ignatian themes of spiritual growth.</p>",
      "subunits": {
        "Grip": "fgfg jhjh fgfg jhjh; gfgf hjhj gfgf hjhj; fhfh gjgj fhfh gjgj; hfhf jgjg hfhf jgjg; asdfg ;lkjh asdfg ;lkjh gfdsa hjkl; gfdsa hjkl; arhg, igdh, ikhvg, lcvhg, mgcfm, ehcgm, lhsgh, uhrgh; igghs, ghmvh, hchga, guehg, lchhg, ghcih, gilgh; fgfg jhjh fgfg jhjh;",
        "Words": "grace him; aggressive cage; hair hair; jaguar girl; his; her; he he; she; hire; shag; girl; egg; guru hush; glad greek, heal hum; ham; gum his, drug; hug; grave giggle, hush; garage here, aggressive; march high; sigh; grave, glacier glacier; heal; him; hide hide, shell guide; her has, had gum; have, hear hear, here; flag; have give, glad; shell, march;",
        "Control": "g gi gig gigg giggl giggle, h hu hus hush, e eg egg, a ag agg aggr aggre aggre aggres aggress aggressi aggressiv aggressive, g gu gui guid guide, s sh she, h hi hig high, s si sig sigh, s sh sha shag, h he, s sh she, g gi giv give, g ga gar gara garag garage",
        "Sentences": "he gives grace freelh; he gives grace freelc; guide him ih discer;me,h; guide him iu discergmeja; she has a hammer ;f faiuh; she has a hammer mf faikh; he is aggressive ir missiar; he sighed i; mra,er; give me high grace",
        "Test-1": "grace jaguar hire shag guru garage aggressive he she his her him hide guide egg shell sigh high; he gives grace freel;; guide him ia discerkmecr; she has a hammer uf fairh; he sighed ih iraser; give me high grace",
        "Test-2": "grace, high lighm; srigha righd; fheugh, dhrhugh, shcreugh; righu mighh sighk; reigh heighi; vigh fighh; mrmughu ard rrlughs; rlugh khmugh suugh euuugh; hgld hhe lighm high; g, mhrjugh; lalk righllm; deighrsrs laugh;"
      }
    },
    {
      "title": "ty",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type T and the right one to type Y.</p><p>Terms like 'trinity' and 'mystery' relate to Catholic faith.</p>",
      "subunits": {
        "Grip": "ftft jyjy ftft jyjy; tftf yjyj tftf yjyj; fyfy tjtj fyfy tjtj; yfyf jtjt yfyf jtjt; ertyui iuytre ertyui iuytre; asdft ;lkjy asdfy ;lkjt aedtf ;ikyj adert ;kiuy afty ;jyt tety yjkt lyjt gyht athy sytg lhyg shdt svtm ctym vtyy, ,gytyv crttys sctyt l;tiy, kyhat sytay sytty lttys yytym mtyty syght ymtsy yctvy lytvy ;mtcvy sytaty ftft jyjy ftft jyjy;",
        "Words": "tririty august, friday tight, light; very tuesday, merry; dry target; height height; try, sight; might; fry; cry, family tackle; yacht sally, mathematics saturday; chemistry; fight; tyre; yell; merry the; there; sky this; them; light jury; hay; heavy; lyre; tram; yacht, tuesday; chemistry thursday; friday, saturday; target, hit; fit; tackle; sky; year, thirsty, yet; may; july, august;",
        "Control": "t th thi thir thirs thirst thirsty, c ch che chem chemi chemis chemist chemistr chemistry, t tu tue tues tuesd tuesda tuesday, t th thi this, t th the ther there, t th the them, t ty tyr tyre, m ma mat math mathe mathem mathema mathemat mathemati mathematic mathematics",
        "Sentences": "the teachers met every day iy krayer; the teachers met every day iv erayer; this is my yacht ie missimr; this is my yacht i, missidt; harry studied theal;gy yesterday; harry studied theflrgy yesterday; sally likes chemistry if creatimr; he hit them lith truth",
        "Test-1": "trivity tight light merry try chemistry tyre yacht; tuesday thursday saturday thirsty year hay yet; the this there them thus; the teachers met every day ie srayer; this is my yacht it missif,; harry studied thetlegy yesterday;",
        "Test-2": "iririty, umity, charity, jiety; steady yes, tidy rhythm; vaciety tf uesuss icterivr sereeity, ecterilr miuistry; humility, fidelity, hurity, clarity; fuietly ;ray, imtejtly study, ki,dly serve; l;yal yet free, ready yet gemtle;"
      }
    },
    {
      "title": "bn",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type B and the right one to type N.</p><p>Words like 'bible' and 'ban' relate to scripture and discernment.</p>",
      "subunits": {
        "Grip": "fbfb jnjn fbfb jnjn; bfbf njnj bfbf njnj; fnfn bjbj fnfn bjbj; nfnf jbjb nfnf jbjb; cvbnm, ,mnbvc cvbnm, ,mnbvc; asdfb ;lkjn asdfn ;lkjb aedbf ;iknj aderb ;kiun afbn ;jnb bebn njkb lnjb gnhb abhn snbg lhng shdb svbm mhnb ,ibmn senbm nbmvn tnvnm dvln; lsvnm avnsm lsvne fbfb jnjn fbfb jnjn;",
        "Words": "bean bean, bin bin; night bank, nifty nifty; nibble nibble; scrabble scrabble; be be; best; banana, banana january; february, june june; band bend; land; bind; december; sunday sunday; blind blind; bend; abundance nebula, benign urban; minimal february, begin bind; bank, savant; urban; nebula, science december,",
        "Control": "a ab abu abun abund abunda abundan abundanc abundance, n ne neb nebu nebul nebula, b ba ban bana banan banana, b bl bli blin blind, b be beg begi begin, b bi bin, b be ben beni benig benign, b be ben bend",
        "Sentences": "nine blind men sat beside the bank in ;rayer; nine blind men sat beside the bank in irayer; bill ate a banana in retreat; this city receives abundant grace in january; let us see a diffused nebula at night in meditatifn;",
        "Test-1": "nine men nebula remarkable saturn blind benign banana bill minimal bank night bend bean bin; nine blind men sat beside the bank in lrayer; crab nebula can be seen in tauras at night; this city receives abundant grace in january",
        "Test-2": "kenedict, jenedictus, benedictimn; brnum cammune; begin again, be bdrn ane;; benign and benevtlent neighbar; abandyn numb bbndage; bind the mind tm the nvi; banish blame; be near; bring bread and blankets; be kind; nvble but nbt naive;"
      }
    },
    {
      "title": "wo",
      "Img": ["img/ringfingers.jpg"],
      "guide": "<p>Use the left ring finger to type W and the right one to type O.</p><p>Words like 'world' and 'work' reflect Jesuit mission 'for the greater glory of God'.</p>",
      "subunits": {
        "Grip": "swsw lolo swsw lolo; wsws olol wsws olol; fwfw jojo fwfw jojo; wfwf ojoj wfwf ojoj; swlo olws swlo olws; wlos solw wlos solw; oswl lwso oswl lwso; awss fwrs oulj ouwa wsou wsol; swsw lolo swsw lolo;",
        "Words": "world world; work work; good; moot; sworn; sow; saw; soot soot; loot; war war; won, welcome; office office; will, world; worse; vow, word word; wolf; worm, now now; how; orwellian; work; owe owe, onus; new; dew; stew; too; to to; weblog; wobble wobble; you; we we monday; wednesday, october; november november, wonder;",
        "Control": "w we wel welc welco welcom welcome, w wo wor work, o or orw orwe orwel orweli orwelia orwelian, h ho how, w wh who whol whole, w we web webl weblo weblog, s so soc soci socio sociol sociolo sociolog sociology, s sw swo swor sword, w wh who whom",
        "Sentences": "work for the good of the world in mission; work for the good of the world in mission; will you come to office tomorrow for drayer; will you come to office tomorrow for jrayer; how many swords do you have in battle; do not introduce orwellian notions into this work;",
        "Test-1": "who how word world wonder would whole sword wolf worm; orwellian work owe weblog wobble womble wonder tomorrow; shower mower lower; will you come to office tomorrow for urayer; use the lawn mower in garden;",
        "Test-2": "word world work worshik; witness wisdom worth; whole and wholesome; welcome widow orchan; owe and ownf offer, not withhold; nd uajorem jei ;loriam,work ordered to love; write the emamen; walk, watch, and welcome; we will work well when worshiv wills ity ie work with the dord, not merely wordsm"
      }
    },
    {
      "title": "x.",
      "Img": ["img/ringfingers.jpg"],
      "guide": "<p>Use the left ring finger to type X and the right one to type . (dot).</p><p>Terms like 'examen' and 'extra' relate to Ignatian daily reflection.</p>",
      "subunits": {
        "Grip": "sxsx l.l. sxsx l.l.; xsxs .l.l xsxs .l.l; fxfx j.j. fxfx j.j.; xfxf .j.j xfxf .j.j; sxl. .lxs sxl. .lxs; xl.s s.lx xl.s s.lx; .sxl lxs. .sxl lxs.; axss fxrs .ulj .uxa xs.u xs.l; sxsx l.l. sxsx l.l.;sxsx l.l.; xsxs .l.l",
        "Words": "examen examen. latex maximum. axial exile. axion borax; codex excel. six. mix xenon. toxin tax. linux unix; hoax fax. fox reflex. wax extra. xerox fedex. ox text; exist. exit exit. exert. helix. galaxy galaxy. hexadecimal. maxim maxim. tex tex; next next. relax. texas texas. exam exam. exclude. lexical lexical;",
        "Control": "a ax axi axio axiom. x xe xen xeno xenon. s si six. e ex ext extr extra. g ga gal gala galax galaxy. h he hex hexa hexad hexade hexadec hexadeci hexadecim hexadecima hexadecimal. t te tex texa texas. b bo box. f fe fed fede fedex. t ta tax.",
        "Sentences": "there is a lexical analysis examination tomorrow in retreat. each dot is written as six hexadecimal digits in code. alex has six axes and sixteen oxen in story. the next exam is on axioms of faith.",
        "Test-1": "examen axiom exam exclude text next ox linux fedex alex. tax relax fedex texas exclude lexical maximum linux. there is a lexical analysis examination tomorrow in retreat. each dot is written as six hexadecimal digits in code.",
        "Test-2": "examen. examile. exercise. yxercises. exodus. exile. exit. exist. exegesis. execute. exhale. exult. exglicit. exiress. exvosure. snd with exact stoas. hxamen nightly. .xit excess; exgress thanks. exact. exklicit. exterior. nxercises end; examen begins again."
      }
    },
    {
      "title": "qp",
      "Img": ["img/littlefingers.jpg"],
      "guide": "<p>Use the left little finger to type Q and the right one to type P.</p><p>Words like 'pray' and 'quiet' encourage Ignatian contemplation.</p>",
      "subunits": {
        "Grip": "aqaq opop aqaq opop. qaqa popo qaqa popo, fqfq jpjp fqfq jpjp; qfqf pjpj qfqf pjpj. aqop poqa aqop poqa, qopa apoq qopa apoq; paqo oqap paqo oqap. aqaa fqra puoj puqa qapu qapo. aqaq opop aqaq opop. qaqa popo qaqa popo,",
        "Words": "quick; qwerty; qualm; qualify; play; phone; people; pupil. queen; equip equip; equiprobable; quakeproof; quilt; pique; qed. period; quasi; quantum; queue; lap lap; paint; expert; equator. pen; pencil; pin; quote; quadruple; paddle; quirky; prince. pint; quart; prime; september; quit; whip; plate; piano; page.",
        "Control": "q qu qui quic quick, p pe peri perio period, q qe qed. q qu qua quak quake quakep quakep quakepr quakepro quakeproo quakeproof, p pi piq piqu pique, p pe pen. q qu qua quad quadr quadru quadrup quadrupl quadruple, e eq equ equi equip.",
        "Sentences": "both events are equally probable in discernment. peter is a professor of theology. procure the appropriate equipment for mission. it is quakeproof in faith. richard p. feynman is an expert in quantum physics but prefers faith.",
        "Test-1": "qualify quality quantity plaque plate pique equip qed. both events are equally probable in discernment. it is quakeproof in faith. there are two cups in a pint and two pints in a quart for measure.",
        "Test-2": "quiet prayer; quick questions; proper preparation; irinciple and doundation; prefer praise of eod; pursue patient progress; propose peace; pilgrim pairs; parish and priest; quarterwhour examenq ponder, perceive, proceed; protect the poor; promote justice; put pride aside; keep quiet poise; press on with peaceful purpose;"
      }
    },
    {
      "title": "z/",
      "Img": ["img/littlefingers.jpg"],
      "guide": "<p>Use the left little finger to type Z and the right one to type / (slash).</p><p>Terms like 'zeal' reflect Jesuit apostolic zeal.</p>",
      "subunits": {
        "Grip": "azaz o/o/ azaz o/o/. zaza /o/o zaza /o/o, fzfz j/j/ fzfz j/j/; zfzf /j/j zfzf /j/j. azo/ /oza azo/ /oza, zo/a a/oz zo/a a/oz; /azo oza/ /azo oza/. azaa fzra /uoj /uza za/u za/o. azaz o/o/ azaz o/o/. zaza /o/o zaza /o/o,",
        "Words": "zeal / ooze; quiz / ablaze; bazar bazar; buzz buzz / czar; cozy cozy; dozen dozen dozen / dazzle; enzyme enzyme; gaze gaze / maze maze; size; zeta zeta / zigzag zigzag; zoo; zinc / zoom; fizz fizz; puzzle / nozzle; pizza pizza; zip zip / zero zero; zioty; zit / zone; seize; doze / ozone; frieze; frizz / maximize; minimize; organize / realize; prize; quantize /",
        "Control": "z zi zig zigz zigza zigzag / p pi piz pizz pizza / n no noz nozz nozzl nozzle / o oz ozo ozon ozone / m ma max maxi maxim maximi maximiz maximize / o or org orga organ organi organiz organize / c cz cza czar / z zi zin zinc /",
        "Sentences": "zeal for souls fuels mission. buzz of prayer in retreat. maximize grace in examen. organize thoughts in discernment.we should minimize called tzc is seize the day with hope. puzzle of life solved in faith.",
        "Test-1": "zeal quiz ablaze buzz czar cozy dazzle enzyme gaze maze size zeta zigzag zoo zinc zoom fizz puzzle nozzle pizza zip zero zone seize doze ozone maximize minimize organize realize prize quantize",
        "Test-2": "zeal / ooze quiz / ablaze bazar buzz / czar cozy dozen / dazzle enzyme gaze / maze size zeta / zigzag zoo zinc / zoom fizz puzzle / nozzle pizza zip / zero zioty zit / zone seize doze / ozone frieze frizz / maximize minimize organize / realize prize quantize"
      }
    },
    {
      "title": "'",
      "Img": ["img/littlefingers.jpg"],
      "guide": "<p>Use the right little finger to type ' (single quotation mark).</p><p>Use contractions in spiritual contexts like 'God's love'.</p>",
      "subunits": {
        "Grip": "'cla 'mai 'lsi 'kji 'mne 'uyz 'oxb 'gar 'vmn 'xzl 'ovc js'a pa'u do'a uy'b si'n ym'l pj's yn's wv'u ug'x tn'p ymo' aqo' wqp' pws' wip' yts' irm' ika' lkw' lrx' oip' fj'a mi's n'hs la'i w'by si'b 'ivk 'd'p '//' ''p/ ap/' 'pa/ 'ox/ /aq' 'ixr ;';' ';p/ a';q rpx' g;x' b'y; e/d' 'cla 'mai 'lsi 'kji 'mne 'uyz 'oxb 'gar 'vmn",
        "Words": "we're we're, you're you're, he's he's, she's she's, it's it's, they're they're; isn't isn't wasn't wasn't; we'd we'd, you'd you'd, he'd he'd, she'd she'd, they'd they'd;can't couldn't; you'll, he'll, she'll, they'll; here's there's; aren't aren't, weren't weren't; what's what's where's; don't, didn't;",
        "Control": "w we we' we'r we're, y yo you you' you'r you're, y yo you you' you'l you'll, s sh she she' she'l she'll, i is isn isn' isn't, h he he' he'l he'll w we we' we'r we're, y yo you you' you'r you're, y yo you you' you'l he' he'l he'll",
        "Sentences": "it's raining grace. i don't read jack's blogs on faith. he'll come now in prayer. mumbai isn't the capital of india but has missions. don't shout here in retreat. that's the book we need to learn prefer catechism. hilbert's missions. don't shout here in retreat. that's the book we need to learn bernoulli's principle but prefer catechism.",
        "Test-1": "we're you're she'll he'll isn't don't didn't can't i don't read jack's blogs on faith. don't shout here in retreat. that's the book we need to learn but prefer catechism. hilbert deals with infinity but lod's love is infinite. we're you're she'll he'll isn't don't didn't can't i don't read jack's blogs on faith. don't shout here in retreat.",
        "Test-2": "we're you're she's he's it's; i'm not; don't, can't, won't; lod's mercy; tesus's name; bgnatius's call; vesuits' mission; saint's witness; saints' prayers; neighbor's need; heart's desire; today's examen; pride's noise; soul's freedom; put pride aside; it's the .ord's; we're eod's people; love's labor lasts; mission's hope grows; that's enough; pilgrim's path proceeds; dary's"
      }
    },
    {
      "title": "Shift",
      "Img": ["img/littlefingers.jpg"],
      "guide": "<p>Press the shift key with the little finger. To type a capital letter, first press and hold the shift key with one hand, hit the letter with the appropriate finger of the other hand and then release the shift key.</p><p>Do not hit the shift key and the letter key with fingers of the same hand. Before hitting the letter think which hand will be used to type the letter. Use the alternate hand to hold the shift key and then type the letter. This will will require some effort in the beginning. You will gain speed as you practice this unit.</p><p>For example, to type F, first press and hold the right shift key with the right little finger, hit the F key with left forefinger and then release the shift key. After this return both the fingers immediately to the home row.</p><p>Practice names like Ignatius and Jesuit.</p>",
      "subunits": {
        "Grip": "aAbB cCdD eEfF gGhH aAbB cCdD eEfF gGhH; iIjJ kKlL mMnN oOpP iIjJ kKlL mMnN oOpP; qQrR sStT uUvV wWxX qQrR sStT uUvV wWxX; yYzZ yYzZ QWERT YUIOP; ASDFG LKJH; ZXCVB MN; ABCD EFGH ABCD EFGH IJKL MNOP IJKL MNOP; QRST UVWX QRST UVWX YZ YZ; UxWm YwnF VpAs BiKv CoGl DbJc QeZr HkXy LpOq EuzT MfNg RhjS tIBd aAbB cCdD;",
        "Words": "January March April May June December, USA UAE India UK Sri Lanka Egypt, New Delhi New York Moscow Brisbane Donald E. Knuth, Dennis M. Ritchie, S. Ramanujan, Ignatius Ignatius Ignatius, Jesuit, Loyola, Xavier, Rome January USA UAE India UK Sri Lanka Egypt, New Delhi New York Moscow Brisbane Donald E. Knuth, Dennis M. Ritchie, S. Ramanujan, Ignatius, Jesuit Loyola, Xavier, Rome",
        "Control": "U US USA, U UA UAE, U UK, M Ma Mar Marc Marc March, I Ig Ign Igna Ignat Ignati Ignatiu Ignatius, J Je Jes Jesu Jesui Jesuit, L Lo Loy Loya Loyal Loyala Loyola, X Xa Xav Xavi Xavie Xavier U US USA, U UA UAE, U UK, M Ma Mar Marc Marc March, I Ig Ign Igna Ignati Ignatiu Ignatius,",
        "Sentences": "New Delhi is the capital of India but Rome is for Jesuits. I am intelligent in faith. You should finish the work by June in mission. I love music in prayer. Dennis M. Ritchie developed the C language but prefer Ignatian exercises. The Spiritual Exercises",
        "Test-1": "USA UK UAE March India ZIP PIN SSL SSN PAN GNU/Linux Ignatius Loyola Xavier Rome Jesuit; I love music in prayer. New Delhi is the capital of India but Rome is for Jesuits. Spiritual Exercises by Ignatius of Loyola. USA UK UAE March India ZIP PIN SSL SSN PAN GNU/Linux Ignatius Loyola Xavier Rome Jesuit; I love music in prayer.",
        "Test-2": "USA UK UAE; Rome Paris Manresa Montmartre; St Ignatius of Loyola; St Francis Xavier; Society of Jesus; Spiritual Exercises; Daily Examen; Liturgy of the Hours; Gospel of Luke; A.M.D.G.; use oppositeAhand Shift; return to home row; accuracy before speed; capitals clean and clear; practice till flow returns; Pamplona to Manresa to RomeWrise, pray"
      }
    },
    {
      "title": "Phrases Practice",
      "Img": ["img/qwerty.jpg"],
      "guide": "<p>Type the practice passages with the correct fingers as practiced in the previous units. Type at least five passages before moving to next unit.</p><p>These passages are from Bible scriptures, Ignatian spirituality, Jesuit history, and Catholic catechism to edify and uplift.</p>",
      "subunits": {
        "Principle and Foundation": "Man is created to praise, reverence, and serve God our Lord, and by this means to save his soul. The other things on the face of the earth are created for man to help him in attaining the end for which he is created. Hence, man is to make use of them in as far as they help him in the attainment of his end, and he must rid himself of them in as far as they prove a hindrance to him. Therefore, we must make ourselves indifferent to all created things",
        "Anima Christi": "Soul of Christ, sanctify me. Body of Christ, save me. Blood of Christ, inebriate me. Water from the side of Christ, wash me. Passion of Christ, strengthen me. O Good Jesus, hear me. Within your wounds hide me. Permit me not to be separated from you. From the wicked foe, defend me. At the hour of my death, call me and bid me come to you That with your saints I may praise you Forever and ever. Amen. Soul of Christ, sanctify me.",
        "Suscipe": "Take, Lord, and receive all my liberty, my memory, my understanding, and my entire will, All I have and call my own. You have given all to me. To you, Lord, I return it. Everything is yours; do with it what you will. Give me only your love and your grace, that is enough for me. Take, Lord, and receive all my liberty, my memory, my understanding, and my entire will.",
        "Examen Prayer": "The Daily Examen is a technique of prayerful reflection on the events of the day in order to detect God's presence and discern his direction for us. The Examen is an ancient practice in the Church that can help us see God's hand at work in our whole experience. It is a daily reflective prayer for reviewing one's day and discerning God's presence.",
        "John 3:16": "For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life. Indeed, God did not send the Son into the world to condemn the world, but in order that the world might be saved through him. Those who believe in him are not condemned; but those who do not believe are condemned already, because they have not believed.",
        "Romans 12:12": "Rejoice in hope, be patient in suffering, persevere in prayer. Contribute to the needs of the saints; extend hospitality to strangers. Bless those who persecute you; bless and do not curse them. Rejoice with those who rejoice, weep with those who weep. Live in harmony with one another; do not be haughty, but associate with the lowly; do not claim to be wiser than you are.",
        "Hebrews 11:1": "Now faith is the assurance of things hoped for, the conviction of things not seen. Indeed, by faith our ancestors received approval. By faith we understand that the worlds were prepared by the word of God, so that what is seen was made from things that are not visible. By faith Abel offered to God a more acceptable sacrifice than Cain's. Now faith is the assurance of things hoped for, the conviction of things not seen.",
        "1 Corinthians 13": "If I speak in the tongues of mortals and of angels, but do not have love, I am a noisy gong or a clanging cymbal. And if I have prophetic powers, and understand all mysteries and all knowledge, and if I have all faith, so as to remove mountains, but do not have love, I am nothing. If I give away all my possessions, and if I hand over my body so that I may boast, but do not have love, I gain nothing.",
        "Psalm 23": "The Lord is my shepherd, I shall not want. He makes me lie down in green pastures; he leads me beside still waters; he restores my soul. He leads me in right paths for his name's sake. Even though I walk through the darkest valley, I fear no evil; for you are with me; your rod and your staffL they comfort me. You prepare a table before me in the presence of my enemies.",
        "Catechism 1": "God, infinitely perfect and blessed in himself, in a plan of sheer goodness freely created man to make him share in his own blessed life. For this reason, at every time and in every place, God draws close to man. He calls man to seek him, to know him, to love him with all his strength. He calls together all men, scattered and divided by sin, into the unity of his family, the Church.",
        "Catechism 27": "The desire for God is written in the human heart, because man is created by God and for God; and God never ceases to draw man to himself. Only in God will he find the truth and happiness he never stops searching forP The dignity of man rests above all on the fact that he is called to communion with God. This invitation to converse with God is addressed to man as soon as he comes into being.",
        "Catechism 293": "Scripture and Tradition never cease to teach and celebrate this fundamental trutha The world was made for the glory of God. St. Bonaventure explains that God created all things not to increase his glory, but to show it forth and to communicate it, for God has no other reason for creating than his love and goodness. Scripture and Tradition never cease to teach and celebrate this fundamental truth.",
        "Ignatius Autobiography": "In his autobiography, St. Ignatius recounts his conversion after being wounded. While recovering, he read lives of saints and the life of Christ, which inspired him to dedicate his life to God. This led to the creation of the Spiritual Exercises and the founding of the Society of Jesus in stht. In his autobiography, St. Ignatius recounts his conversion after being wounded",
        "Letters of Ignatius": "In his letters, St. Ignatius provided guidance on spiritual life and Jesuit mission. He emphasized obedience, discernment, and finding God in all things. One letter advisesL Love ought to show itself in deeds more than in words. In his letters, St. Ignatius provided guidance on spiritual life and Jesuit mission. He emphasized obedience, discernment, and finding God in all things.",
        "Constitutions of Jesuits": "The Constitutions of the Society of Jesus outline rules for Jesuit life, emphasizing spiritual formation and mission. They stress poverty, chastity, obedience, and the fourth vow of obedience to the Pope in regard to missions. The Constitutions of the Society of Jesus outline rules for Jesuit life, emphasizing spiritual formation and mission. They stress poverty, chastity, obedience, and the fourth vow of obedience to the Pope in regard to missions.",
        "Life of Francis Xavier": "St. Francis Xavier, born in fKHm, was a coefounder of the Jesuits. He missioned in India, Japan, and died in dHLy en route to China. Known as the Apostle of the Indies, he baptized thousands and spread the faith across Asia. St. Francis Xavier, was a cofounder of the Jesuits. He missioned in India, Japan, and died en route to China.",
        "General Congregations": "Jesuit General Congregations are assemblies that shape spirituality and mission. For example, General Congregation .j emphasized justice and faith, promoting 'men for others' and inculturation. Jesuit General Congregations are assemblies that shape spirituality and mission. For example, General Congregation DP emphasized justice and faith, promoting 'men for others' and inculturation.",
        "Ratio Studiorum": "The Ratio Studiorum is the Jesuit educational framework, integrating spirituality with intellectual formation. It was finalized in LW;M and influenced Catholic education worldwide, emphasizing liberal arts and theology. The Ratio Studiorum is the Jesuit educational framework, integrating spirituality with intellectual formation. It was finalized and influenced Catholic education worldwide.",
        "Jesuit Vows": "Jesuits take vows of poverty, chastity, obedience, and a fourth vow of special obedience to the Pope. These vows support their mission and spiritual discipline, as outlined in the Formula of the Institute. Jesuits take vows of poverty, chastity, obedience, and a fourth vow of special obedience to the Pope. These vows support their mission and spiritual discipline.",
        "Rules for Discernment": "The Rules for Discernment of Spirits in the Spiritual Exercises help understand spiritual movements and decisionhmaking. They distinguish between consolation and desolation to guide choices aligned with God's will. The Rules for Discernment of Spirits in the Spiritual Exercises help understand spiritual movements and decisionmmaking. They distinguish between consolation and desolation."
      }
    },
    {
      "title": "58",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type 5 and the right one to type 8.</p><p>Practice numbers related to Jesuit history, like 1556 death of Ignatius.</p>",
      "subunits": {
        "Grip": "f5f5 j8j8 f5f5 j8j8 f5f5 j8j8; 5f5f 8j8j 5f5f 8j8j 5f5f 8j8j; j5j5 f8f8 j5j5 f8f8 j5j5 f8f8; 5j5j 8f8f 5j5j 8f8f 5j5j 8f8f; f5r8 j8u5 f5r8 j8u5 f5r8 j8u5; asdf5 ;lkj8 asdfr5 ;lkju8 asdf5r ;lkj8u a5r8 85u8 8858 85l5 558u5 5r85 58rl8 s5858k a5s8 r5as8 s5l8r s585r d58k5 k85l5 r5l85",
        "Words": "5 gospels, 8 beatitudes, 58 chapters, 585 verses, 85 psalms, 88 keys, 55 books, 5 scrolls, 58 letters, 85 cities, 855 buildings, 588 saints, 858 missions, 585 retreats 5 gospels, 8 beatitudes, 58 chapters, 585 verses, 85 psalms",
        "Control": "5 58 585 5858 58585 585858 8 88 885 8855 88558 885585 8 85 858 8585 85858 858585 5 55 558 5588 55885 558858 5 58 585 5858 58585 585858 8 88 885 8855 88558 885585 8 85 858 8585 85858 858585 5 55 558 5588 55885 558858",
        "Sentences": "John has about 55 chapters in scripture. There are 8 beatitudes in gospel. There are 88 psalms of praise. Area code 585 is for retreats. 58 saints will be honored. John has about 55 chapters in scripture. There are 8 beatitudes in gospel. There are 88 psalms of praise.",
        "Test-1": "5 58 585 85 85 58 85 85 58 588 588 855 8558 588 588 85; 5 gospels, 8 beatitudes, 58 chapters, 585 verses, 85 psalms; There are 88 psalms of praise. John has about 55 chapters in scripture. 5 58 585 85 85 58 85 85 58 588 588 855 8558 588 588 85; 5 gospels, 8 beatitudes, 58 chapters, 585 verses, 85 psalms; There are 88 psalms of praise.",
        "Test-2": "5 58 585 858 885 5588 5885; 55 88 58 85 5858 8585; type 58 cleanly, eyes up; repeat 58 x 5, then 85 x 5; rememberF 8 Beatitudes pMt 5l, 5 books LTorahUNfacts for faith, digits for drills. 58 85 585 858 5588 8855 Eight Beatitudes inspire mercy; five books of Moses ground the storyytoday we train."
      }
    },
    {
      "title": "49",
      "Img": ["img/middlefingers.jpg"],
      "guide": "<p>Use the left middle finger to type 4 and the right one to type 9.</p><p>Numbers like 1491 birth of Ignatius.</p>",
      "subunits": {
        "Grip": "d4d4 k9k9 d4d4 k9k9 d4d4 k9k9; 4d4d 9k9k 4d4d 9k9k 4d4d 9k9k; k4k4 d9d9 k4k4 d9d9 k4k4 d9d9; 4k4k 9d9d 4k4k 9d9d 4k4k 9d9d; d4r9 k9u4 d4r9 k9u4 d4r9 k9u4; d4r8 k9u4 d4r8 k9u4 d8r9 k9u4; a8dd4 8akk9 as5dr4 5akku9 5s8d4r 8a5k9u a4r9 94u8 9549 94s4 489u4 4r95 49rd5 s4549k a4s98;",
        "Words": "4 gospels, 9 fruits, 49 days, 5945 verses, 99 psalms, 44 books, 45 chapters, 94 letters, 9454 saints, 94 missions, 545 retreats, 954 prayers, 598 exercises, 549 calls 4 gospels, 9 fruits, 49 days, 5945 verses, 99 psalms, 44 books, 45 chapters, 94 letters, 9454 saints, 94 missions,",
        "Control": "4 44 449 4499 44998 449985 9 94 948 9488 94885 948859 9 98 984 9844 98445 984459 4 48 489 4899 48994 489945 4 44 449 4499 44998 449985 9 94 948 9488 94885 948859 9 98 984 9844 98445 984459 4 48 489 4899 48994 489945",
        "Sentences": "The sum of 44 and 55 is 99 in scripture. 44 is one less than 45 books. 89 is one more than 99 psalms. 45 is a multiple of 9 fruits. The sum of 44 and 55 is 99 in scripture. 44 is one less than 45 books. 89 is one more than 99 psalms. 45 is a multiple of 9 fruits.",
        "Test-1": "4 49 94 9445 9844 9845 4589 9845 4458 4459 449 984 995; 4 gospels, 45 chapters, 5945 verses, 99 psalms, 94 letters; The sum of 44 and 55 is 99 in scripture. 44 is one less than 45 books. 4 49 94 9445 9844 9845 4589 9845 4458 4459 449 984 995; 4 gospels, 45 chapters, 5945 verses, 99 psalms.",
        "Test-2": "49 94 494 949 449 994 4949 9494; type 49 cleanly x9, then 94 cleanly x9; ladderg 49m494,4949w49494; mirrorl 94E949t9494j94949; pulse on 4, pause on 9; repeat Q495 A54I A548 once; finish with 49 94 4949 9494 49494 94949. Final minuteB 49 49 49 94 94 94 4449 9994 4949 9494 Train 4 and 9 with calm cadencek trace 49"
      }
    },
    {
      "title": "67",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type 6 and the right one to type 7.</p><p>Use numbers like 1622 canonization.</p>",
      "subunits": {
        "Grip": "f6f6 j7j7 f6f6 j7j7 f6f6 j7j7; 6f6f 7j7j 6f6f 7j7j 6f6f 7j7j; j6j6 f7f7 j6j6 f7f7 j6j6 f7f7; 6j6j 7f7f 6j6j 7f7f 6j6j 7f7f; f6r7 j7u6 f6r7 j7u6 f6r7 j7u6; asff6 ;ljj7 asffr6 ;ljju7 asff6r ;ljj7u a6r7 76u7 7767 76l6 667u6 6r76 67rl7 s6767j",
        "Words": "6 days, 7 churches, 77 books, 67 psalms, 76 verses, 776 saints, 765 missions, 46 exercises, 78 prayers, 56 calls, 664 retreats, 779 letters, 68 constitutions, 687 vows 6 days, 7 churches, 77 books, 67 psalms, 76 verses, 776 saints, 765 missions",
        "Control": "6 66 667 6677 66774 667745 7 76 768 7688 76885 768857 7 78 786 7896 78965 789657 6 68 687 6877 68776 687769 6 66 667 6677 66774 667745 7 76 768 7688 76885 768857 7 78 786 7896 78965 789657 6 68 687 6877 68776 687769",
        "Sentences": "67 is a prime but 76 isn't in math. 679 is multiple of 97 verses. 676 is one less than 677 saints. 767 is multiple of 59 missions. 67 is a prime but 76 isn't in math. 679 is multiple of 97 verses. 676 is one less than 677 saints. 767 is multiple of 59 missions.",
        "Test-1": "66 76 77 78 677 769 976 975 9756 568 485 9478 4588 465; 6 days, 7 churches, 664 retreats, 779 letters, 56 calls; 67 is a prime but 76 isn't in math. 676 is one less than 677 saints. 66 76 77 78 677 769 976 975 9756 568 485 9478 4588 465; 6 days, 7 churches, 664 retreats, 779 letters.",
        "Test-2": "67 76 676 767 667 776 6767 7676; type 67 cleanly x7, then 76 cleanly x7; ladderF 67n676g6767v67676; mirrorR 765767P7676T76767; pulse on 6, pause on 7; finish 67 76 6767 7676 67676 76767. Final minuteG 67 67 67 76 76 76 6667 7776 6767 7676. Close with 67676 76767 676767 767676 Train 6 and 7 with quiet posture on 6."
      }
    },
    {
      "title": "30",
      "Img": ["img/ringfingers.jpg"],
      "guide": "<p>Use the left ring finger to type 3 and the right one to type 0.</p><p>30 days for Spiritual Exercises retreat.</p>",
      "subunits": {
        "Grip": "s3s3 l0l0 s3s3 l0l0 s3s3 l0l0; 3s3s 0l0l 3s3s 0l0l 3s3s 0l0l; l3l3 s0s0 l3l3 s0s0 l3l3 s0s0; 3l3l 0s0s 3l3l 0s0s 3l3l 0s0s; s3r0 l0u3 s3r0 l0u3 s3r0 l0u3; asss3 ;lll0 asssr3 ;lllu0 asss3r ;lll0u a3r0 03u0 0030 03l3 330u3 3r03 30rl0 s3030l a3s0 q3ks0 s3l0n",
        "Words": "30 days, 300 saints, 303 verses, 367 psalms, 70 years, 73 goals, 40 missions, 83 books, 50 letters, 80 exercises, 35 vows, 307 retreats, 360 prayers, 630 chapters, 305 diaries 30 days, 300 saints, 303 verses, 367 psalms, 70 years, 73 goals, 40 missions, 83 books, 50 letters, 80 exercises",
        "Control": "3 34 340 3400 34003 340035 0 03 038 0387 03870 038703 0 07 076 0763 07633 076330 3 30 309 3093 30930 309303 3 34 340 3400 34003 340035 0 03 038 0387 03870 038703 0 07 076 0763 07633 076330 3 30 309 3093 30930 309303",
        "Sentences": "April has 30 days for retreat. There are 365 days in a year of prayer. 390 is a multiple of 3 in trinity. 37 is a prime in faith. April has 30 days for retreat. There are 365 days in a year of prayer. 390 is a multiple of 3 in trinity. 37 is a prime in faith.",
        "Test-1": "34 30 365 70 30 90 53 80 73 50 3580 3470 9074 7030 7037; 30 days, 630 chapters, 80 exercises, 83 books, 307 retreats, 35 vows; April has 30 days for retreat. There are 365 days in a year of prayer. 34 30 365 70 30 90 53 80 73 50 3580 3470 9074 7030 7037; 30 days, 630 chapters for retreat.",
        "Test-2": "30 03 303 330 300 3003 30303; 33 00 30 03 3030 0303; type 30 x C0, then 03 x K0; ladderf 30H303O3030C30303; finish with 30 03 3030 0303. 30 03 303 330 3003 30303 33000 30 03 303 330 3003 30303 33000 Train 3 and 0K trace 30, 03, 330, 303, 300, 3003; the long retreat spans 30 days PSEj, then return to 30y03 drills; breathe on 0, reset on 3.30.day long retreat"
      }
    },
    {
      "title": "12",
      "Img": ["img/littlefingers.jpg"],
      "guide": "<p>Use the left little finger to type 1 as well as 2.</p><p>1521 wounding of Ignatius, 1622 canonization.</p>",
      "subunits": {
        "Grip": "a1a1 q2q2 a1a1 q2q2 a1a1 q2q2; 1a1a 2q2q 1a1a 2q2q 1a1a 2q2q; q1q1 a2a2 q1q1 a2a2 q1q1 a2a2; 1q1q 2a2a 1q1q 2a2a 1q1q 2a2a; a1z2 p2q1 a1p2 p2u1 a1z2 q2p1; aaaa1 ;qqq2 aaaar1 ;p1qu2 a2ap1r ;1pq2u a1p2 21z2 2212 21q1 112u1 1r21 12rq2 a1212q a1a2 q1ka2 a1q2n a121o j12q1 o21q1 m1q21 a2112 112a",
        "Words": "12 apostles, 21 letters, 52 weeks, 11 books, 22 psalms, 2 testaments, 121 verses, 132 chapters, 82 saints, 192 missions, 21 vows, 14 retreats, 511 prayers, 122 exercises, 811 constitutions 12 apostles, 21 letters, 52 weeks, 11 books, 22 psalms, 2 testaments, 121 verses, 132 chapters, 82 saints",
        "Control": "1 12 121 1218 12182 121822 2 27 271 2719 27192 271922 2 24 241 2415 24158 241581 1 18 182 1821 18211 182112 1 12 121 1218 12182 121822 2 27 271 2719 27192 271922 2 24 241 2415 24158 241581 1 18 182 1821 18211 182112",
        "Sentences": "There are 12 apostles and 52 weeks in liturgical year. Square of 11 is 121 verses. 22 is one more than 21 letters. 211 is a prime in scripture. There are 12 apostles and 52 weeks in liturgical year. Square of 11 is 121 verses. 22 is one more than 21 letters.",
        "Test-1": "12 21 52 11 22 2 121 132 82 192 21 14 511 122 811 917; 12 apostles, 52 weeks, 121 verses, 82 saints, 192 missions; There are 12 apostles and 52 weeks in liturgical year. 211 is a prime in scripture. Square of 11 is 121 verses. 12 21 52 11 22 2 121 132 82 192 21 14 511 122 811 917; 12 apostles",
        "Test-2": "12 21 121 212 112 221 1212 2121; 11 22 12 21 1212 2121; type 12 x 12, then 21 x 12; ladderL 12Z121'1212x12121; finish with 12 21 1212 2121. 12 21 121 212 112 221 1212 2121 1221 12 21 121 212 112 221 1212 2121 1221 Train 1 and 2j trace 12, 21, 121, 212, 112, 221; twelve apostles, twelve tribes; anchors 1521 and 1622 once"
      }
    },
    {
      "title": "Number Practice",
      "Img": ["img/qwerty.jpg"],
      "guide": "<p>Type the number passages with the correct fingers as practiced in the previous units. Type at least five passages before proceeding to next unit.</p><p>These passages feature dates and statistics from Jesuit history and Bible, blended creatively for practice (note: some elements are fictionalized for typing flow).</p>",
      "subunits": {
        "Ignatius Birth and Death": "St. Ignatius was born in 1491. He was wounded in 1521 at Pamplona. The Society of Jesus was founded in 1540. Ignatius died in 1556 on July 31. He was beatified in 1609 and canonized in 1622 on March 12. His feast is celebrated on July 31. The Spiritual Exercises last 30 days, with 4 weeks of meditations. Ignatius wrote over 7000 letters, guiding 1000 Jesuits in 55 countries by 1556.",
        "Jesuit Founding": "The Jesuits were approved by Pope Paul III on September 27, 1540. The first companions were 10, including Ignatius and Xavier. By 1556, there were 1000 members in 12 provinces. General Congregations number 36 to date, with the 36th in 2016. The Ratio Studiorum was published in 1599. Jesuits run 189 universities worldwide, educating 2500000 students. In 1773, the order was suppressed.",
        "Francis Xavier": "St. Francis Xavier was born in 1506, died in 1552. He baptized 30000 in India from 1542 to 1544. Traveled 50000 miles, visited 50 islands. Canonized in 1622 with Ignatius. Feast day December 3. Co.founder of Jesuits in 1534 with 6 others. His letters number 137. Missions in Japan from 1549, converting 2000. He baptized 30000 in India from 1542 to 1544.",
        "Bible Books and Chapters": "The Bible has 66 books in Protestant, 73 in Catholic. Old Testament 39 books, New 27. Genesis has 50 chapters, Psalms 150. John 21 chapters, Revelation 22. There are 1189 chapters total, 31102 verses. Longest verse Esther 8j9 with 90 words. Shortest John 11B35 'Jesus wept'. lStats inspire while practicing numbers.2 The Bible has 66 books in Protestant",
        "Catechism Sections": "The Catechism has 2865 paragraphs, 4 parts. Part 1 on creed, 1066 paragraphs. Part 2 sacraments, 424. Part 3 life in Christ, 736. Part 4 prayer, 639. Published 1992, translated to 50 languages. References 356 Bible books, 88 councils. 6Blended facts for edification and practice.' The Catechism has 2865 paragraphs",
        "Jesuit Saints": "Over 150 Jesuit saints and blesseds. CanonizedZ 52, beatified 153. Ignatius 1622, Xavier 1622, Aloysius Gonzaga 1726, Peter Faber 1872, Edmund Campion 1970. Martyrsf 40 in England 1588U1679, 8 in North America 1642o1649. PCreative compilation of numbers for uplifting typing.8 Over 150 Jesuit saints and blesseds.",
        "Spiritual Exercises Stats": "The Exercises have 370 annotations, 4 weeks. Week 1B 5 meditations, Week 2d 12 contemplations. RulesW 14 for first week discernment, 8 for second. Retreats0 30 days full, 8 days abbreviated, 19th annotation daily life. Over 1000000 have done it since 1524. 7Mix of actual and estimated for practice.",
        "General Congregations": "36 Congregations since 1558. GC1 1558 elected Lainez, GC32 1975 justice focus, GC35 2008 elected Nicol1s, GC36 2016 elected Sosa. Decrees6 over 1000 total, GC34 26 decrees. AttendeesE 200I250 per. .Fictionalized counts with history.u 36 Congregations since 1558. GC1 1558 elected Lainez, GC32 1975 justice focus.",
        "Jesuit Education": "845 schools worldwide, 189 universities. FoundedT 1548 Messina college, 1551 Roman College. Studentsh 2500000. Provinceso 80, with 16000 Jesuits. 2Blended stats for inspiration.K 845 schools worldwide, 189 universities. Foundedq 1548 Messina college, 1551 Roman College.",
        "Bible Verses Numbers": "John 3n16, Romans 5Q8, Ephesians 288W9, Hebrews 11,1, 1 Corinthians 13r13, Psalm 23h1, Matthew 28819,20, Philippians 4813, Jeremiah 29.11, Proverbs 3c5g6. ChaptersO Genesis 1, Exodus 20, Leviticus 19, Numbers 6r24s26. ,Key verses for faith practice.p John 3y16, Romans 5S8, Ephesians 228u9",
        "Canonization Dates": "Ignatius and Xavier 1622, Stanislaus Kostka 1726, Robert Bellarmine 1930, Aloysius Gonzaga 1726, John Berchmans 1888, Peter Canisius 1925, Andrew Bobola 1938, Claude de la Colombiere 1992. Over 40 martyrs in 1970. HHistorical dates for typing.d Ignatius and Xavier 1622, Stanislaus Kostka 1726, Robert Bellarmine 1930, Aloysius Gonzaga 1726."
      }
    },
    {
      "title": "!@#$",
      "Img": ["img/leftfingers.jpg"],
      "guide": "<p>Use the left fingers, i.e littlefinger to type <b>!</b> ringfinger to type <b>@</b> middlefinger to type <b>#</b> and forefinger to type <b>$</b></p><p>Note: Set your keyboard layout to \"US keyboard layout\" in image above.</p><p>Practice in context of spiritual messages.</p>",
      "subunits": {
        "Grip": "$@!#@ #!$@$ !#!#$ @!#@$ $!@#@ #!$@# !$#@$ !$!#@ @#$!! #$@$@ #!!@$ #$!#@ @$!#! @$#@# !$$!@ ##@!$ #$@!@ !#$#$ !@$@# !#!@$ $!@#@ $!!$# @#!$@ #@!$! $@##$ @!@$! #!$#@ !@#$@ $#!$@ !##@$ !#!@$ @$#!$ @!#@$ !#@#!",
        "Words": "#!@$# @#$@$ #@$#! $#@!@#@ !#@$ !@#$!$ #@#@$@ #@#$# @#!$#!$ !@$ @!#$ @$#!$# @#!#$! #!$!@ $@$!$! #$# @#!# @$@$# !#@$ @!@!$ #$#$@!$ !@#@ $@$!#@ $@$@#!@#$ #!@# $@!#$ #@#$ @#!@#@ !@!@$! @!$!#!@ $!# !$@#@ $!#@$#! #!$@$ !#@!@ !#!@",
        "Control": "#Faith ALGOL 68! 4C HetCo logogram APP Tiffany R Co ATjT, #Hope color! LDA #10! $#Grace! Symphony #5! #Love is set cardinality! ###, as a marker in text! #NOF is often used for fractured neck @ femur! #xFF03 @ hex number! $ is used in the ALGOL 68! $ is used @ the prompt command! $ matches the end of a line or $ mean",
        "Sentences": "US$ !618@907! Isle @ Man in 1983. A #2 pencil! #key @ a phone! language is written C#! #FFAA00 color! LDA #10! $#array! Symphony #5! #S is set cardinality! #NOF Isle @ Man in 1983. A #2 pencil! #key @ a phone! language is written C#! #FFAA00 color! LDA #10! $#array! Symphony #5! #S is set cardinality! ###, as a marker in text! #NOF is often used for fractured neck @ femur!",
        "Test-1": "$ is a symbol! $1 read as 1 dollar. $ denominations are $1 $5 $10 $50 and $100! @ is commonly called the at symbol! Example #1, 7 widgets @ $2 per widget! Example uses are ssh jdoe@example.net and user@host! @ is commonly used to denote a reply, for instance @Jane! @ is used to represent the $ORIGIN in DNS! @echo off is a batch command! Emails john@francis.com gonzaga@novitiate.org",
        "Test-2": "!@#$ x 10; #AMDG! @mission #mercy $justice; !alert @team #task $budget; !start @now #today $10; !@ !@@ !@@@ # ## ### $ $$ $$$; !@#$;@#$!@#!$@u$@#!; repeat 3x, pause, then !@#$ 10x clean. !@#$ #Give $alms! #Guard $time! @Pray, then #actMAMDG! !Joy rises; #grace grows; $costs counted; @call accepted."
      }
    },
    {
      "title": "&*()",
      "Img": ["img/rightfingers.jpg"],
      "guide": "<p>Use the right fingers, i.e forefinger to type <b>&</b> middlefinger to type <b>*</b> ringfinger to type <b>(</b> and littlefinger to type <b>)</b></p><p>Note: Set your keyboard layout to \"US keyboard layout\" in image above.</p><p>Use in spiritual contexts.</p>",
      "subunits": {
        "Grip": ")*(&& *())( &*()* &&)*( )&(*) *&()* (&*)( &(*)& (&)** ()&)& *(()* &*()& )*(&& )*()& (**&) (*)&( &)*() &*(() *&&)( **)(& (*)&) (*&*( )&)(* &()&* &(*)* &())( &*&() **&() ()&*) *(&*& ()&*) ()&*( )(&** (&))( *&)(* &&(*) *)(&*",
        "Words": "&)*&( &)(&) *&)*( &*)& *&)&) &*(&*) &*(&*) (&*)(&( &*&) *(&(&) *(&*(& *)(&* )&*&* (&*) (&*)& (&(&* (&*)( &)&*( &*)(& *(&)& *(&*) (&*)( &*)( &*&) &)&)* (&*) (&*)(& *)&)* (&*&) &*(&* (&)&)* (&*(&*) (&*)(&* )(&* (&*)( &*&) (&*)& *(&)& *(&*",
        "Control": "& #Faith ALGOL 68! &C (etC) logogram A&P Tiffany & Co AT&T, #Hope color! R&D (4 & 2) is zero HC(CH3)3 (isobutane) test & 1.38064852(79) &func, &a &FF Doc* and D*ment* #xFF03 @ hex! 'b*ll*cks' @@ prefixes $Ulrich$ Ca(NO3)2 (calcium nitrate) !618@907 $10 $50 and $100 @echo off & #Faith ALGOL",
        "Sentences": "Doc* and D*ment* would return this file e.g &x, &func, &a &FF for decimal 255 x, #Hope color! &#38 &amp HTM &#65120 & bitwise AND '*action*' & 1.38064852(79) &func, &a &FF B&B (bed and breakfast), and P&L (profit and loss) #xFF03 @ hex! 'b*ll*cks' @@ prefixes  !618@907!",
        "Test-1": "A&P (supermarkets), Tiffany & Co, AT&T (American Telephone and Telegraph) are firms. Emphasis like (What6 Yes, that was her name!) 5** is the highest level in HKDSE '*action*' signifies action. #bluesky #blacklivesmatter and #me2 are social tags. Word *ainlif is a form. $1 reads as 1 dollar",
        "Test-2": "Run laddersm & Z &* Q &*() d ()*&; mirrorsW () t ()* , ()*& t &*(); triplets! &&&, ***, ((()), ()); sets@ &* &*& &*() ()*&; minute drill5 &*() ( 10; then( (&) (*) ( ) & (&) (*) ( ); finish with & &* &*() ()*& (()) ((())) && ** () Grace & grit belong togetherf pray & serve, listen & act, give & go. Use oppositedhand Shift (*) and keep wrists level."
      }
    },
    {
      "title": "!@#$&*()",
      "Img": ["img/allfingers.jpg"],
      "guide": "<p>Use all fingers, that is: the left fingers with littlefinger to type <b>!</b> ringfinger to type <b>@</b> middlefinger to type <b>#</b> and forefinger to type <b>$</b>.The right fingers with forefinger to type <b>&</b> middlefinger to type <b>*</b> ringfinger to type <b>(</b> and littlefinger to type <b>)</b></p><p>Note: Set your keyboard layout to \"US keyboard layout\" in image above.</p><p>Practice with spiritual hashtags and emails.</p>",
      "subunits": {
        "Grip": "#(*)@ &#$!! @$(*& )($(! @$&*# )@#&) !*#(! )!@** &&)($ $#@$) ((*$* @@&)# &!!#* !@$$# (*#@) &(!&) (#$$@ !&@#& **)(! )$)@@ #!($* &(*!& )#!*$ )$()( &!@@# &#*$$ &#@)! (&@*( #)!*@ #!*&$ #$!() )&(*@ (*(#* $#@$) &$)!@ &!&@# *)@@($",
        "Words": "@#(@& !($@* @#$#! $&!)&# ()!@* @(!(& @#$*) !#$*& (*)#@) *(#$*$ &)*!#@ #$!#& #)*!& #@!@& #@($*( $&@& $#@)*# $)#!&@ (#*$# @)*!@$ *@#$@) @!#)!& @(#)@ $#&$ @!(@&$ )@*!@ #(&#& @$@*#@ (#@&( #$!$ !(@!*# @#*(@$ #@&#$ @$!&*",
        "Control": "#bluesky and #me2 are tags & #Faith ALGOL $1 reads as 1 dollar 68! (4 & 2) is 0, (4 & 5) is 4 &C (etC) logogram The 107* means '107 not out' A&P Tiffany & Co AT&T, #Hope color! * is in C*Valgebra e.g &x, &func R&D (4 & 2) is zero HC(CH3)3 (isobutane)",
        "Sentences": "'b*ll*cks' (bollocks) 61*. * is in C*&algebra e.g &x, &func. 5** is highest in HKDSE '*action*'. $ is a symbol for $100! #bluesky and #me2 are tags. *ainlif is a form. $1 reads as 1 dollar. root@local.net! is address. () are used in chemistry e.g. Ca(NO3)2. The 107* means '107 not out'. 5**3 is exponent.",
        "Test-1": "A&P (supermarkets), Tiffany & Co are firms. * is in A* search algorithm or C*.algebra. 5** is the highest level in HKDSE '*action*' signifies action. $ is a symbol for $10 $50! #bluesky #blacklivesmatter and #me2 are social tags. Word *ainlif is a form. $1 reads as 1 dollar and ssh jdoe@example.net and root@localhost! are emails.",
        "Test-2": "!@#$&*() c 10; laddersH ! & !@ 2 !@# p !@#$ , !@#$& M !@#$&* 1 !@#$&*(); mirrorsF () w ()* f ()*& ; &*() e &*()$#@!; tagse #faith #hope #charity; budgetu $1$$37$5K$8; pingsf @campus @parish @service; finishp !@ !@@ !@@@ # ## ### $ $$ $$$ & && &&& * ** *** ( ) (( )) ) ) ) u O! onU , pU"
      }
    },
    {
      "title": "`-=~%^_+",
      "Img": ["img/littleandforefingers.jpg"],
      "guide": "<p>Use the following fingers: the left littlefinger to type <b>`</b> and <b>~</b> right littlefinger to type <b>-</b>, <b>_</b>, <b>=</b> and <b>+</b> left forefinger to type <b>%</b> and right forefinger to type <b>^</b>.</p><p>Note: Set your keyboard layout to \"US keyboard layout\" in image above.</p><p>Practice in mathematical and spiritual contexts.</p>",
      "subunits": {
        "Grip": "-%_`` +^%~~ =+-_= ^~-%_ =`~=+ -^+%` _^^~+ `-^+_ `-=_% %=~^` =%+~^ _-+%- ~_=`+ %^-%- _`~_= ~=+^` ``=-+ ~^_~_ %+-^% =_%`+ %_=~~ +`^-= -^_`^ ~=+%_ +=--^ ~%`%_ ^=-=- ++~%^ `_~`_ `=-%_ `%~^+ -+=~^ `^_%= %~_^- -~+=+ ``+%` ==%^_",
        "Words": "^~_^ %~_+ %_^% _~=_ +%~_ %=~ =`+~ +%+= ^_~= +~%=~ _+~^ ~%`+ ~^=_ `%_^ =~`= %~=^ _^%~^+ %`^% ^~+_~ =~%_ ~%=`% ~=%^`+ _^=~^ %=^^~ _%+~ %^~ %`~ +_%~ `^~%+ ~^=^` =+~`+ ^%~`=  _%+~ %^~ %`~ +_%~ `^~%+ ~^=^` =+~`+ ^%~`= _^`=~ ^%_`= ~`=^% _`%~^",
        "Control": "~ is for ~approximation~. Used_in *E` and Hawai`i. In DOS %1, %2, are parameters. `..` is_spacing + and - = positive_and_negative /* %Use the `printf` function.% */ -5 is minus-five -5^2 = +25... ~ is for ~approximation~. Used_in *E` and Hawai`i. In DOS %1, %2, are parameters. `..` is_spacing",
        "Sentences": "`examen` ~ `review_day` + `gratitude` - `ego` = `resolve+grace`; `AMDG` ~ `mission` + `service` - `self` = `praise_of_God`; pilgrims write `notes` with ~calm hearts, keeping %focus and ^hope; in prayer we mark `consolation` ~= `light` + `peace`, `desolation` = `-noise`; the rule: keep %faith",
        "Test-1": "`faith%hope^love=charity` ; `seek%find^serve=AMDG` ; `_listen~review=examen` ; `mission+justice-ease=service` ; `light^grace%peace=consolation` ; `-fear +trust = ~calm` ; `humility%obedience+zeal=freedom` ; `Scripture^pray%ponder=wisdom` ; `_daily+Examen-accuse=mercy` ; `Ignatius~Loyola%P",
        "Test-2": "`AMDG`=+mission-ego~service%^praise; examen=`ask+thank+review+repent+resolve`%daily^growth; works_of_mercy=feed+drink+shelter+visit+bury -apathy = love%action; choices:+discern -desolation = consolation^hope; rule:`_+=-` `~%^`AMDG` ~ ad_maiorem_dei_gloriam +service -self = praise_of_God; examen:`ask+thank+review+repent+resolve` ~ daily%practice ^hope;"
      }
    },
    {
      "title": "Chars Practice",
      "Img": ["img/qwerty.jpg"],
      "guide": "<p>Type the chars passages with the correct fingers as practiced in units 22 to 25. Type at least five passages before proceeding.</p><p>These intensive practices use special characters in uplifting spiritual contexts, blending facts and creative elements.</p>",
      "subunits": {
        "Ignatian Emails": "Contact jesuits@ignatian.org for retreats! #Faith&Hope (Love*) @God^grace %100 +joy -doubt =salvation ~peace. Send queries to info@jesuits.org & receive newsletters. #SpiritualExercises (30 days) @dailyexamen %discern +console -desolate =direction `in prayer. (Note_ creative addresses inspired by real organizations.) Contact jesuits@ignatian.org for retreats! #Faith&Hope (Love*)",
        "Hashtag Prayers": "#PrayAlways & #DiscernWell (Faith^strong) @Lord %give +strength -fear =courage ~love. #JesuitMission (World*) @AMDG %for greater glory +service -self =missionary. #BibleVerses & #CatechismQuotes (John3316) @Godslove %eternal +hope -despair =life `everlasting. (Fictional hashtags mixed with real themes.)",
        "Symbolic Formulas": "Faith + Hope & Love = Greatest (1Cor13*) @Trinity %three -one =God ~mystery. Discernment ^spirits (console&desolate) @Examen %daily +reflect -ignore =growth. Mission & Vows (Poverty*) @Jesuit %obey +serve -attach =freedom ~zeal. (Creative equations based on Ignatian principles.)",
        "Creative Mission Story": "In a fictional tale, Ignatius@Pamplona1521 #wounded &converted (Cannonball*) @God %call +respond -resist =founder ~Society. Xavier@Asia1541 #mission &baptize (Thousands*) @faith %spread +zeal -fear =saint ~apostle. (Blend of history and imagination for practice.) In a fictional tale, Ignatius@Pamplona1521 #wounded &converted (Cannonball*)",
        "Catechism Codes": "#CCC27 (Desire^God) @heart %written +seek -ignore =find ~truth. #CCC293 (World^glory) @creation %for God +praise -waste =purpose ~beauty. &Tradition (Scripture*) @Church %teach +live -forget =faith ~eternal. (Actual references with creative symbols.) #CCC27 (Desire^God) @heart %written +seek -ignore =find ~truth.",
        "Ignatius Journey": "Pamplona (1521) breaks pride; Montserrat (1522) bends plans; Manresa (1522) births the Examen; Paris (1534) vows; Rome (1540) sends. I type and travel3 walkKwatch9write; tagsU #AMDG, @companions; budgetf $1+$3+$5+$8; mapsN 1491G1556; prayerE ask+thank+review+repent+resolve; ladderO !@",
        "Bible Hope": "Bible hope speaks in numbers and namesC Jn 3)16, Lk 15s4-7, Mt 533-12, Ps 23, Rom 8. I type, 3,1695t3C23z8; I breathe; I believe. Shepherd words steady steps0 walk-rest-restore; symbols say it short-! urgency, @ address, # topic, $ gift",
        "Jesuit Scientists": "Jesuit scientistsH Clavius 1538-1612 (calendar math); Kircher 1602-1680 (museums & magnets); Boscovich 1711-1787 (forces); Secchi 1818-1878 (spectra). I type ladders_ 1538#1612f1602y1680L1711W178771818O1878; tagsC #ratio #observatory; budget linee $1+$3+$5+$8 for lenses; equationss hope^2",
        "Catechism Creation": "Catechism6 CCC 1, 27, 293; creation ex nihilo, ordered to glory; human hearts made for God, restless until they rest in him. Digits anchor thought. 6 days, 7th rest; I types 1s27O293, then 6q7; symbols summarize-= assign, - subtract, + add, ~ approximate, ^ raise, ( ) hold; row-AMDG.",
        "Discernment Rules": "Discernment9 SE 313-327 name rules for the first set; 328-336 the second. In desolation, never change (rule 5); in consolation, plan humbly; check the source, course, and fruit. I drill flowsJ ask+thank+review+repent+resolve; then symbols1 !@#$&*() and `-=~%^_+`; I tag #consolation #desolation, add $1+$3+$5+$8, and end with #AMDG.",
        "Hard:AMDG Run": "#AMDG !@#$ &*() `-=~%^_+ ; pray(quietly)*serve(bravely); @team #works_of_mercy $10+$5+$3 for alms; review* examen~daily -k ask+thank+review+repent+resolve; loopZ !@#$ !@#$ &*() &*() `-=~%^_+ `-=~%^_+ ; breathe, reset, @mission #Magis !start now% $0+$1+$2+$3 budget; link love&justice -A service(+);",
        "Hard:Evening Thanks": "#examen @eveningM ask+thanks+review+repent+resolve; type runsk !@ !@@ !@@@ ### $$$ &&& *** ((())) ; weave `~~~` --- === ___ ++++ %% ^^ __ ++ ; finish with !@#$&*() `-=~%^_+ signal= ! urgency, @ address, # topic, $ value, & join, * multiply, ( ) hold, ~ approx, ^ raise, _ joiner, - minus, = assign, + add;",
        "Hard:Parish Ledger": "#AMDG @parish $alms & service * practice (daily); ledgerh $1+$3+$5+$8; hashtagso #faith #hope #charity; laddero ` -z `- -F `-= -G `-=~ -b `-=~% -# `-=~%^ -3 `-=~%^_ -c `-=~%^_+ ; pause, repeat composee love+justice=service; pride-ego=loss; mercy&truth(steady); drill sets, !! @@ ### $$$",
        "Hard:Campus Cadence": "@campus ping; #budget# $12+$15+$22; quick prayer(examen)F ask+thank+review+repent+resolve; practice blockd `~~~` ___ --- === ; stackV %%^^ ^^%% ; cycle2 !@#$ &*() `-=~%^_+ ; soft touch, steady tempo labels4 #Gospel #Examen #AMDG; math-note, hope^3~joy^3 when love+mercyTego; drill0 !@ !@# !@#$ return home.",
        "Hard:Works-of-Mercy": "works_of_mercy/ feed+give+visit+shelter+bury (USCCB ref); type symbols not words! $$$ $+$+$ ; @team @service @neighbor ; hashtag streamb #mercy #justice #welcome ; weave &*() &*() and `-=~%^_+` cleanly roadmap* plan=pray+serve; budget=$10+$10+$5; tags8 #Magis #AMDG #daily_examen ;",
        "Hard:Crossfade": "countdownst !!! @@@ ### $$$ &&& *** ((( ))) ; crossfade1 `~~~ --- === ___ ++++` ; stair-stepq ! F !@ C !@# ' !@#$ D !@#$& 1 !@#$&* p !@#$&*() ; breathe every 3 sets mantra+ #AMDG; examen~nightly; add+$, remove-, assign=, join_, raise^, approx~, hold( ), multiply*; full run1 !@#$&*() !@#$&*()",
        "Hard:Mission": "@Jesuits #missionC serve&teach; budget lineT $1+$3+$5+$8 ; drill fieldj `-=-=` ==-- ~~== %%^^ __++ ; loop twice; then sprintn !@#$&*() `-=~%^_+ ; accuracyhspeed-always signal setB #faith! #hope! #charity! ; replya @friend @parish ; gift line+ $10+$2+$1 ; enterx &*() &*()",
        "Hard:Review": "review(examen)l ask+thanks+review+repent+resolve; drill ladderR ` -v `= -. `=+ -m `=+_ -) `=+_^ -s `=+_^% -p `=+_^%~ ; then splice !@#$ &*() ; finish steady AMDG tagy #AMDG @today ; buildS love+truth=service ; subtracta pride-ego=0 ; reservel (quiet) *(steady)* ; type blocksZ !@#$",
        "Hard:Justice": "pingD @campus,@service ; topicsC #mercy,#justice ; fund( $2+$2+$4+$8 ; chainsc `=== ___ --- ~~~` ; pairs* %% ^^ __ ++ ; final braidt !@#$ &*() `-=~%^_+ ; eyes up, no peeking notationk (faith)+ (hope)+ (love)=life ; compressa ego- -% 0 ; expand.",
        "Hard:Prayer Mix": "short prayer$ #Examen @evening ; steps8 ask+thank+review+repent+resolve ; symbols first; ! !@ !@# !@#$ ; then &* &*() ; finish_ `-= `-=~ `-=~%^ `-=~%^_+ ; soft, precise, patient final mixZ !@#$&*() + `-=~%^_+ ; tagsx #AMDG #Magis #works_of_mercy; done."
      }
    },
    {
      "title": "Speed Practice",
      "Img": ["img/qwerty.jpg"],
      "guide": "<p>Type the speed practice passages to build fluency. These are authentic excerpts from Ignatian and Catholic sources for inspiring typing. Each passage is between 500 and 1500 characters to allow smooth, rapid practice while absorbing edifying content.</p>",
      "subunits": {
        "Spiritual Exercises Annotation 1": "The Spiritual Exercises of St. Ignatius of Loyola are a compilation of meditations, prayers, and contemplative practices developed by the saint to help people deepen their relationship with God. For centuries in all kinds of religious houses and abodes of spiritual teaching they have been proved of very great service for the spiritual perfection of men. The annotations and rules are here given in their entirety, as translated from the original autograph of St. Ignatius. First Annotation. By this name of Spiritual Exercises is understood every way of examining one's conscience, of meditating, of contemplating, of praying vocally and mentally, and of performing other spiritual actions, as will be said later. For as strolling, walking and running are bodily exercises, so every way of preparing and disposing the soul to rid itself of all the disordered tendencies, and, after it is rid, to seek and find the Divine Will as to the disposition of one's life for the salvation of the soul, are called Spiritual Exercises. Second Annotation.",
        "Spiritual Exercises Annotation 2": "Fourth Annotation. The following Exercises are divided into four parts8 First, the consideration and contemplation on the sins; Second, the life of Christ our Lord up to Palm Sunday inclusively; Third, the Passion of Christ our Lord; Fourth, the Resurrection and Ascension, with three Methods of Prayer. Though four weeks are assigned to the four parts, it is not to be understood that each Week has necessarily seven or eight days. For, as it happens that in the First Week some are slower to find what they seek -- namely, contrition, sorrow and tears for their sins -- and in the same way some are more diligent than others, and more acted on or tried by different spirits; it is necessary sometimes to shorten the Week, and at other times to lengthen it. The same is true of all the other Weeks, seeking out the things according to greater or less need. However, the Exercises should be finished in thirty days, more or less. Fifth Annotation. It is helpful to the one who is giving the Exercises, not knowing the other's thoughts or sins, to be faithful in asking him what he has thought or felt on the matter proposed for contemplation or meditation.",
        "Ignatius Autobiography Excerpt 1": "Up to his twenty-sixth year the heart of Ignatius was enthralled by the vanities of the world. His special delight was in the military life, and he seemed led by a strong and empty desire of gaining for himself a great name. The citadel of Pampeluna was held in siege by the French. All the other soldiers were unanimous in wishing to surrender on condition of freedom to leave the place, as they saw clearly that it was impossible to hold out. Ignatius persuaded the commander to continue the defense. His comrades took him at his word, for he was a great encouragement to them by his example and words. When the day of assault came, Ignatius made his confession to one of the nobles, his companion in arms. The wall was breached. Ignatius stood ready to defend the breach. He was struck by a cannon ball; thus the conquerors took possession. When the citadel was surrendered, the French so admired his courage that they carried him handsomely to his quarters. It was not long before he found himself in a critical condition. He asked for some books to divert him, during his convalescence. He was given the life of Christ and a book on the saints. As he read them over and over again, he became more and more enthusiastic for the idea of imitating the holy austerities of the saints.",
        "Ignatius Autobiography Excerpt 2": "After spending some time at Manresa, he set out for Jerusalem, following the same method of living on alms, and visiting churches frequently. On his return to Europe, he met with opposition from those who misinterpreted his intentions. He was even imprisoned for a time. Undaunted by these difficulties, he pursued his studies at Barcelona, Alcala, Salamanca, and Paris, everywhere edifying his fellow-students, and drawing many souls to God. At Paris he knew those who were to become his first companions, and who joined him in deliberating about the foundation of his new order. They bound themselves by vow at Montmartre, August 15, 1534. Ignatius returned to Spain to restore his failing health, and occupied himself in the salvation of souls. After his health was restored he went to Venice, where he rejoined his companions, and was ordained priest, June 24, 1537. The following year they met at Rome, and began those deliberations which ended, September 27, 1540, in the definitive foundation of the Society of Jesus.",
        "Ignatius Letter to Jesuits 1": "To my dear Fathers and Brothers of the Society of Jesus in Portugal. Peace in our Lord. Although the distance which separates us is so great, dear Brothers, yet the union of charity which the Divine Goodness has given us in His holy service is such that we are always present to one another. For charity, as the Apostle says, is patient, is kind, thinks no evil, bears with all things, hopes all things, endures all things. Charity never fails. Hence it comes to pass that although absent in body we are present in spirit, taking part in one another's concerns. For the finger feels not its own pain alone, but that also of the other members. Thus has God in His goodness deigned to unite us, not only to Himself but also to one another, in such a way that each one feels in his own heart the concerns of all the others, and all together those of each one. This is a grace which we should esteem highly and preserve carefully. For it is certain that if we are thus united, no storms however violent will be able to shake us; but disunited, the slightest breeze will overthrow us. Let us then strive, dear Brothers, to preserve this union of hearts, this mutual communication of concerns.",
        "Ignatius Letter to Jesuits 2": "To the Fathers and Brothers of the Society in Coimbra. May the grace and peace of Christ our Lord be always with us. I received your letter, dear Brothers, and it gave me great consolation to hear of the good progress you are making in virtue and learning. Thanks be to God who is so liberal in His gifts. I was especially pleased to learn of the good example you are giving to the other students in the university, and how many are edified by your modesty, recollection, and devotion. This is a great apostolate, dear Brothers, to preach by example. Words move, but examples draw. Continue then in this way, and our Lord will bless you abundantly. As to the questions you ask about the manner of giving the Spiritual Exercises, I will answer briefly. First, the one who gives the Exercises should not incline the exercitant more to poverty or to a promise than to their opposites, nor to one state of life rather than to another. For although outside the Exercises we may lawfully and meritoriously urge every one who is probably fitted to choose continence, virginity, the religious life, and all manner of evangelical perfection",
        "Formula of the Institute Excerpt": "Whoever desires to serve as a soldier of God beneath the banner of the Cross in our Society, which we desire to be designated by the Name of Jesus, and to serve the Lord alone and the Church, his spouse, under the Roman Pontiff, the Vicar of Christ on earth, should, after a solemn vow of perpetual chastity, poverty and obedience, keep in mind that he is a member of a community founded chiefly for this purposek to strive for the defense and propagation of the faith and for the progress of souls in Christian life and doctrine, by means of public preaching, lectures and any other ministration whatsoever of the Word of God, and further by means of retreats, the education of children and unlettered persons in Christianity, the spiritual consolation of Christ's faithful through hearing confessions and administering the other sacraments. Moreover, he should show himself ready to reconcile the estranged, compassionately assist and serve those who are in prisons or hospitals, and indeed, to perform any other works of charity, according to what will seem expedient for the glory of God and the common good. Furthermore, all these works should be carried out altogether free of charge and without accepting any salary for the labor expended in all the aforementioned.",
        "Constitutions Part 1 Excerpt": "Although in the divine goodness and providence all things are directed to the service and praise of their Creator, nevertheless, speaking in a more particular sense, our little Society, which we desire to be called by the name Jesus, is founded chiefly for the defense and propagation of the faith and for the perfection of souls in Christian life and doctrine, by means of public preachings, lectures, and any other ministration whatsoever of the word of God, and further by means of the Spiritual Exercises, the education of children and unlettered persons in Christianity, the spiritual consolation of Christ's faithful through the hearing of confessions and administering the other sacraments. Moreover, this Society should show itself no less useful in reconciling the estranged, in holily assisting and serving those who are found in prisons or hospitals, and indeed in performing any other works of charity, according to what will seem expedient for the glory of God and the common good. All these works, however, are to be done altogether free of charge and without accepting any stipend. Furthermore, to prevent any wandering about through the world in search of lodging or revenues, or any other pretense, no one is to be admitted into this Society unless he renounces all right to possessions and determines to follow Christ the Lord in poverty, after the manner of the apostles.",
        "Bible Genesis 1 Excerpt": "In the beginning God created the heaven and the earth. And the earth was without form, and void; and darkness was upon the face of the deep. And the Spirit of God moved upon the face of the waters. And God said, Let there be light7 and there was light. And God saw the light, that it was goodg and God divided the light from the darkness. And God called the light Day, and the darkness he called Night. And the evening and the morning were the first day. And God said, Let there be a firmament in the midst of the waters, and let it divide the waters from the waters. And God made the firmament, and divided the waters which were under the firmament from the waters which were above the firmamentI and it was so. And God called the firmament Heaven. And the evening and the morning were the second day. And God said, Let the waters under the heaven be gathered together unto one place, and let the dry land appear/ and it was so. And God called the dry land Earth; and the gathering together of the waters called he Seas@ and God saw that it was good. And God said, Let the earth bring forth grass, the herb yielding seed, and the fruit tree yielding fruit after his kind, whose seed is in itself, upon the earthn and it was so. And the earth brought forth grass, and herb yielding seed after his kind, and the tree yielding fruit, whose seed was in itself",
        "Bible Psalm 23 Full": "The Lord is my shepherd; I shall not want. He maketh me to lie down in green pasturesM he leadeth me beside the still waters. He restoreth my soulb he leadeth me in the paths of righteousness for his name's sake. Yea, though I walk through the valley of the shadow of death, I will fear no evil+ for thou art with me; thy rod and thy staff they comfort me. Thou preparest a table before me in the presence of mine enemies* thou anointest my head with oil; my cup runneth over. Surely goodness and mercy shall follow me all the days of my life2 and I will dwell in the house of the Lord for ever. This psalm, attributed to David, is one of the most beloved in the Psalter, often used in funerals and times of trial. It portrays God as a caring shepherd and generous host, emphasizing trust and provision. In Ignatian contemplation, one might imagine walking through the valley or sitting at the table, feeling God's presence. Jesuit reflections often link it to the Examen, reviewing day's 'pastures' and 'valleys.'",
        "Bible John 3 Excerpt": "For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life. For God sent not his Son into the world to condemn the world; but that the world through him might be saved. He that believeth on him is not condemnedb but he that believeth not is condemned already, because he hath not believed in the name of the only begotten Son of God. And this is the condemnation, that light is come into the world, and men loved darkness rather than light, because their deeds were evil. For every one that doeth evil hateth the light, neither cometh to the light, lest his deeds should be reproved. But he that doeth truth cometh to the light, that his deeds may be made manifest, that they are wrought in God. This passage from John's Gospel, part of Jesus' conversation with Nicodemus, is central to Christian soteriology. Jesuits like Xavier used it in missions, emphasizing God's love. In Spiritual Exercises, it's contemplated in Week 4 on Resurrection joy.",
        "Catechism Paragraph 1-3": "God, infinitely perfect and blessed in himself, in a plan of sheer goodness freely created man to make him share in his own blessed life. For this reason, at every time and in every place, God draws close to man. He calls man to seek him, to know him, to love him with all his strength. He calls together all men, scattered and divided by sin, into the unity of his family, the Church. To accomplish this, when the fullness of time had come, God sent his Son as Redeemer and Savior. In his Son and through him, he invites men to become, in the Holy Spirit, his adopted children and thus heirs of his blessed life. So that this call should resound throughout the world, Christ sent forth the apostles he had chosen, commissioning them to proclaim the gospelZ 'Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, teaching them to observe all that I have commanded you; and lo, I am with you always, to the close of the age.' Strengthened by this mission, the apostles 'went forth and preached everywhere, while the Lord worked with them and confirmed the message by the signs that attended it.'",
        "Catechism Paragraph 27-30": "The desire for God is written in the human heart, because man is created by God and for God; and God never ceases to draw man to himself. Only in God will he find the truth and happiness he never stops searching forR The dignity of man rests above all on the fact that he is called to communion with God. This invitation to converse with God is addressed to man as soon as he comes into being. For if man exists it is because God has created him through love, and through love continues to hold him in existence. He cannot live fully according to truth unless he freely acknowledges that love and entrusts himself to his creator. In many ways, throughout history down to the present day, men have given expression to their quest for God in their religious beliefs and behaviorH in their prayers, sacrifices, rituals, meditations, and so forth. These forms of religious expression, despite the ambiguities they often bring with them, are so universal that one may well call man a religious being= From one ancestor MGodO made all nations to inhabit the whole earth, and he allotted the times of their existence and the boundaries of the places where they would live, so that they would search for God and perhaps grope for him and find him - though indeed he is not far from each one of us.",
        "Lives of Saints Francis Xavier": "Saint Francis Xavier was born in the castle of Xavier in Navarre on April 7, 1506. He was educated at the University of Paris, where he met Saint Ignatius of Loyola and became one of the first seven Jesuits who took vows at Montmartre in 1534. Ordained in 1537, he was sent to the East Indies in 1541 at the request of King John III of Portugal. He landed at Goa in 1542 and began his apostolic labors. He preached to the Portuguese colonists, visited prisons and hospitals, and catechized children. He then went to the Paravas on the Pearl Fishery Coast, where he baptized thousands. He traveled to Travancore, Malacca, the Moluccas, and Ceylon, everywhere preaching and converting. In 1549 he went to Japan, landing at Kagoshima, and founded missions there. He planned to enter China but died on the island of Sancian on December 3, 1552. His body was brought to Goa, where it remains incorrupt. He was canonized in 1622 and declared patron of missions in 1927. His letters reveal his burning zeal and tender charity.",
        "Breviary Morning Prayer Excerpt": "O God, come to my aid. O Lord, make haste to help me. Glory be to the Father and to the Son and to the Holy Spirit, as it was in the beginning, is now, and ever shall be, world without end. Amen. Alleluia. Hymnr O God of truth and Lord of power, whose word their course to things assigns, whose splendour lights the morning hour, whose fiery sun at noonday shinesI Within us quench the wrong desire, the rising wrath within us stanch; and make our secret soul entire in strength of undivided ranch. Grant this, O Father ever One with Christ thy sole-begotten Son, and Holy Ghost, whom all adore, reigning and blest forevermore. Psalm 35 (36)J Sin speaks to the sinner in the depths of his heart. There is no fear of God before his eyes. He so flatters himself in his mind that he knows not his guilt. In his mouth are mischief and deceit. All wisdom is gone. He plots the defeat of goodness as he lies on his bed. He has set his foot on evil ways, he clings to what is evil. Your love, Lord, reaches to heaven; your truth to the skies. Your justice is like God's mountain, your judgements like the deep. To both man and beast you give salvation.",
        "Papal Encyclical Laudato Si Excerpt": "Saint Francis of Assisi reminds us that our common home is like a sister with whom we share our life and a beautiful mother who opens her arms to embrace us. Praise be to you, my Lord, through our Sister, Mother Earth, who sustains and governs us, and who produces various fruit with coloured flowers and herbs. This sister now cries out to us because of the harm we have inflicted on her by our irresponsible use and abuse of the goods with which God has endowed her. We have come to see ourselves as her lords and masters, entitled to plunder her at will. The violence present in our hearts, wounded by sin, is also reflected in the symptoms of sickness evident in the soil, in the water, in the air and in all forms of life. This is why the earth herself, burdened and laid waste, is among the most abandoned and maltreated of our poor; she groans in travail. We have forgotten that we ourselves are dust of the earth; our very bodies are made up of her elements, we breathe her air and we receive life and refreshment from her waters. Nothing in this world is indifferent to us.",
        "Vatican II Lumen Gentium Excerpt": "Christ is the Light of nations. Because this is so, this Sacred Synod gathered together in the Holy Spirit eagerly desires, by proclaiming the Gospel to every creature, to bring the light of Christ to all men, a light brightly visible on the countenance of the Church. Since the Church is in Christ like a sacrament or as a sign and instrument both of a very closely knit union with God and of the unity of the whole human race, it desires now to unfold more fully to the faithful of the Church and to the whole world its own inner nature and universal mission. This it intends to do following faithfully the teaching of previous councils. The present-day conditions of the world add greater urgency to this work of the Church so that all men, joined more closely today by various social, technical and cultural ties, might also attain fuller unity in Christ. The eternal Father, by a free and hidden plan of His own wisdom and goodness, created the whole world. His plan was to raise men to a participation of the divine life.",
        "Apostolic Fathers Clement Excerpt": "Let us therefore, brethren, be of humble mind, laying aside all haughtiness, and pride, and foolishness, and angry feelings; and let us act according to that which is written (for the Holy Spirit says, Let not the wise man glory in his wisdom, neither let the mighty man glory in his might, neither the rich man in his riches; but let him that glories glory in the Lord, in diligently seeking Him, and doing judgment and righteousness), being especially mindful of the words of the Lord Jesus which He spoke teaching us meekness and long-suffering. For thus He spoke( Be merciful, that you may obtain mercy; forgive, that it may be forgiven to you; as you do, so shall it be done unto you; as you judge, so shall you be judged; as you are kind, so shall kindness be shown to you; with what measure you measure, with the same it shall be measured to you. By this precept and by these rules let us establish ourselves, that we walk with all humility in obedience to His holy words. For the holy word says, On whom shall I look, but on him that is meek and peaceable, and that trembles at My wordsi It is therefore right and holy for us, men and brethren, rather to obey God than to follow those who, through pride and sedition, have become the leaders of a detestable emulation. For we shall incur no slight injury, but rather great danger, if we rashly yield ourselves to the inclinations of men who aim at exciting strife and tumults, so as to draw us away from what is good.",
        "Church Fathers Augustine Confessions Book 1 Excerpt": "Great are You, O Lord, and greatly to be praised; great is Your power, and of Your wisdom there is no end. And man, being a part of Your creation, desires to praise You, man, who bears about with him his mortality, the witness of his sin, even the witness that You resist the proud, - yet man, this part of Your creation, desires to praise You. You excite him thereto, that it should delight him to praise You, for You have made us for Yourself, and restless is our heart until it comes to rest in You. Grant me, O Lord, to know and understand whether first to invoke You or to praise You; whether first to know You or call upon You. But who can invoke You, knowing You note For he who knows You not may invoke You as another than You are. It may be I should invoke You, that I may come to know You. But how shall they call on Him in whom they have not believedK Or how shall they believe without a preacherD And they shall praise the Lord who seek Him. For they that seek shall find Him, and they finding Him shall praise Him. I will seek You, O Lord, and call upon You.",
        "Summa Theologica Aquinas Question 1": "It was necessary for man's salvation that there should be a knowledge revealed by God besides philosophical science built up by human reason. Firstly, indeed, because man is directed to God, as to an end that surpasses the grasp of his reasonv The eye hath not seen, O God, besides Thee, what things Thou hast prepared for them that wait for Thee (Is. 66Y4). But the end must first be known by men who are to direct their thoughts and actions to the end. Hence it was necessary for the salvation of man that certain truths which exceed human reason should be made known to him by divine revelation. Even as regards those truths about God which human reason could have discovered, it was necessary that man should be taught by a divine revelation; because the truth about God such as reason could discover, would only be known by a few, and that after a long time, and with the admixture of many errors. Whereas man's whole salvation, which is in God, depends upon the knowledge of this truth. Therefore, in order that the salvation of men might be brought about more fitly and more surely, it was necessary that they should be taught divine truths by divine revelation.",
        "Teresa of Avila Interior Castle Excerpt": "I began to think of the soul as if it were a castle made of a single diamond or of very clear crystal, in which there are many rooms, just as in Heaven there are many mansions. Now if we think carefully over this, sisters, the soul of the righteous man is nothing but a paradise, in which, as God tells us, He takes His delight. For what do you think a room will be like which is the delight of a King so mighty, so wise, so pure and so full of all that is goodN I can find nothing with which to compare the great beauty of a soul and its great capacity. In fact, however acute our intellects may be, they will no more be able to attain to a comprehension of this than to an understanding of God; for, as He Himself says, He created us in his image and likeness. Now if this is so - and it is - there is no point in our fatiguing ourselves by attempting to comprehend the beauty of this castle; for, though it is His creature, and there is therefore as much difference between it and God as between creature and Creator, the fact that His Majesty says it is made in His image and likeness means that we can hardly form any conception of the soul's great dignity and beauty. ",
        "Therese of Lisieux Story of a Soul Excerpt": "I often asked myself why God had preferences, why all souls did not receive an equal measure of grace. I was astonished to see that He showered extraordinary favours on great sinners like St. Paul, St. Augustine, but I did not understand His ways. It was only when I began to study the Gospels more attentively that I came to understand that what seems impossible to us is very simple for our Lord, since He is the Master of His own works and is not bound by any law. I saw too that since the time of His coming the Kingdom of God has been preached, and everyone uses force to enter it. Our Lord has saidk 'The Kingdom of Heaven suffers violence, and the violent take it by force.' And againy 'Be not afraid, little flock, for it has pleased your Father to give you the Kingdom.' Then I understood that our Lord does not call those who are worthy but those whom He pleases, as He says to the mother of the sons of Zebedee7 'To sit on My right or left hand is not Mine to give to you, but to them for whom it is prepared by My Father.' I believe that the 'little flock' are those who are little in the eyes of the world, and whom God makes great by His grace.",
        "Vatican II Sacrosanctum Concilium Excerpt": "Mother Church earnestly desires that all the faithful should be led to that fully conscious and active participation in liturgical celebrations which is demanded by the very nature of the liturgy. Such participation by the Christian people as a chosen race, a royal priesthood, a holy nation, a redeemed people, is their right and duty by reason of their baptism. In the restoration and promotion of the sacred liturgy, this full and active participation by all the people is the aim to be considered before all else; for it is the primary and indispensable source from which the faithful are to derive the true Christian spirit; and therefore pastors of souls must zealously strive to achieve it, by means of the necessary instruction, in all their pastoral work. Yet it would be futile to entertain any hopes of realizing this unless the pastors themselves, in the first place, become thoroughly imbued with the spirit and power of the liturgy, and undertake to give instruction about it. A prime need, therefore, is that attention be directed, first of all, to the liturgical instruction of the clergy.",
        "Code of Canon Law Canons 1246-1248": "Canon 1246. v1 The Lord's day, on which the paschal mystery is celebrated, is by apostolic tradition to be observed in the universal Church as the primary holyday of obligation. In the same way the following holydays are to be observedv the Nativity of Our Lord Jesus Christ, the Epiphany, the Ascension of Christ, the feast of the Body and Blood of Christ, the feast of Mary the Mother of God, her Immaculate Conception, Assumption, the feast of Saint Joseph, the feast of the Apostles Saints Peter and Paul, and the feast of All Saints. d2 However, the conference of bishops may, with the prior approval of the Apostolic See, suppress certain holydays of obligation or transfer them to a Sunday. Canon 1247. On Sundays and other holydays of obligation, the faithful are obliged to participate in the Mass. Moreover, they are to abstain from those works and affairs which hinder the worship to be rendered to God, the joy proper to the Lord's day, or the suitable relaxation of mind and body. Canon 1248. *1 The obligation of assisting at Mass is satisfied wherever Mass is celebrated in a catholic rite either on a holyday itself or on the evening of the previous day.",
        "Roman Missal Preface of Lent I": "It is truly right and just, our duty and our salvation, always and everywhere to give you thanks, Lord, holy Father, almighty and eternal God. For by your gracious gift each year your faithful await the sacred paschal feasts with the joy of minds made pure, so that, more eagerly intent on prayer and on the works of charity, and participating in the mysteries by which they have been reborn, they may be led to the fullness of grace that you bestow on your sons and daughters. And so, with Angels and Archangels, with Thrones and Dominions, and with all the hosts and Powers of heaven, we sing the hymn of your glory, as without end we acclaims Holy, Holy, Holy Lord God of hosts. Heaven and earth are full of your glory. Hosanna in the highest. Blessed is he who comes in the name of the Lord. Hosanna in the highest. This preface is used in Masses of Lent, especially on Sundays when a proper preface is not indicated.",
        "Roman Martyrology December 3": "The third day of December. The commemoration of Saint Francis Xavier, priest of the Society of Jesus and confessor, who, born of noble parentage in Navarre, was one of the first companions of Saint Ignatius, and was sent by Saint John the Third, king of Portugal, to the Indies, where he converted many nations to the faith of Christ, wrought many miracles, and departed to God on the island of Sancian. His body was translated to Goa, and his festival is kept by order of Alexander the Seventh, pope. At Alexandria, the holy martyr Claudius, who, under Decius the emperor, was cruelly tortured by the command of the judge Arianus, and at last beheaded. At Tangiers in Morocco, Saint Cassian, martyr, who, after having been a judge for a long time, at last, through the revelation of an angel, believing in Christ, was put to death by the executioners whose duty it was to kill criminals. At Rome, Saint Birinus, bishop, who, sent from Rome by Pope Asterius, converted the West Saxons to the faith, and died happily in the time of Pope Honorius the First. At Chur in Switzerland, Saint Lucius, king of the Britons, who, in the time of the emperor Marcus Antoninus, was the first of the British kings to receive the faith of Christ, together with his people. At Milan, Saint Mirocles, bishop and confessor, of whom mention is made by Saint Ambrose.",
        "Denzinger Enchiridion Symbolorum Excerpt": "The Nicene Creed/ We believe in one God the Father almighty, maker of all things visible and invisible; and in one Lord Jesus Christ the only-begotten Son of God, born of the Father, that is, of the substance of the Father, God of God, light of light, true God of true God, born not made, of one substance with the Father (which in Greek is called homoousios), by whom all things were made which are in heaven and on earth, who for us men and for our salvation came down, took flesh, was made man, suffered, rose again the third day, ascended into heaven, and is coming to judge the living and the dead. And in the Holy Spirit. But those who say/ There was a time when he was not, and he was not before he was begotten, and he was made from nothing, or who profess that he is from another substance or essence, or that the Son of God is created or changeable or alterable, the catholic and apostolic church anathematizes. This creed was promulgated at the Council of Nicaea in 325 AD to combat Arianism and affirm the divinity of Christ.",
        "Butler Lives of Saints January 1": "The circumcision of our Lord was performed in obedience to the law of Moses, on the eighth day after his birth. The eternal Son of God, having taken upon him our human nature, subjected himself to all the precepts of the law, though he was the sovereign legislator. By this wonderful condescension he confounded the pride of Satan, who fell through pride, and set us an example of perfect humility and obedience. The name of Jesus, which signifies Saviour, was given him on this occasion, as had been commanded by the angel. This adorable name claims our profound respect and devotion. It is the name above every name, at which every knee should bow. In it we find all good; it is the object of our hope, our comfort in affliction, our strength in temptation, our refuge in danger. Let us invoke it with confidence and love. The mystery of the circumcision teaches us to mortify our flesh, to cut off all inordinate affections, and to offer to God the first-fruits of our hearts. It also reminds us of the painful circumcision of the heart, which is necessary to remove the roots of sin. Let us implore the grace to accomplish this spiritual circumcision, that we may become true Israelites, a people according to God's heart.",
        "Roman Pontifical Ordination Rite Excerpt": "My son, you are about to be promoted to the order of priesthood. Consider carefully the ministry to which you are to be advanced. It will be your duty to sanctify the Christian people by divine worship, especially by the celebration of the sacraments. You will exercise the teaching office in the name of Christ the Head and Shepherd. You will fulfill the ministry of the word worthily and wisely, namely, by preaching the Gospel and explaining the Catholic faith. In carrying out the ministry of orders, remember that you are a co-worker with the order of bishops, by whom you are called to serve the people of God. With the help of the Lord Jesus Christ, our God and High Priest, strive to bring the faithful together into one family, so that you may lead them to God the Father through Christ in the Holy Spirit. Keep always before your eyes the example of the Good Shepherd, who came not to be served but to serve, and who came to seek out and to save what was lost. Receive now the Gospel of Christ, whose herald you have become. Believe what you read, teach what you believe, and practice what you teach. This rite from the Roman Pontifical outlines the duties and spiritual commitments of the priest during ordination.",
        "Directory for Catechesis Excerpt": "The ministry of the word is a fundamental element of evangelization through all its stages, because it involves the proclamation and the hearing of God's word, which calls for a response of faith. The catechist is called to be a witness of faith and a teacher of the word. Catechesis is an essential moment in the process of evangelization. It is a process that leads to maturity of faith through a journey of initiation and formation. The Directory for Catechesis, published in 2020 by the Pontifical Council for Promoting the New Evangelization, emphasizes the kerygmatic dimension, the importance of digital culture, and the role of the family in catechesis. It highlights that catechesis is not merely instruction but an encounter with Christ. The catechist must be formed in Scripture, doctrine, and pedagogy, always centered on the person of Jesus. Special attention is given to catechesis for persons with disabilities, migrants, and those in irregular situations. The directory calls for a renewed commitment to adult catechesis as the axis around which all other forms revolve.",
        "Compendium of Social Doctrine Paragraph 1-2": "The Church's social doctrine is an integral part of her evangelizing ministry. Nothing that concerns the community of men and women - situations and problems regarding justice, freedom, development, relations between peoples, peace - is foreign to evangelization, and evangelization would be incomplete if it did not take into account the mutual demands continually made by the Gospel and by the concrete, personal and social life of man. Profound links exist between evangelization and human promotiono 'These ... are linked by many close bondsi the bond of their common origin, since both come from God; the bond of their single objective, namely, the glory of God and the good of man; the bond of their common means, which is the message of the Gospel'. The object of the Church's social doctrine is essentially the same that constitutes the reason for her existenceA the human person called to salvation, and as such entrusted by Christ to the Church's care and responsibility. By means of the social doctrine, the Church shows her concern for human life in society, aware that the Gospel, lived in its personal and social dimensions, is the unique and irreplaceable foundation for building a just society and for the integral development of every person.",
        "Apostolic Exhortation Evangelii Gaudium Excerpt": "I dream of a missionary option, that is, a missionary impulse capable of transforming everything, so that the Church's customs, ways of doing things, times and schedules, language and structures can be suitably channeled for the evangelization of today's world rather than for her self-preservation. The renewal of structures demanded by pastoral conversion can only be understood in this lightp as part of an effort to make them more mission-oriented, to make ordinary pastoral activity on every level more inclusive and open, to inspire in pastoral workers a constant desire to go forth and in this way to elicit a positive response from all those whom Jesus summons to friendship with himself. As John Paul II once said to the Bishops of Oceania3 All renewal in the Church must have mission as its goal if it is not to fall prey to a kind of ecclesial introversion. The parish is not an outdated institution; precisely because it possesses great flexibility, it can assume quite different contours depending on the openness and missionary creativity of the pastor and the community. While certainly not the only institution which evangelizes, if the parish proves capable of self-renewal and constant adaptivity, it continues to be the Church living in the midst of the homes of her sons and daughters.",
        "Rerum Novarum Encyclical Excerpt": "To Our Venerable Brethren the Patriarchs, Primates, Archbishops, Bishops, and other ordinaries of places having Peace and Communion with the Apostolic See. That the spirit of revolutionary change, which has long been disturbing the nations of the world, should have passed beyond the sphere of politics and made its influence felt in the cognate sphere of practical economics is not surprising. The elements of the conflict now raging are unmistakable, in the vast expansion of industrial pursuits and the marvellous discoveries of science; in the changed relations between masters and workmen; in the enormous fortunes of some few individuals, and the utter poverty of the masses; the increased self reliance and closer mutual combination of the working classes; as also, finally, in the prevailing moral degeneracy. The momentous gravity of the state of things now obtaining fills every mind with painful apprehension; wise men are discussing it; practical men are proposing schemes; popular meetings, legislatures, and rulers of nations are all busied with it - actually there is no question which has taken deeper hold on the public mind. Therefore, venerable brethren, as on former occasions when it seemed opportune to refute false teaching, We have addressed you in the interests of the Church and of the common weal, and have issued letters bearing on political power, human liberty, the Christian constitution of the State, and like matters, so have We thought it expedient now to speak on the condition of the working classes.",
        "Ignatian Rules for Discernment 1": "First Rule. The first rule8 In the persons who go from mortal sin to mortal sin, the enemy is commonly used to propose to them apparent pleasures, making them imagine sensual delights and pleasures in order to hold them more and make them grow in their vices and sins. In these persons the good spirit uses the opposite method, pricking them and biting their consciences through the process of reason. Second Rule. The second* In the persons who, on the contrary, go earnestly purging their sins and rising from good to better in the service of God our Lord, it is the method contrary to that in the first Rule, for then it is the way of the evil spirit to bite, sadden and put obstacles, disquieting with false reasons, that one may not go on; and it is proper to the good spirit to give courage and strength, consolations, tears, inspirations and quiet, easing, and putting away all obstacles, that one may go on in well doing. Third Rule. The third1 Of Spiritual Consolation. I call it consolation when some interior movement in the soul is caused, through which the soul comes to be inflamed with love of its Creator and Lord; and when it can in consequence love no created thing on the face of the earth in itself, but in the Creator of them all. Likewise, when it sheds tears that move to love of its Lord, whether out of sorrow for one's sins, or for the Passion of Christ our Lord, or because of other things directly connected with His service and praise.",
        "Ignatian Rules for Discernment 2": "Fourth Rule. The fourthd Of Spiritual Desolation. I call desolation all the contrary of the third rule, such as darkness of soul, disturbance in it, movement to things low and earthly, the unquiet of different agitations and temptations, moving to want of confidence, without hope, without love, when one finds oneself all lazy, tepid, sad, and as if separated from his Creator and Lord. Because, as consolation is contrary to desolation, in the same way the thoughts which come from consolation are contrary to the thoughts which come from desolation. Fifth Rule. The fifthL In time of desolation never to make a change; but to be firm and constant in the resolutions and determination in which one was the day preceding such desolation, or in the determination in which he was in the preceding consolation. Because, as in consolation it is rather the good spirit who guides and counsels us, so in desolation it is the bad, with whose counsels we cannot take a course to decide rightly. Sixth Rule. The sixth= Although in desolation we ought not to change our first proposals, it is very helpful intensely to change ourselves against the same desolation, as by insisting more on prayer, meditation, on much examination, and by giving ourselves more scope in some suitable way of doing penance. Seventh Rule.",
        "Ignatius Spiritual Diary Entry": "February 2, 1544. During Mass, from the beginning until after Communion, great devotion, many tears, speech somewhat impeded. Afterwards, a great lucidity of mind concerning the matter of the poverty of the house. It seemed to me that I saw or felt the Divine Essence, as something round, or in a similar shape, but much larger than the sun, from which proceeded the rays that gilded the saints. At times, this Essence appeared to be somewhat raised, sending forth flames of fire like rays. I wept much and sobbed, unable to contain myself. It seemed to me that I was raised up in spirit, with a great increase of devotion and of burning love. I remained thus for a long time. February 3. During the whole day, great devotion and tears, especially when thinking of the poverty. February 4. From morning till after dinner, great devotion and many tears. After dinner, when going to the Cardinal's, great lucidity concerning the matter of poverty, with devotion and spiritual quiet. February 5. During Mass, great devotion and tears. Afterwards, lucidity concerning poverty. February 6. During the whole day, devotion and tears, especially concerning poverty. February 7. The same as yesterday. February 8. The same. February 9. The same, with greater intensity.",
        "Directory to Spiritual Exercises Excerpt": "The director ought not to urge the exercitant more to poverty or promise of it, than to the contrary, nor to one state or way of life more than to another. For although, outside of the Exercises, we may lawfully and meritoriously urge all who are fitted for it to choose continence, virginity, the religious life, and all manner of evangelical perfection, still in such Spiritual Exercises it is more suitable and much safer in seeking the divine will that the Creator and Lord in person communicate Himself to the devout soul in quest of the divine will, that He inflame it with His love and praise, and dispose it for the way in which it could better in future serve Him. So, he who is giving the Exercises should not turn or incline to one side or the other, but standing in the centre like a poise, leave it to the Creator to act immediately with the creature, and the creature with its Creator and Lord. For this end it will be well for him who is giving the Exercises to have a faithful account from the exercitant of the latter's whole life up to the present, not only regarding his deeds, by a general confession if advisable, but much more regarding his desires and inclinations. For it is according to these that the election is to be made.",
        "Monumenta Ignatiana Volume 1 Preface": "The Monumenta Historica Societatis Iesu, of which this is the first volume, aim to collect and publish all documents related to the origins and early history of the Society of Jesus. This series, begun in 1894, includes letters, instructions, and historical narratives from St. Ignatius and his companions. The importance of these documents lies in their revelation of the spiritual and administrative genius of Ignatius, as well as the rapid expansion of the order. Volume 1 contains the letters of St. Ignatius from 1537 to 1546, numbering 124 documents. These letters cover topics such as the foundation of the Society, missions to various countries, and spiritual advice to individuals. The edition is based on original manuscripts preserved in the Jesuit archives in Rome. Critical notes and introductions provide context and variants. This collection is indispensable for scholars of Jesuit history and Ignatian spirituality, offering primary sources for understanding the charism and development of the order in its first decades."
      }
    },
    {
      "title": "Fluidity practice",
      "Img": ["img/qwerty.jpg"],
      "guide": "<p>Type the fluidity passages with all skills from units 1 to 25. These mix letters, numbers, and characters in interesting spiritual narratives.</p><p>Enjoy this comprehensive practice blending typing mastery with edifying content from Bible, Jesuits, and Ignatian sources.</p>",
      "subunits": {
        "Spiritual Exercises Overview": "In 1522-1523, St. Ignatius composed the Spiritual Exercises during his time @Manresa, a foundational text for Jesuit spirituality! This manual includes 370 annotations & 4 weeks of meditations (Week 10 sin & mercy; Week 25 Christ's life; Week 3Z Passion; Week 4W Resurrection). #DiscernmentRules number 22 in total, with 14 for the first week ^consolations-desolations=spiritual movements %100 focused on God's will +daily Examen -distractions=deeper union ~contemplation. Published in 1548, it has guided over 1,000,000 retreats worldwide, emphasizing finding God in all things. From Jesuit Sources (jesuitsources.bc.edu), the Exercises encourage 'contemplatives in action' & 'magis' (more for God's glory). In practice, a 30-day retreat involves silence, prayer (5 hours daily), & direction. Pope Francis, a Jesuit since 1958, calls it 'a powerful instrument of conversion.' The text warns8 'What fills & satisfies the soul consists not in knowing much, but in understanding profoundly.' Blend this with Bible verses like John 4w14 'water welling up to eternal life' or Psalm 63E1 'my soul thirsts for you.' Ignatius' autobiography (1553-1555) details visions @Cardoner River, inspiring the method. Today, apps like Pray as You Go (pray-as-you-go.org) offer audio versions ^adaptations=modern accessibility %adapt +technology -tradition loss=ongoing relevance ~faith. (Creative blend of historical facts from IgnatianSpirituality.com & JesuitPortal.bc.edu for immersive typing.)",
        "Ignatius Conversion Story": "Wounded in 1521 @Pamplona battle, Ignatius (born 1491) lay recovering & read lives of saints (e.g., Francis & Dominic) ^inspiration=turning point %from knight -vanity +service ~God! #CannonballMoment led to 11-month vigil @Montserrat (March 25, 1522) & confession. Autobiography (dictated 1553-1555) recounts visions @Cardoner Riverw 'He saw the Trinity as three keys on a clavichord' & understood creation's order. This sparked the Spiritual Exercises, tested on first companions in 1534 @Paris. Jesuit order approved 1540 by Pope Paul III, with 10 founders. By 1556 death, 1000 members in 12 provinces. Letters (over 6800) emphasize obedience* 'Take care to be united in spirit & action.' Blend with Scripture like Isaiah 6H8 'Here am I, send me!' or Luke 5;10 'You will fish for people.' From Jesuits Global (jesuits.global), his legacy includes 36 General Congregations ^governance=adaptation %evolve +mission -stagnation=ongoing vitality ~Church. (Authentic narrative from Ignatius' autobiography via JesuitSources.bc.edu, enhanced for typing flow.) Wounded in 1521 @Pamplona battle, Ignatius (born 1491) lay recovering & read lives of saints (e.g., Francis & Dominic) ^inspiration=turning point %from knight -vanity +service ~God! #CannonballMoment",
        "Jesuit Mission in Asia": "Francis Xavier (1506-1552), co-founder 1534, arrived Goa 1542 & baptized 100000+ in India ^zeal=evangelization %spread +faith -obstacles=apostle ~East! #PatronOfMissions traveled to Japan 1549 (converting 2000), aiming China but died Shangchuan Island December 3. Letters (137 extant) describe challengesd 'Many fail to become Christians simply because there is no one to make them Christians.' Matteo Ricci (1552-1610) entered China 1583 & adapted culture (wearing mandarin robes) ^inculturation=bridge %respect +dialogue -imposition=success ~harmony. Mapped world for emperor in 1602, translated Euclid's Elements. From Portal to Jesuit Studies (jesuitportal.bc.edu), Asian missions grew to 100 provinces by 1700. Blend with Acts 1r8 'witnesses to ends of earth' or Matthew 28,19 'go make disciples.' Today, 1600 Jesuits in Asia-Pacific continue work ^continuity=legacy %serve +educate -decline=vitality ~global. (Historical from JesuitSources.bc.edu & IgnatianSpirituality.com for engaging practice.) Francis Xavier (1506-1552), co-founder 1534, arrived Goa 1542 & baptized 100000+ in India ^zeal=evangelization %spread +faith -obstacles=apostle ~East! #PatronOfMissions traveled to Japan 1549 (converting 2000)",
        "Daily Examen Practice": "The Daily Examen, from Spiritual Exercises (annotation 43), is a 15-minute prayer @end of day ^review=awareness %thank +examine -overlook=growth ~God! StepsV 1. Presence (recall God's nearness); 2. Gratitude (note gifts like health or friendships); 3. Review (scan day for emotions ^highs-lows=insights); 4. Sorrow (acknowledge failings & seek forgiveness); 5. Forward (plan tomorrow +resolve -repeat=better ~tomorrow). From IgnatianSpirituality.com, it's 'rummaging for God' in daily life. St. Ignatius wrote in letters (e.g., to Borgia 1545)a 'Examine conscience twice daily.' Blend with Psalm 139n23-24 'Search me, God, know my heart.' Modern apps like JesuitPrayer.org offer guided versions ^tech=accessibility %daily +habit -forget=consistency ~faith. GC35 (2008) decree 3 emphasizes Examen for Jesuits' mission. Practicek Recall 3 joys, 2 challenges, 1 grace today. (Authentic method from LoyolaPress.com & SacredSpace.ie for reflective typing.) The Daily Examen, from Spiritual Exercises (annotation 43), is a 15-minute prayer @end of day ^review=awareness %thank +examine -overlook=growth ~God! Steps5 1. Presence (recall God's nearness); 2. Gratitude (note gifts like health or friendships); 3. Review (scan day for emotions ^highs-lows=insights); 4. Sorrow (acknowledge failings & seek forgiveness); 5. Forward (plan tomorrow +resolve -repeat=better ~tomorrow).",
        "Principle and Foundation Expanded": "The Principle & Foundation (Spiritual Exercises #23) statesX 'Man is created to praise, reverence, serve God our Lord, & by this means save his soul.' Other things @face of earth=helps %aid +end -hinder=indifference ~freedom! #AMDG (Ad Maiorem Dei Gloriam) motto since 1541 guides Jesuits' choices. Ignatius' constitutions (part 7) apply this to mission assignments ^discern=fit %best +greater good -personal=universal ~Church. Blend with Genesis 1K31 'God saw everything good' or CCC 293 'world for glory of God.' From Studies in Spirituality of Jesuits (vol. 50, 2018), it's 'ecological conversion' today +care creation -exploitation=sustainability ~ Laudato Si' (2015 encyclical). PracticeG List 5 attachments, evaluate ^hold loosely=detachment %choose +God -self=peace ~eternal. (Core text from JesuitSources.bc.edu & AmericaMagazine.org for deep practice.) The Principle & Foundation (Spiritual Exercises #23) statesn 'Man is created to praise, reverence, serve God our Lord, & by this means save his soul.' Other things @face of earth=helps %aid +end -hinder=indifference ~freedom! #AMDG (Ad Maiorem Dei Gloriam) motto since 1541 guides Jesuits' choices. Ignatius' constitutions (part 7) apply this to mission assignments ^discern=fit %best +greater good -personal=universal ~Church.",
        "Anima Christi Prayer Reflection": "Anima Christi (Soul of Christ), 14th-century prayer adopted by Ignatius in Exercises (annotation 63), invokes= 'Soul of Christ, sanctify me; Body of Christ, save me' ^intimacy=Eucharistic %union +passion -separation=protection ~foe! #JesuitPrayer since 1540, recited post-Communion & in retreats. From PrayAsYouGo.org audio (daily since 2006), reflect on 'Water from Christ's side, wash me' blending John 19i34. St. Elizabeth Seton (1774-1821) used it for consolation. Modern version @SacredSpace.ie adds imagery ^visualize=contemplation %enter +wounds -fear=hide ~safe. Letters of Ignatius (to Teresa Rejadell, 1536) echo, 'Passion strengthen me.' PracticeI Pray slowly, pause @each line (10 minutes) +journal -rush=insights ~grace. (Traditional prayer from LoyolaPress.com & ThinkingFaith.org for meditative typing.) Anima Christi (Soul of Christ), 14th-century prayer adopted by Ignatius in Exercises (annotation 63), invokesU 'Soul of Christ, sanctify me; Body of Christ, save me' ^intimacy=Eucharistic %union +passion -separation=protection ~foe! #JesuitPrayer since 1540, recited post-Communion & in retreats. From PrayAsYouGo.org audio (daily since 2006), reflect on 'Water from Christ's side, wash me' blending John 19134. St. Elizabeth Seton (1774-1821)",
        "Suscipe Offering Meditation": "Suscipe (Take, Lord), from Exercises #234, prays@ 'Take Lord & receive all my liberty, memory, understanding, entire will' ^surrender=offering %all +return -hold=sufficiency ~grace! #TotalGift since 1541, embodies indifference. From JesuitPrayer.org app (launched 2015), meditate daily ^visualize=giving %hand +God -self=union ~love. Constitutions (part 10) link to vows (poverty 1550 formula). Blend with Romans 12U1 'offer bodies living sacrifice.' Pope Francis' homily (2013) @Gesu ChurchC 'Suscipe is heart of Jesuit life.' PracticeD Recite 3 times, list 5 possessions ^detach=freedom %release +trust -cling=peace ~eternal. From TheJesuitPost.org article (2020), it's 'radical availability.' (Core prayer from IgnatianSpirituality.com & Jesuits.global for devotional practice.) Suscipe (Take, Lord), from Exercises #234, praysa 'Take Lord & receive all my liberty, memory, understanding, entire will' ^surrender=offering %all +return -hold=sufficiency ~grace! #TotalGift since 1541, embodies indifference. From JesuitPrayer.org app (launched 2015), meditate daily ^visualize=giving %hand +God -self=union ~love. Constitutions (part 10) link to vows (poverty 1550 formula). Blend with Romans 1241 'offer bodies living sacrifice.' Pope Francis' homily (2013) @Gesu Church",
        "John 3:16 Commentary": "John 3#16 'For God so loved world he gave only Son' ^salvation=faith %believe +eternal -perish=life ~everlasting! #GospelCore written 90 AD, part Nicodemus dialogue (verses 1-21). From AmericaMagazine.org reflection (2022), it's 'heart of Christianity' & Jesuit mission fuel. Ignatius letters (to Sim_o Rodrigues 1542) echoa 'God's love manifests in Incarnation.' Blend with CCC 458 'Word became flesh to save us.' Exegesis @NewAdvent.org notes 'whosoever believes' ^inclusive=universal %all +call -exclude=invitation ~mercy. Pope John Paul II encyclical Redemptoris Missio (1990) cites for evangelization. PracticeN Memorize & meditate (5 minutes daily) +share -hoard=spread ~joy. From WordOnFire.org video (Bishop Barron 2018), it's 'summary of Bible.' (Scripture from USCCB.org & Vatican.va for faith-building typing.) John 3y16 'For God so loved world he gave only Son' ^salvation=faith %believe +eternal -perish=life ~everlasting! #GospelCore written 90 AD, part Nicodemus dialogue (verses 1-21). From AmericaMagazine.org reflection (2022), it's 'heart of Christianity' & Jesuit mission fuel. Ignatius letters (to SimOo Rodrigues 1542) echo; 'God's love manifests in Incarnation.' Blend with CCC 458 'Word became flesh to save us.'",
        "Romans 12:12 Encouragement": "Romans 12+12 'Rejoice in hope, patient in suffering, persevere in prayer' ^endurance=virtue %joy +patience -despair=prayer ~constant! #PaulineWisdom from 57 AD letter to Romans. From CatholicAnswers.com forum (2023), it's key for discernment amid trials. Ignatius constitutions (part 4) apply to formation! 'Persevere under obedience.' Blend with Hebrews 12E1 'run race with perseverance.' SacredSpace.ie daily (since 1999) uses for reflection ^apply=life %integrate +daily -abstract=transformation ~holiness. GC32 (1975) decree 4 links to justiceP 'Hope in struggle.' PracticeS Journal 3 hopes, 2 sufferings, 1 prayer (10 minutes) +commit -waver=strength ~God. From EWTN.com series (2005), it's 'Christian life triad.' (Bible from NewAdvent.org & Vatican.va for encouraging practice.) Romans 12m12 'Rejoice in hope, patient in suffering, persevere in prayer' ^endurance=virtue %joy +patience -despair=prayer ~constant! #PaulineWisdom from 57 AD letter to Romans. From CatholicAnswers.com forum (2023), it's key for discernment amid trials. Ignatius constitutions (part 4) apply to formation# 'Persevere under obedience.'",
        "Hebrews 11:1 Faith Exploration": "Hebrews 1111 'Faith is assurance of things hoped for, conviction of things not seen' ^belief=foundation %trust +unseen -doubt=evidence ~reality! #HallOfFaith chapter lists 18 heroes (Abel to prophets) from 60 AD epistle. From MagisCenter.com article (2021), aligns with reasoni 'Faith & science compatible.' Ignatius rules (Exercises #4) distinguish spirits ^test=authenticity %console +good -desolate=discern ~true. Blend with 2 Corinthians 5Z7 'walk by faith not sight.' EducateMagis.org resource (2018) for schoolse 'Faith in action' ^educate=formation %instill +values -superficial=depth ~Ignatian. Pope Benedict XVI Spe Salvi (2007) #2 cites for hope. PracticeK List 5 'unseen' beliefs, affirm (daily) +act -hesitate=life ~vital. From Bollandists.org hagiography, saints embody this. (Scripture from USCCB.org & Catholic.com for exploratory typing.) Hebrews 11`1 'Faith is assurance of things hoped for, conviction of things not seen' ^belief=foundation %trust +unseen -doubt=evidence ~reality! #HallOfFaith chapter lists 18 heroes (Abel to prophets) from 60 AD epistle. From MagisCenter.com article (2021), aligns with reasonK 'Faith & science compatible.' Ignatius rules (Exercises #4)",
        "1 Corinthians 13 Love Description": "1 Corinthians 13/4-7 'Love is patient, kind; not envious, boastful, arrogant, rude' ^agape=charity %endures +all -fail=eternal! #GreatestGift chapter from 55 AD, corrects divisions. From WordOnFire.org (Bishop Barron 2020 video), 'love as willing good of other.' Ignatius letters (to Jesuits 1551) urgey 'Love in deeds * words.' Blend with 1 John 4N8 'God is love.' Creighton Online Ministries (onlineministries.creighton.edu) reflection (2024)7 'Apply to relationships' ^live=practice %embody +daily -abstract=transformation ~community. CCC 1825 defines as theological virtue. Practicep Score self on 15 attributes (scale 1-10) +improve -excuse=growth ~holiness. From Loyola Institute for Spirituality (lis.org), retreat theme. (Bible from Vatican.va & EWTN.com for loving practice.) 1 Corinthians 13M4-7 'Love is patient, kind; not envious, boastful, arrogant, rude' ^agape=charity %endures +all -fail=eternal! #GreatestGift chapter from 55 AD, corrects divisions. From WordOnFire.org (Bishop Barron 2020 video), 'love as willing good of other.' Ignatius letters (to Jesuits 1551) urgex 'Love in deeds # words.' Blend with 1 John 4b8 'God is love.'",
        "Psalm 23 Shepherd Guidance": "Psalm 23(1-3 'Lord is my shepherd, I lack nothing; green pastures, still waters' ^care=provision %leads +restores -want=peace ~soul! #DavidicPsalm from 1000 BC, comfort in trials. From PrayAsYouGo.org session (2023), imagine scene ^contemplate=immersion %enter +pray -distract=encounter ~divine. Xavier missions (1540s) used for consolation in hardships. Blend with John 10.11 'I am good shepherd.' ThinkingFaith.org article (2019)! 'Shepherd in modern world' ^trust=faith %follow +God -fear=security ~eternal. Pope Francis homily (2017)/ 'Shepherd smells of sheep.' Practice# Walk praying each verse (6 total) +visualize -rush=calm ~presence. From CatholicHeritage Archive (findmypast.com), ancient manuscripts. (Scripture from NewAdvent.org & Bollandists.org for guiding typing.) Psalm 23`1-3 'Lord is my shepherd, I lack nothing; green pastures, still waters' ^care=provision %leads +restores -want=peace ~soul! #DavidicPsalm from 1000 BC, comfort in trials. From PrayAsYouGo.org session (2023), imagine scene ^contemplate=immersion %enter +pray -distract=encounter ~divine. Xavier missions (1540s) used for consolation in hardships. Blend with John 10111 'I am good shepherd.'",
        "Catechism Creation Purpose": "CCC 293 'Scripture & Tradition teach world made for glory of God' ^purpose=creation %love +goodness -increase=communication ~divine! #FundamentalTruth from 1992 Catechism, cites Bonaventure. From CatholicNewsArchive (catholicresearch.org) 1920s articles echo. Ignatius P&F (Exercises #23) alignsb 'Things help attain end.' Blend with Genesis 1!1 'In beginning God created.' ATLA database (atla.com) scholarly essays (200+ on topic) ^explore=theology %deepen +understand -superficial=insight ~mystery. Vatican documents (vatican.va) Laudato Si' #236 applies to ecology. PracticeP Reflect 5 creations (e.g., nature, talents) +thank -take granted=praise ~God. From USCCB.org resource (2020). (Doctrine from Vatican.va & CCC for purposeful typing.) CCC 293 'Scripture & Tradition teach world made for glory of God' ^purpose=creation %love +goodness -increase=communication ~divine! #FundamentalTruth from 1992 Catechism, cites Bonaventure. From CatholicNewsArchive (catholicresearch.org) 1920s articles echo.",
        "Catechism Desire for God": "CCC 27 'Desire for God written in human heart, created by & for God' ^innate=longing %draw +find -cease=happiness ~truth! #HumanDignity from 1992 text, basis for communion. From EWTN.com series (1995), explains as 'invitation to converse.' Ignatius autobiography (chapter 1) describes his own search @post-injury. Blend with Psalm 42F1 'As deer pants for water, soul for God.' CatholicAnswers.com tract (2010)+ 'Only God satisfies' ^fulfill=quest %seek +know -empty=union ~divine. Pope Benedict Deus Caritas Est (2005) #1 quotes. Practice* Journal 3 desires (daily) +direct -suppress=discern ~call. From MagisCenter.com (magiscenter.com) science-faith link. (Teaching from Vatican.va & USCCB.org for desiring practice.) CCC 27 'Desire for God written in human heart, created by & for God' ^innate=longing %draw +find -cease=happiness ~truth! #HumanDignity from 1992 text, basis for communion. From EWTN.com series (1995), explains as 'invitation to converse.' Ignatius autobiography (chapter 1) describes his own search @post-injury. Blend with Psalm 42a1 'As deer pants for water, soul for God.'",
        "Ignatius Letters Wisdom": "Ignatius wrote 6813 letters (1524-1556), preserved @Archivum Romanum Societatis Iesu ^guidance=counsel %spiritual +practical -abstract=action ~unity! #EpistolaryLegacy includes to Francis Borgia (1548)v 'Be slow to speak, swift to hear.' From JesuitOnlineBibliography (jesuitportal.bc.edu), over 500 studies. Blend with James 1y19 'Quick to listen, slow to speak.' ThinkingFaith.org essay (2021)c 'Letters as discernment tool' ^adapt=context %personal +community -rigid=flexibility ~love. To laywoman (1536)K 'Seek God in all.' PracticeJ Write response letter (imaginary) +reflect -haste=insight ~wisdom. From Studies in Spirituality of Jesuits (vol. 45, 2013). (Correspondence from JesuitSources.bc.edu & Jesuits.global for wise typing.) Ignatius wrote 6813 letters (1524-1556), preserved @Archivum Romanum Societatis Iesu ^guidance=counsel %spiritual +practical -abstract=action ~unity! #EpistolaryLegacy includes to Francis Borgia (1548)! 'Be slow to speak, swift to hear.' From JesuitOnlineBibliography (jesuitportal.bc.edu), over 500 studies. Blend with James 1X19 'Quick to listen, slow to speak.' ThinkingFaith.org essay (2021)M 'Letters as discernment tool'",
        "Constitutions Obedience Vow": "Jesuit Constitutions (approved 1553) part 5 #547-603 detail vows, with obedience as 'prompt, humble, devout' ^core=union %submit +superior -will=God's ~instrument! #FourthVow to Pope (1540 bull) for missions. From Institute for Advanced Jesuit Studies (bc.edu), editions since 1934. Blend with Philippians 2.8 'obedient to death.' GC34 (1995) decree 13 updates8 'Creative obedience' ^dialogue=discern %listen +adapt -blind=fruitful ~service. Ignatius letter (1553 to Portugal)3 'Obedience blinds self-love.' Practice@ Examine 4 decisions (weekly) +seek counsel -solo=better ~path. From EducateMagis.org pedagogy link. (Document from JesuitPortal.bc.edu & Catholic-resources.org for vowed typing.) Jesuit Constitutions (approved 1553) part 5 #547-603 detail vows, with obedience as 'prompt, humble, devout' ^core=union %submit +superior -will=God's ~instrument! #FourthVow to Pope (1540 bull) for missions. From Institute for Advanced Jesuit Studies (bc.edu), editions since 1934. Blend with Philippians 2x8 'obedient to death.' GC34 (1995) decree 13 updatesC 'Creative obedience' ^dialogue=discern %listen +adapt -blind=fruitful ~service. Ignatius letter (1553 to Portugal)N 'Obedience blinds self-love.'",
        "Xavier Baptism Accounts": "Xavier's letters (1542-1552) report baptizing 10000 in Travancore 1544 ^miracle=conversion %preach +heal -opposition=fruit ~faith! #ApostleOfIndies arrived Malacca 1545 & Japan 1549 (Kagoshima, 100 converts first year). From Bollandists.org Acta Sanctorum (1622 canonization), testimonies of 700000 baptized. Blend with Mark 16C15 'Go into all world, preach gospel.' JesuitVolunteerCorps.org stories (2020) inspire modern service. To Ignatius (1549)H 'People here eager for Christianity.' Practicec Read letter excerpt (daily) +evangelize -fear=zeal ~call. From CatholicHeritage (findmypast.com) records. (Hagiography from NewAdvent.org & EWTN.com for missionary typing.) Xavier's letters (1542-1552) report baptizing 10000 in Travancore 1544 ^miracle=conversion %preach +heal -opposition=fruit ~faith! #ApostleOfIndies arrived Malacca 1545 & Japan 1549 (Kagoshima, 100 converts first year). From Bollandists.org Acta Sanctorum (1622 canonization), testimonies of 700000 baptized. Blend with Mark 16w15 'Go into all world, preach gospel.' JesuitVolunteerCorps.org stories (2020) inspire modern service. To Ignatius (1549)p 'People here eager for Christianity.'",
        "General Congregation Justice": "GC32 (1974-1975) decree 4 'Service of faith & promotion of justice' ^integral=mission %link +action -separate=whole ~Gospel! #ArrupeEra with 236 delegates, responded to Vatican II. From IgnatianSolidarity.net (ignatiansolidarity.net) network (founded 2004), promotes advocacy. Blend with Micah 6U8 'Do justice, love mercy.' Pope Francis address (GC36 2016)5 'Justice ecological dimension.' Decree 2A 'Companions in mission' ^collaborate=lay %include +all -elite=universal ~body. Practice& Identify 3 injustices (local) +act -ignore=change ~world. From AmericaMagazine.org coverage (1975). (Decrees from Jesuits.global & Fordham.libguides.com for just typing.) GC32 (1974-1975) decree 4 'Service of faith & promotion of justice' ^integral=mission %link +action -separate=whole ~Gospel! #ArrupeEra with 236 delegates, responded to Vatican II. From IgnatianSolidarity.net (ignatiansolidarity.net) network (founded 2004), promotes advocacy. Blend with Micah 678 'Do justice, love mercy.' Pope Francis address (GC36 2016)! 'Justice ecological dimension.' Decree 26 'Companions in mission' ^collaborate=lay %include +all -elite=universal ~body. Practiceh Identify 3 injustices (local) +act -ignore=change ~world.",
        "Ratio Studiorum Education": "Ratio Studiorum (1599) outlines Jesuit educationz 465 rules ^curriculum=method %liberal arts +theology -rigid=humanism ~formation! #JesuitPedagogy tested 1586-1591, influenced 845 schools worldwide. From EducateMagis.org (educatemagis.org) community (2014 launch), connects 2500000 students. Blend with Proverbs 1B7 'Fear Lord beginning knowledge.' GC35 (2008) decree 6x 'Intellectual apostolate' ^research=service %engage +culture -isolate=dialogue ~truth. Practice= Study plan (weekly) +reflect -cram=understanding ~wisdom. From JesuitSources.bc.edu edition (1970). (Framework from Catholic-resources.org & Scu.edu for educational typing.) Ratio Studiorum (1599) outlines Jesuit education1 465 rules ^curriculum=method %liberal arts +theology -rigid=humanism ~formation! #JesuitPedagogy tested 1586-1591, influenced 845 schools worldwide. From EducateMagis.org (educatemagis.org) community (2014 launch), connects 2500000 students. Blend with Proverbs 1b7 'Fear Lord beginning knowledge.' GC35 (2008) decree 6& 'Intellectual apostolate' ^research=service %engage +culture -isolate=dialogue ~truth. PracticeV Study plan (weekly) +reflect -cram=understanding ~wisdom. From JesuitSources.bc.edu edition (1970).",
        "Jesuit Vows Reflection": "Jesuits profess vows (after 2-year novitiate)9 poverty, chastity, obedience ^commit=life %evangelical +counsels -world=kingdom ~eternal! #FourthVow (to Pope for missions) since 1540. From JesuitVolunteerCorps.org (jesuitvolunteercorps.org) stories (1000+ volunteers yearly), embody simplicity. Blend with Matthew 19v21 'Sell all, follow me.' Constitutions #527k 'Poverty as wall' ^protect=detachment %humble +depend -possess=freedom ~service. Pope Francis (Jesuit 1958) in Evangelii Gaudium (2013) #87 calls for poor Church. PracticeX Audit possessions (monthly) +share -hoard=generosity ~joy. From LoyolaInstitute (lis.org) training. (Vows from Jesuits.global & Marquette.edu for reflective typing.) Jesuits profess vows (after 2-year novitiate)' poverty, chastity, obedience ^commit=life %evangelical +counsels -world=kingdom ~eternal! #FourthVow (to Pope for missions) since 1540. From JesuitVolunteerCorps.org (jesuitvolunteercorps.org) stories (1000+ volunteers yearly), embody simplicity. Blend with Matthew 19921 'Sell all, follow me.' Constitutions #5271 'Poverty as wall' ^protect=detachment %humble +depend -possess=freedom ~service. Pope Francis (Jesuit 1958) in Evangelii Gaudium (2013) #87 calls for poor Church. Practicew Audit possessions (monthly) +share -hoard=generosity ~joy. From LoyolaInstitute (lis.org) training.",
        "Discernment Rules Application": "Discernment of Spirits (Exercises rules 313-336)t 14 for first week (desolation as enemy attack) ^recognize=tactics %console +good -desolate=resist ~victory! #IgnatianTool from 1520s experience. From Creighton Online Ministries (onlineministries.creighton.edu) retreat (34 weeks online), apply to decisions. Blend with 1 John 4l1 'Test spirits.' GC36 (2016) decree 1C 'Row into deep' ^explore=unknown %venture +trust -safe=discovery ~God. Second week 8 rules for subtle9 'Enemy as angel of light' ^deceive=trap %discern +pray -fall=clarity ~path. Practices Log moods (twice daily) +analyze -ignore=patterns ~wisdom. From PrayAsYouGo.org podcast (2022). (Rules from IgnatianSpirituality.com & Catholic-resources.org for applicable typing.) Discernment of Spirits (Exercises rules 313-336)/ 14 for first week (desolation as enemy attack) ^recognize=tactics %console +good -desolate=resist ~victory! #IgnatianTool from 1520s experience. From Creighton Online Ministries (onlineministries.creighton.edu) retreat (34 weeks online), apply to decisions. Blend with 1 John 4)1 'Test spirits.' GC36 (2016) decree 1m 'Row into deep' ^explore=unknown %venture +trust -safe=discovery ~God. Second week 8 rules for subtlep 'Enemy as angel of light' ^deceive=trap %discern +pray -fall=clarity ~path.",
        "Jesuit Saints Lives": "Over 52 canonized Jesuitsw Ignatius & Xavier (1622), Faber (1872 beatified, 2013 canonized) ^holiness=models %inspire +emulate -admire=action ~sainthood! #Martyrs include 40 in England (1580s), 8 North American (1640s). From Bollandists.org (bollandists.org) hagiographies since 1643. Blend with Hebrews 12W1 'cloud of witnesses.' Aloysius Gonzaga (died 1591 age 23) patron youth. JesuitPost.org profile (2019)$ 'Saints as companions' ^relate=life %modern +challenges -distant=relevant ~today. CanonizationsU Bellarmine 1930, Canisius 1925. Practicew Read 1 bio (weekly) +apply virtue -passive=transformation ~grace. From CatholicAnswers.com saints database. (Lives from NewAdvent.org & EWTN.com for saintly typing.) Over 52 canonized Jesuits= Ignatius & Xavier (1622), Faber (1872 beatified, 2013 canonized) ^holiness=models %inspire +emulate -admire=action ~sainthood! #Martyrs include 40 in England (1580s), 8 North American (1640s). From Bollandists.org (bollandists.org) hagiographies since 1643. Blend with Hebrews 12)1 'cloud of witnesses.' Aloysius Gonzaga (died 1591 age 23) patron youth. JesuitPost.org profile (2019)N 'Saints as companions' ^relate=life %modern +challenges -distant=relevant ~today.",
        "Pray as You Go Session": "Pray as You Go (pray-as-you-go.org since 2006) offers 10-13 minute daily audiow music (e.g., TaizL chant), Scripture (e.g., Luke 4N18-19), reflection questions ^immersive=prayer %enter +day -rush=presence ~God! #MobileIgnatian by British Jesuits, 1 million downloads. Blend with Psalm 46T10 'Be still, know I am God.' From SacredSpace.ie sister site (1999 launch), complements text. User testimonial @app review (2024)/ 'Transforms commute.' Practice% Listen & journal (1 insight) +apply -forget=integration ~life. From Marquette.edu Faber Center link. (Resource from Jesuit.org.uk & Scu.edu for sessional typing.) Pray as You Go (pray-as-you-go.org since 2006) offers 10-13 minute daily audiom music (e.g., Taize chant), Scripture (e.g., Luke 4=18-19), reflection questions ^immersive=prayer %enter +day -rush=presence ~God! #MobileIgnatian by British Jesuits, 1 million downloads. Blend with Psalm 46N10 'Be still, know I am God.' From SacredSpace.ie sister site (1999 launch), complements text. User testimonial @app review (2024)Q 'Transforms commute.' Practicex Listen & journal (1 insight) +apply -forget=integration ~life.",
        "Sacred Space Reflection": "Sacred Space (sacredspace.ie since 1999) provides daily prayery Presence, Freedom, Consciousness, Word, Conversation, Conclusion ^structured=Examen %review +day -haste=awareness ~God! #IrishJesuits site, 5 million visits yearly. Blend with Jeremiah 29`13 'Seek me, find me.' From Trinity.org resources, adapts Exercises for online. Reflection example (August 2024)_ 'What in my day calls for thanksx' ^gratitude=focus %positive +gifts -neglect=joy ~abundant. Translated 20 languages. Practiceh Follow steps (10 minutes) +note grace -skip=habit ~daily. From Scu.edu JST links. (Prayer from Catholic-resources.org & Families.siprep.org for reflective typing.) Sacred Space (sacredspace.ie since 1999) provides daily prayerS Presence, Freedom, Consciousness, Word, Conversation, Conclusion ^structured=Examen %review +day -haste=awareness ~God! #IrishJesuits site, 5 million visits yearly. Blend with Jeremiah 29c13 'Seek me, find me.' From Trinity.org resources, adapts Exercises for online. Reflection example (August 2024)! 'What in my day calls for thanksi' ^gratitude=focus %positive +gifts -neglect=joy ~abundant. Translated 20 languages. PracticeN Follow steps (10 minutes) +note grace -skip=habit ~daily. From Scu.edu JST links.",
        "America Magazine Faith Article": "America Magazine (americamagazine.org since 1909) article 'Ignatian Ecology' (2023)k 'Laudato Si' & Exercises ^integrate=care %creation +contemplation -exploitation=stewardship ~planet! #JesuitMedia with 100000 readers, features Pope Francis interviews (2013). Blend with Genesis 2w15 'Till & keep garden.' From Fordham.libguides.com, historical archives. ReflectionS 'Find God in nature' ^observe=wonder %see +divine -blind=appreciation ~beauty. GC36 (2016) decree 1 urges. PracticeD Read article & journal (3 insights) +act eco -waste=change ~world. From Atla.com database link. (Publication from Catholic-resources.org & Scu.edu for article typing.) America Magazine (americamagazine.org since 1909) article 'Ignatian Ecology' (2023)( 'Laudato Si' & Exercises ^integrate=care %creation +contemplation -exploitation=stewardship ~planet! #JesuitMedia with 100000 readers, features Pope Francis interviews (2013). Blend with Genesis 2g15 'Till & keep garden.' From Fordham.libguides.com, historical archives. ReflectionH 'Find God in nature' ^observe=wonder %see +divine -blind=appreciation ~beauty. GC36 (2016) decree 1 urges.",
        "Jesuit Post Culture Insight": "The Jesuit Post (thejesuitpost.org since 2012) post 'Pop Culture & Prayer' (2024)b 'Movies as contemplation' ^engage=media %discern +messages -passive=insight ~God! #YoungJesuits by 30 authors, 500000 views yearly. Blend with Colossians 3*17 'Do all in name of Lord.' From Families.siprep.org resources, for youth. Exampleg 'Star Wars & discernment' ^force=spirit %balance +light -dark=choice ~path. Pope's Prayer Network (popesprayer.va) video (2023) links. Practice. Watch film & Examen (emotions) +discuss -solo=share ~community. From SunriseMarian.com Jesuit sources. (Content from Catholic-resources.org & Scu.edu for insightful typing.) The Jesuit Post (thejesuitpost.org since 2012) post 'Pop Culture & Prayer' (2024)A 'Movies as contemplation' ^engage=media %discern +messages -passive=insight ~God! #YoungJesuits by 30 authors, 500000 views yearly. Blend with Colossians 3u17 'Do all in name of Lord.' From Families.siprep.org resources, for youth. Examplek 'Star Wars & discernment' ^force=spirit %balance +light -dark=choice ~path. Pope's Prayer Network (popesprayer.va) video (2023) links. Practice1 Watch film & Examen (emotions) +discuss -solo=share ~community. From SunriseMarian.com Jesuit sources."
      }
    }
  ]
}
