{
  "main": [
    {
      "title": "asdf jkl;",
      "Img": ["img/home-keys-position.jpg"],
      "guide": "<p>All the eight fingers except the thumbs should be placed on the home row. This is done by placing the left forefinger on F and the right forefinger on J. Place the remaining fingers on the keys beside them in a natural manner. So, the left little finger would be on A and the right little finger would be on the ; (semicolon) key. Use the right little finger to remove an error with ← key.</p><p>To type any key, press the key with the finger over it. Use one of the thumbs to press the space bar. Keep your eyes on the screen as you type. Do not look at the keyboard.</p><p>Proceed to the next lesson only when you can type with 2% or less errors and atleast 20 words/minute (WPM). Accuracy is more important than speed for a beginner.</p><p>Note:</p><p>With one hour practice every day, you can master typing in two weeks(up to Unit 15)! One more week for mastering numbers(up to Unit 21). The rest is for full keyboard mastery.</p>",
      "subunits": {
        "Grip": "asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj fdsa jkl; fdsa jkl; fdsa jkl; fdsa jkl; fdsa jkl; asdf fdsa ;lkj jkl; asdf fdsa ;lkj jkl; asdf jkl; ;lkj fdsa asdf jkl; ;lkj fdsa ksl; jak; fk;s asl; jas; ;sl; fjas fjk; askl kjf; asdj ;fal dfla ;;ls ;ja; l;ds",
        "Words": "a a a; as as as; all all all; fall fall fall; lad lad lad; dad dad dad; fad fad fad; ass ass ass; salad salad salad; alfalfa alfalfa alfalfa; sa sa sa; add add add;",
        "Control": "d da dad; a al alf alfa alfal alfalf alfalfa; f fa fad; s sa sal sala salad; a al all; a as ass; f fa fal fall;",
        "Sentences": "ask sall; ask sall; ask sall; a lad asks sall; a lad asks sall; a lad asks sall; ask dad; ask dad; ask dad; all lads fall; all lads fall; all lads fall;",
        "Test": "as all alfalfa; lad salad lad all dad; lad sall a ask; sall salad alfalfa; ask dad fad lad; all as a; dad fad alfalfa ass salad all as a dad; a lad asks sall; ask sall; ask dad; all lads fall;"
      }
    },
    {
      "title": "ru",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type R and the right one to type U. After striking the R or U keys, return the forefingers back to the original position on F or J.</p>",
      "subunits": {
        "Grip": "frfr juju frfr juju frfr juju; rfrf ujuj rfrf ujuj rfrf ujuj; jrjr fufu jrjr fufu jrjr fufu; rjrj ufuf rjrj ufuf rjrj ufuf; asdfr ;lkju asdfr ;lkju asdfr ;lkju rfdsa ujkl; rfdsa ujkl; rfdsa ujkl; asdfr ujkl; asdfr ujkl; asdfr ujkl; asdfr rfdsa ;lkju ujkl; asdfr rfdsa asdfr ujkl; ;lkju rfdsa asdfr ujkl; urfu ujku rfur luru rjur arru ursr druj drur arsufr frrur jurru urrsu uusrr drlursu uslru frsusl arfu jfru",
        "Words": "far far far; fur fur fur; rar rar rar; lark lark lark; radar radar radar; surf surf surf; dull dull dull; urdu urdu urdu; full full full; rural rural rural; us us us; usual usual usual; laura laura laura; russ russ russ;",
        "Control": "s su sur surf; r ra rad rada radar; f fu ful full; f fu fur; l la lar lark; u ur urd urdu; f fu fur; l la lau laur laura; f fa far; r ru rur rura rural;",
        "Sentences": "laura surfs as usual; laura surfs as usual; laura surfs as usual; ask russ; ask russ; ask russ;",
        "Test": "radar rural laura russ fur lark rar surf; far usual russ full lark laura dull; laura surfs as usual; ask russ;"
      }
    },
    {
      "title": "vm",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type V and the right one to type M.</p>",
      "subunits": {
        "Grip": "fvfv jmjm fvfv jmjm fvfv jmjm; vfvf mjmj vfvf mjmj vfvf mjmj; jvjv fmfm jvjv fmfm jvjv fmfm; vjvj mfmf vjvj mfmf vjvj mfmf; fvrm jmuv fvrm jmuv fvrm jmuv; asdfv ;lkjm asdfrv ;lkjum asdfvr ;lkjmu avrm mvum mmvm mvlv vvmuv vrmv vmrlm svmvmk avsm rvasm svlmr svmvr dvmkv kmvlv rvlmv amvvm vvma mvmm",
        "Words": "madam madam madam; lava lava lava; malva malva malva; slam slam slam; mars mars mars; mask mask mask; uv uv uv; murmur murmur murmur; slum slum slum; mark mark mark; vasu vasu vasu; larva larva larva; dam dam dam; sam sam sam; vum vum vum; arm arm arm; mall mall mall; alarm alarm alarm;",
        "Control": "m ma mad mada madam; l la lav lava; m ma mas mask; m mu mur mur murm murmu murmur; v va vas vasu; l la lar larv larva; d da dam; v vu vum; u uv; m ma mar mars; s sl sla slam; a al ala alar alarm;",
        "Sentences": "madam murmurs; madam murmurs; madam murmurs; a mad vassal murmurs; a mad vassal murmurs; a mad vassal murmurs; mark all vassals; mark all vassals; mark all vassals;",
        "Test": "madam lava slum slam mask vasu sam alarm vum uv; mall alarm arm larva adam malva vum vasu mask; madam murmurs; a mad vassal murmurs; mark all vassals;"
      }
    },
    {
      "title": "ei",
      "Img": ["img/middlefingers.jpg"],
      "guide": "<p>Use the left middle finger to type E and the right one to type I.</p>",
      "subunits": {
        "Grip": "dede kiki dede kiki dede kiki; eded ikik eded ikik eded ikik; fefe jiji fefe jiji fefe jiji; efef ijij efef ijij efef ijij; deki iked deki iked deki iked; ekid dike ekid dike ekid dike; idek kedi idek kedi idek iked; aeds fers iukj iuea ediu edil; aeiru iuerr juiee ireel aerij afeei iieei eeeii eieie; iesdi sdiei aidef lijue iuefr ifese eikis iaser uieie;",
        "Words": "fire fire fire; field field field; are are are; riddle riddle riddle; killer killer killer; is is is; file file file; rise rise rise; side side side; read seed feed leave veal seal visa veer smear; lime slime dime vide save vase live vile ride free; smile simile familiar similar mere merrier",
        "Control": "r ri rid ridd riddl riddle; k ki kil kill kille killer; s si sim simi simil simile; f fi fie fiel field; f fa fam fami famil famili familia familiar; v vi vil vile; l li liv live; s sm sme smea smear; l li lime lime; s sm smi smil smile; i is; a ar are;",
        "Sentences": "mike is a serial killer; mike is a serial killer; mike is a serial killer; dave is a skilled riddler; dave is a skilled riddler; dave is a skilled riddler; sam served a meal; see a fire drill; jim feeds a deer;",
        "Test": "fire field are riddle killer is file rise side read; rise side visa live dime vide ride vile smile familiar; slime skilled similar drill simile serial is see are; mike is a serial killer; dave is a skilled riddler; sam served a meal; see a fire drill; jim feeds a deer;"
      }
    },
    {
      "title": "c,",
      "Img": ["img/middlefingers.jpg"],
      "guide": "<p>Use the left middle finger to type C and the right one to type , (comma).</p>",
      "subunits": {
        "Grip": "dcdc k,k, dcdc k,k, dcdc k,k, cdcd ,k,k cdcd ,k,k cdcd ,k,k fcfc j,j, fcfc j,j, fcfc j,j, cfcf ,j,j cfcf ,j,j cfcf ,j,j dck, ,kcd dck, ,kcd dck, ,kcd ck,d d,kc ck,d d,kc ck,d d,kc ,dck kcd, ,dck kcd, ,dck ,kcd ,,cc cc,, c,c, ,c,c ,ic, c,ac, c,r;c ac;,; s,c;fd a,cd, ;,,cv vc,a; cv,sk; ;l,vdj vcm, ,mdc cvi, ;i,c m,fc ec;,",
        "Words": "receive, circus, circle, maverick, class, mice; ice; fulcrum, care, cure, cafe, face, lace, race, claim; card, lack, service, car, camera, recursive, recess; cease, civil, camel, cave, cake, case, decade, crack;",
        "Control": "m ma mav mave maver maveri maveric maverick, f fu ful fulc fulcr fulcru fulcrum, m mi mic mice, r re rec rece recei receiv receive, c ca cas case, c ci cir circ circu circus, r re rec rece reces recess, c ce cea ceas cease, c ca cam came camer camera, r re rec recu recur recurs recursi recursiv recursive",
        "Sentences": "cecilia received a mail, carr likes camels, use a camera, calla kills mice, use a fulcrum, callula cured carlie",
        "Test": "maverick, fulcrum, cecilia, camera, recursive, camels, mice, lace, race, case, face, cave, civil, care, lace, claim, decade, cecilia received a mail, use a camera, calla kills mice, use a fulcrum, carr likes camels"
      }
    },
    {
      "title": "gh",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type G and the right one to type H. After striking the G or H keys, return the forefingers back to the original position on F or J.</p>",
      "subunits": {
        "Grip": "fgfg jhjh fgfg jhjh fgfg jhjh; gfgf hjhj gfgf hjhj gfgf hjhj; fhfh gjgj fhfh gjgj fhfh gjgj; hfhf jgjg hfhf jgjg hfhf jgjg; asdfg ;lkjh asdfg ;lkjh asdfg ;lkjh asdfg ;lkh;gfdsa hjkl; gfdsa hjkl; gfdsa hjkl; gfdsa hjkl; arhg, igdh, ikhvg, lcvhg, mgcfm, ehcgm, lhsgh, uhrgh; igghs, ghmvh, hchga, guehg, lchhg, ghcih, gilgh;",
        "Words": "hacker, cage, hair, jaguar, his, her, he, she, hire, shag, girl, egg, guru, greek, hum, ham, gum, drug, hug, giggle, hush, garage, aggressive, high, sigh, grave, glacier, heal, him, hide, guide, has, had, have, hear, here, flag, give, glad, shell, march",
        "Control": "g gi gig gigg giggl giggle, h hu hus hush, e eg egg, a ag agg aggr aggre aggre aggres aggress aggressi aggressiv aggressive, g gu gui guid guide, s sh she, h hi hig high, s si sig sigh, s sh sha shag, h he, s sh she, g gi giv give, g ga gar gara garag garage",
        "Sentences": "she cracked five eggs, he likes half egg, she used drugs, gerard is a hacker, she has a hammer, he is aggressive, he hid himself here, guide him, he sighed, give me a high five",
        "Test": "hacker, jaguar, hire, shag, guru, garage, aggressive, he, she, his, her, him, hide, guide, egg, shell, sigh, high, she cracked five eggs, he likes half egg, he sighed, she has a hammer, he is aggressive, give me a high five"
      }
    },
    {
      "title": "ty",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type T and the right one to type Y.</p>",
      "subunits": {
        "Grip": "ftft jyjy ftft jyjy ftft jyjy; tftf yjyj tftf yjyj tftf yjyj; fyfy tjtj fyfy tjtj fyfy tjtj; yfyf jtjt yfyf jtjt yfyf jtjt; ertyui iuytre ertyui iuytre ertyui iuytre; asdft ;lkjy asdfy ;lkjt aedtf ;ikyj adert ;kiuy afty ;jyt tety yjkt lyjt gyht athy sytg lhyg shdt svtm ctym vtyy, ,gytyv crttys sctyt l;tiy, kyhat sytay sytty lttys yytym mtyty syght ymtsy yctvy lytvy ;mtcvy sytaty",
        "Words": "harry, tight, light, very, merry, dry, height, try; sight, might, fry, cry, family, sally, mathematics; chemistry, fight, tyre, yell, the, there, this, them; jury, hay, heavy, lyre, tram, yacht, tuesday; thursday, friday, saturday, target, hit, fit, tackle; sky, year, thirsty, yet, may, july, august",
        "Control": "t th thi thir thirs thirst thirsty, c ch che chem chemi chemis chemist chemistr chemistry, t tu tue tues tuesd tuesda tuesday, t th thi this, t th the ther there, t th the them, t ty tyr tyre, m ma mat math mathe mathem mathema mathemat mathemati mathematic mathematics",
        "Sentences": "harry studied mathematics yesterday, this is the tyre, sally likes chemistry, he hit them, let us fit it, hit the target accurately, let us catch the tram, matt has a yacht, she yelled at him, the teachers met everyday, this is my yacht",
        "Test": "harry, tight, light, merry, try, chemistry, tyre, yacht; tuesday, thursday, saturday, thirsty, year, hay, yet; the, this, there, them, thus; this is the tyre, harry studied mathematics yesterday, he hit them, this is my yacht, the teachers met everyday"
      }
    },
    {
      "title": "bn",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type B and the right one to type N.</p>",
      "subunits": {
        "Grip": "fbfb jnjn fbfb jnjn fbfb jnjn; bfbf njnj bfbf njnj bfbf njnj; fnfn bjbj fnfn bjbj fnfn bjbj; nfnf jbjb nfnf jbjb nfnf jbjb; cvbnm, ,mnbvc cvbnm, ,mnbvc cvbnm, ,mnbvc; asdfb ;lkjn asdfn ;lkjb aedbf ;iknj aderb ;kiun afbn ;jnb bebn njkb lnjb gnhb abhn snbg lhng shdb svbm mhnb ,ibmn senbm nbmvn tnvnm dvln; lsvnm avnsm lsvne",
        "Words": "bean, bin, night, nifty, nibble, scrabble, be, best; banana, january, february, june, band, land, bind; december, sunday, blind, bend, abundance, benign; minimal, begin, bank, savant, urban, nebula, science",
        "Control": "a ab abu abun abund abunda abundan abundanc abundance, n ne neb nebu nebul nebula, b ba ban bana banan banana, b bl bli blin blind, b be beg begi begin, b bi bin, b be ben beni benig benign, b be ben bend",
        "Sentences": "nine blind men sat beside the bank, bill ate a banana, this city receives abundant rainfall in january, let us see a diffused nebula at night, crab nebula can be seen in tauras at night",
        "Test": "nine, men, nebula, remarkable, saturn, blind, benign, banana, bill, minimal, bank, night, bend, bean, bin, nine blind men sat beside the bank, crab nebula can be seen in tauras at night, this city receives abundant rainfall in january"
      }
    },
    {
      "title": "wo",
      "Img": ["img/ringfingers.jpg"],
      "guide": "<p>Use the left ring finger to type W and the right one to type O.</p>",
      "subunits": {
        "Grip": "swsw lolo swsw lolo swsw lolo; wsws olol wsws olol wsws olol; fwfw jojo fwfw jojo fwfw jojo; wfwf ojoj wfwf ojoj wfwf ojoj; swlo olws swlo olws swlo olws; wlos solw wlos solw wlos solw; oswl lwso oswl lwso oswl olws; awss fwrs oulj ouwa wsou wsol;",
        "Words": "what who why when which whom, wheel wind, good moot, sworn sow saw soot loot, war won welcome office will, world worse vow word, biology economics sociology, would whole sword wolf worm, now how orwelian work, owe onus new dew stew too to, weblog wobble womble, you we, monday wednesday, october november, wonder",
        "Control": "w we wel welc welco welcom welcome, w wo wor work, o or orw orwe orwel orweli orwelia orwelian, h ho how, w wh who whol whole, w we web webl weblo weblog, s so soc soci socio sociol sociolo sociolog sociology, s sw swo swor sword, w wh who whom",
        "Sentences": "do not introduce orwellian notions into this work, work for the good of the world, will you come to office tomorrow, how many swords do you have, do you know the new seven wonders of the world",
        "Test": "who how word world wonder would whole sword wolf worm, orwellian work owe weblog wobble womble wonder tomorrow, shower mower lower, will you come to office tomorrow, use the lawn mower, work for the good of the world, how many swords do you have"
      }
    },
    {
      "title": "x.",
      "Img": ["img/ringfingers.jpg"],
      "guide": "<p>Use the left ring finger to type X and the right one to type . (dot).</p>",
      "subunits": {
        "Grip": "sxsx l.l. sxsx l.l. sxsx l.l.; xsxs .l.l xsxs .l.l xsxs .l.l; fxfx j.j. fxfx j.j. fxfx j.j.; xfxf .j.j xfxf .j.j xfxf .j.j; sxl. .lxs sxl. .lxs sxl. .lxs; xl.s s.lx xl.s s.lx xl.s s.lx; .sxl lxs. .sxl lxs. .sxl .lxs; axss fxrs .ulj .uxa xs.u xs.l;",
        "Words": "axe axiom. latex maximum. axial exile. axion borax; codex excel. six. mix xenon. toxin tax. linux unix; hoax fax. fox reflex. wax extra. xerox fedex. ox text; exist exit. exert helix. galaxy hexadecimal. maxim tex; next relax. texas exam. exclude lexical;",
        "Control": "a ax axi axio axiom. x xe xen xeno xenon. s si six. e ex ext extr extra. g ga gal gala galax galaxy. h he hex hexa hexad hexade hexadec hexadeci hexadecim hexadecima hexadecimal. t te tex texa texas. b bo box. f fe fed fede fedex. t ta tax.",
        "Sentences": "there is a lexical analysis examination tomorrow. each dot is written as six hexadecimal digits. alex has six axes and sixteen oxen. the next exam is on number theory axioms.",
        "Test": "axe axiom exam exclude text next ox linux fedex alex. tax relax fedex texas exclude lexical maximum linux. there is a lexical analysis examination tomorrow. each dot is written as six hexadecimal digits."
      }
    },
    {
      "title": "qp",
      "Img": ["img/littlefingers.jpg"],
      "guide": "<p>Use the left little finger to type Q and the right one to type P.</p>",
      "subunits": {
        "Grip": "aqaq opop aqaq opop aqaq opop. qaqa popo qaqa popo qaqa popo, fqfq jpjp fqfq jpjp fqfq jpjp; qfqf pjpj qfqf pjpj qfqf pjpj. aqop poqa aqop poqa aqop poqa, qopa apoq qopa apoq qopa apoq; paqo oqap paqo oqap paqo poqa. aqaa fqra puoj puqa qapu qapo.",
        "Words": "quick qwerty qualm qualify play phone people pupil. queen equip equiprobable quakeproof quilt pique qed. period quasi quantum queue lap paint expert equator. pen pencil pin quote quadruple paddle quirky prince. pint quart prime september quit whip plate piano page.",
        "Control": "q qu qui quic quick, p pe peri perio period, q qe qed. q qu qua quak quake quakep quakep quakepr quakepro quakeproo quakeproof, p pi piq piqu pique, p pe pen. q qu qua quad quadr quadru quadrup quadrupl quadruple, e eq equ equi equip.",
        "Sentences": "both events are equally probable. peter is a professor. procure the appropriate equipment. it is quakeproof. richard p. feynman is an expert in quantum physics. there are two cups in a pint and two pints in a quart. do not ask personal questions.",
        "Test": "qualify quality quantity plaque plate pique equip qed. both events are equally probable. it is quakeproof. there are two cups in a pint and two pints in a quart. procure the appropriate equipment."
      }
    },
    {
      "title": "z/",
      "Img": ["img/littlefingers.jpg"],
      "guide": "<p>Use the left little finger to type Z and the right one to type / (slash).</p>",
      "subunits": {
        "Grip": "azaz o/o/ azaz o/o/ azaz o/o/. zaza /o/o zaza /o/o zaza /o/o, fzfz j/j/ fzfz j/j/ fzfz j/j/; zfzf /j/j zfzf /j/j zfzf /j/j. azo/ /oza azo/ /oza azo/ /oza, zo/a a/oz zo/a a/oz zo/a a/oz; /azo oza/ /azo oza/ /azo /oza. azaa fzra /uoj /uza za/u za/o.",
        "Words": "jazz wizard lazy / ooze zeal quiz / ablaze bazar buzz / czar cozy dozen / dazzle enzyme gaze / maze size zeta / zigzag zoo zinc / zoom fizz puzzle / nozzle pizza zip / zero zioty zit / zone seize doze / ozone frieze frizz / maximize minimize organize / realize prize quantize /",
        "Control": "z zi zig zigz zigza zigzag / p pi piz pizz pizza / n no noz nozz nozzl nozzle / o oz ozo ozon ozone / m ma max maxi maxim maximi maximiz maximize / o or org orga organ organi organiz organize / c cz cza czar / z zi zin zinc / f fi fiz fizz",
        "Sentences": "a zephyr client called tzc is available for gnu/linux / we should minimize pollution to save the ozone layer / pizzeria is a shop where pizzas are made and sold / we have ordered a dozen pizzas for the quiz participants",
        "Test": "zigzag, nozzle, minimize, maximize, fizz, zinc, czar, pizza, zoo, boy/girl, single/married, m/f, gnu/linux, we should minimize pollution to save the ozone layer, we have ordered a dozen pizzas for the quiz participants"
      }
    },
    {
      "title": "'",
      "Img": ["img/littlefingers.jpg"],
      "guide": "<p>Use the right little finger to type ' (single quotation mark).</p>",
      "subunits": {
        "Grip": "'cla 'mai 'lsi 'kji 'mne 'uyz 'oxb 'gar 'vmn 'xzl 'ovc js'a pa'u do'a uy'b si'n ym'l pj's yn's wv'u ug'x tn'p ymo' aqo' wqp' pws' wip' yts' irm' ika' lkw' lrx' oip' fj'a mi's n'hs la'i w'by si'b 'ivk 'd'p '//' ''p/ ap/' 'pa/ 'ox/ /aq' 'ixr ;';' ';p/ a';q rpx' g;x' b'y; e/d'",
        "Words": "we're you're, he's, she's, it's, they're; isn't wasn't; we'd, you'd, he'd, she'd, they'd; can't couldn't; you'll, he'll, she'll, they'll; here's there's; aren't, weren't; what's where's; don't, didn't;",
        "Control": "w we we' we'r we're, y yo you you' you'r you're, y yo you you' you'l you'll, s sh she she' she'l she'll, i is isn isn' isn't, h he he' he'l he'll",
        "Sentences": "it's raining. i don't read jack's blogs. he'll come now. mumbai isn't the capital of india. don't shout here. that's the book we need to learn bernoulli's principle. hilbert's paradox of the grand hotel deals with infinity.",
        "Test": "we're you're she'll he'll isn't don't didn't can't i don't read jack's blogs. don't shout here. that's the book we need to learn bernoulli's principle. hilbert's paradox of the grand hotel deals with infinity."
      }
    },
    {
      "title": "Shift",
      "Img": ["img/littlefingers.jpg"],
      "guide": "<p>Press the shift key with the little finger. To type a capital letter, first press and hold the shift key with one hand, hit the letter with the appropriate finger of the other hand and then release the shift key.</p><p>Do not hit the shift key and the letter key with fingers of the same hand. Before hitting the letter think which hand will be used to type the letter. Use the alternate hand to hold the shift key and then type the letter. This will will require some effort in the beginning. You will gain speed as you practice this unit.</p><p>For example, to type F, first press and hold the right shift key with the right little finger, hit the F key with left forefinger and then release the shift key. After this return both the fingers immediately to the home row.</p><p></p>",
      "subunits": {
        "Grip": "aAbB cCdD eEfF gGhH aAbB cCdD eEfF gGhH; iIjJ kKlL mMnN oOpP iIjJ kKlL mMnN oOpP; qQrR sStT uUvV wWxX qQrR sStT uUvV wWxX; yYzZ yYzZ QWERT YUIOP; ASDFG LKJH; ZXCVB MN; ABCD EFGH ABCD EFGH IJKL MNOP IJKL MNOP; QRST UVWX QRST UVWX YZ YZ; UxWm YwnF VpAs BiKv CoGl DbJc QeZr HkXy LpOq EuzT MfNg RhjS tIBd",
        "Words": "January February March April May June July August September October November December, USA UAE India UK Sri Lanka Egypt, New Delhi New York Moscow Brisbane Donald E. Knuth, Dennis M. Ritchie, S. Ramanujan",
        "Control": "U US USA, U UA UAE, U UK, M Ma Mar Marc Marc March, D Do Don Dona Donal Donald Donald, I In Ind Indi India, O Oc Oct Octo Octob Octobe October, E Eg Egy Egyp Egypt, M Mo Mos Mosc Mosco Moscow",
        "Sentences": "New Delhi is the capital of India. I am intelligent. You should finish the work by June. I love music. Dennis M. Ritchie developed the C programming language. TeX was developed by Donald E. Knuth.GNU/Linux is a free and open source operating system.",
        "Test": "USA UK UAE March India ZIP PIN SSL SSN PAN GNU/Linux Donald E. Knuth, Dennis M. Ritchie, Richard Stallman, I love music. New Delhi is the capital of India. Dennis M. Ritchie developed the C programming language. TeX was developed by Donald E. Knuth."
      }
    },
    {
      "title": "Practice Passages",
      "guide": "<p>Type the practice passages with the correct fingers as practiced in the previous units. Type at least five passages before moving to next unit.</p>",
      "subunits": {
        "Vedanta": "Maya is a statement of the fact of this universe, of how it is going on. People generally get frightened when these things are told to them. But bold we must be. Hiding facts is not the way to remedy.",
        "Hyperspace": "To Riemann, Euclid's geometry was particularly sterile when compared with the rich diversity of the world. Nowhere in the natural world do we see the flat, idealized geometric figures of Euclid. Mountain ranges, ocean waves, clouds, and whirlpools are not perfect circles, triangles, and squares, but are curved objects that bend and twist in infinite diversity.",
        "On Painting": "The first thing to know is that a point is a sign which one might say is not divisible into parts. I call a sign anything which exists on a surface so that it is visible to the eye. No one will deny that things which are not visible do not concern the painter, for he strives to represent only the things that are seen.",
        "Philosophy": "Philosophy is the study of general and fundamental questions about existence, knowledge, values, reason, mind, and language. Such questions are often posed as problems to be studied or resolved. Philosophical methods include questioning, critical discussion, rational argument, and systematic presentation. Philosophical questions can be grouped into various branches. These groupings allow philosophers to focus on a set of similar topics and interact with other thinkers who are interested in the same questions.",
        "Relativity": "Lightning has struck the rails on our railway embankment at two places A and B far distant from each other. I make the additional assertion that these two lightning flashes occurred simultaneously. If I ask you whether there is sense in this statement, you will answer my question with a decided 'Yes.' But if I now approach you with the request to explain to me the sense of the statement more precisely, you find after some consideration that the answer to this question is not so easy as it appears at first sight.",
        "Information Technology": "Information technology is the use of computers to store, retrieve, transmit, and manipulate data or information. IT is typically used within the context of business operations as opposed to personal or entertainment technologies. IT is considered to be a subset of information and communications technology 'ICT'. An information technology system 'IT system' is generally an information system, a communications system or, more specifically speaking, a computer system including all hardware, software and peripheral equipment operated by a limited group of users.",
        "Technology": "Technology is the sum of techniques, skills, methods, and processes used in the production of goods or services. The simplest form of technology is the development and use of basic tools. Technology has many effects. It has helped develop more advanced economies. Philosophical debates have arisen over the use of technology, with disagreements over whether technology improves the human condition or worsens it. Technology is often a consequence of science and engineering, although technology as a human activity precedes the two fields.",
        "Science": "Science from the Latin word scientia, meaning 'knowledge' is a systematic enterprise that builds and organizes knowledge in the form of testable explanations and predictions about the universe. Modern science is typically divided into three major branches that consist of the natural sciences, which study nature in the broadest sense, the social sciences which study individuals and societies and the formal sciences, which study abstract concepts. There is disagreement, however, on whether the formal sciences actually constitute a science as they do not rely on empirical evidence.",
        "Engineering": "Engineering is the use of scientific principles to design and build machines, structures, and other items, including bridges, tunnels, roads, vehicles, and buildings. The discipline of engineering encompasses a broad range of more specialized fields of engineering, each with a more specific emphasis on particular areas of applied mathematics, applied science, and types of application. Engineering is often characterized as having four main branches, that is chemical engineering, civil engineering, electrical engineering, and mechanical engineering.",
        "The Internet": "The Internet 'or internet' is the global system of interconnected computer networks that uses the Internet protocol suite 'TCP/IP' to communicate between networks and devices. It is a network of networks that consists of private, public, academic, business, and government networks of local to global scope, linked by a broad array of electronic, wireless, and optical networking technologies. The Internet carries a vast range of information resources and services, such as the interlinked hypertext documents and applications of the World Wide Web 'WWW', electronic mail, telephony, and file sharing.",
        "Debugging": "Debugging is the process of finding and resolving bugs 'defects or problems that prevent correct operation' within computer programs, software, or systems. The terms 'bug' and 'debugging' are popularly attributed to Admiral Grace Hopper in the 1940s. While she was working on a Mark II computer at Harvard University, her associates discovered a moth stuck in a relay and thereby impeding operation, whereupon she remarked that they were 'debugging' the system. However, the term 'bug', in the sense of 'technical error', dates back at least to 1878 and Thomas Edison 'see software bug for a full discussion'.",
        "Programming": "Programming is the process of designing and building an executable computer program to accomplish a specific computing result or to perform a specific task. Programming involves tasks such as: analysis, generating algorithms, profiling algorithms' accuracy and resource consumption, and the implementation of algorithms in a chosen programming language 'commonly referred to as coding'. Different programming languages support different styles of programming 'called programming paradigms'. The choice of language used is subject to many considerations, such as company policy, suitability to task, availability of third-party packages, or individual preference. Ideally, the programming language best suited for the task at hand will be selected.",
        "Math Mystery": "The instructor was incredulous that this new student could add a hundred terms so quickly and he assumed that answer would be wrong. However, when all the other students had finally finished their work and placed their slates upon the table, the instructor turned Gauss' slate over and read the correct answer: five thousand and fifty. How had Gauss done it? Gauss noticed that the first term, one, and the last term, a hundred, added together to be a hundred and one. Then he realized that the second term, two, and the next-to-last term, ninety nine, also added together to be a hundred and one. In fact, if he kept adding pairs of terms in this manner, he would get fifty pairs of sums, each sum equal to a hundred and one. Fifty multiplied by hundred and one is five thousand and fifty.",
        "The Code Book": "The next morning, Rivest handed the paper to Adleman, who went through his usual process of trying to tear it apart, but this time he could find no faults. His only criticism was with the list of authors. 'I told Ron to take my name off this paper,' recalls Adleman. 'I told him that it was his invention, not mine. But Ron refused and we got into a discussion about it. We agreed that I would go home and contemplate it for one night, and consider what I wanted to do. I went back the next day and suggested Ron that I be the third author. I recall thinking that this paper would be the least interesting paper that I will ever be on.' Adleman could not have been more wrong. The system, dubbed RSA 'Rivest, Shamir, Adleman' as opposed to ARS, went on to become the most influential cipher in modern cryptography.",
        "Wikipedia": "Wikipedia abbreviated as WP, is a multilingual online encyclopedia created and maintained as an open collaboration project by a community of volunteer editors. It is the largest and most popular general reference work on the World Wide Web. It features exclusively free content and has no advertising. Wikipedia was launched on January fifteenth, two thousand and one, and was created by Jimmy Wales and Larry Sanger. With six point two million articles, the English Wikipedia is the largest of the more than three hundred Wikipedia encyclopedias. Overall, Wikipedia comprises more than fifty four million articles attracting one point five billion unique visitors per month. In two thousand and five, Nature published a peer review comparing forty two hard science articles from Encyclopedia Britannica and Wikipedia and found that Wikipedia's level of accuracy approached that of Britannica.",
        "Gammaray burst": "Gammaray bursts are extremely energetic explosions that have been observed in distant galaxies. They are the brightest and most energetic electromagnetic events known to occur in the universe. Most GRBs are billions of light years away from Earth, the explosions are both extremely energetic and extremely rare. A typical gammaray burst releases as much energy in a few seconds as the Sun will in its entire ten billion year lifetime. They are as rare as a few per galaxy per million years. It has been hypothesized that a gammaray burst in the Milky Way, pointing directly towards the Earth, could cause a mass extinction event. They were first observed in the late nineteen sixties. In October two thousand and eighteen, astronomers reported that a gravitational wave event detected in two thousand and seventeen, may have been produced by the same mechanism, that is the merger of two neutron stars.",
        "Africa": "Africa is the world's second-largest and second-most populous continent, after Asia in both cases. At about thirty million square kilometers including adjacent islands, it covers six percent of Earth's total surface area and twenty percent of its land area. With one point three billion people as of twenty eighteen, it accounts for about sixteen percent of the world's human population. Africa's average population is the youngest amongst all the continents; the median age in twenty twelve was nineteen point seven, when the worldwide median age was thirty point four. Despite a wide range of natural resources, the continent is the least wealthy per capita, in large part due to the legacies of European colonization in Africa and the Cold War. Despite this low concentration of wealth, recent economic expansion and the large and young population make Africa an important economic market in the broader global context.",
        "Eurasia": "Eurasia is the largest continental area on Earth, comprising all of Europe and Asia. Primarily in the Northern and Eastern Hemispheres, it is bordered by the Atlantic Ocean to the west, the Pacific Ocean to the east, the Arctic Ocean to the north, and by Africa, the Mediterranean Sea, and the Indian Ocean to the south. The division between Europe and Asia as two continents is a historical social construct, as they have no clear physical separation between them; thus, in some parts of the world, Eurasia is recognized as the largest of the six, five, or four continents on Earth. In geology, Eurasia is often considered as a single rigid mega block. However, the rigidity of Eurasia is debated based on paleomagnetic data. Eurasia covers around fifty five million square kilometres, or around thirty six percent of the Earth's total land area. The landmass contains well over 5 billion people, equating to approximately seventy percent of the human population.",
        "Americas": "The Americas is a landmass comprising the totality of North and South America. The Americas make up most of the land in Earth's Western Hemisphere and comprise the New World. Along with their associated islands, the Americas cover eight percent of Earth's total surface area and twenty eight percent of its land area. Humans first settled the Americas from Asia between forty two and seventeen thousand years ago. Decolonization of the Americas began with the American Revolution in the seventeen seventies and largely ended with the Spanish-American War in the late eighteen nineties. The Americas are home to over a billion inhabitants, two-thirds of whom reside in the United States, Brazil, and Mexico. The name America was first recorded in fifteen-zero-seven. The name was also used in the Cosmographiae Introductio, in reference to South America. America derives from Americus, the Latin version of Italian explorer Amerigo Vespucci's first name.",
        "Antarctica": "Antarctica is Earth's southernmost continent. It contains the geographic South Pole and is situated in the Antarctic region of the Southern Hemisphere, It is surrounded by the Southern Ocean. At fourteen million square kilometres, it is the fifth-largest continent and nearly twice the size of Australia. At zero point zero zero zero zero eight people per square kilometre, it is by far the least densely populated continent. About ninety eight percent of Antarctica is covered by ice that averages one point nine kilometre in thickness, which extends to all but the northernmost reaches of the Antarctic Peninsula. It is the coldest, driest, and windiest continent, and has the highest average elevation of all the continents. Most of Antarctica is a polar desert, there has been no rain there for almost two million years, yet eighty percent of the world freshwater reserves are stored there, enough to raise global sea levels by about sixty metres if all of it were to melt."
      }
    },
    {
      "title": "58",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type 5 and the right one to type 8.</p>",
      "subunits": {
        "Grip": "f5f5 j8j8 f5f5 j8j8 f5f5 j8j8; 5f5f 8j8j 5f5f 8j8j 5f5f 8j8j; j5j5 f8f8 j5j5 f8f8 j5j5 f8f8; 5j5j 8f8f 5j5j 8f8f 5j5j 8f8f; f5r8 j8u5 f5r8 j8u5 f5r8 j8u5; asdf5 ;lkj8 asdfr5 ;lkju8 asdf5r ;lkj8u a5r8 85u8 8858 85l5 558u5 5r85 58rl8 s5858k a5s8 r5as8 s5l8r s585r d58k5 k85l5 r5l85 a8558 558a 8588",
        "Words": "5 books, 8 sentences, 58 words, 5858 students, 85 cars, 88 constellations, 55 journals, 5 laptops, 58 bottles, 85 cities, 855 buildings, 588 pens, 858 trains, 585 buses",
        "Control": "5 58 585 5858 58585 585858 8 88 885 8855 88558 885585 8 85 858 8585 85858 858585 5 55 558 5588 55885 558858",
        "Sentences": "John has about 55 science books. There are 8 planets. There are 88 constellations. Area code 585 is a state of New York area code. 58 candidates will be selected.",
        "Test": "5 58 585 85 85 58 85 85 58 588 588 855 8558 588 588 85; 5 books, 8 sentences, 58 words, 5858 students, 85 cars; There are 88 constellations. John has about 55 science books."
      }
    },
    {
      "title": "49",
      "Img": ["img/middlefingers.jpg"],
      "guide": "<p>Use the left middle finger to type 4 and the right one to type 9.</p>",
      "subunits": {
        "Grip": "d4d4 k9k9 d4d4 k9k9 d4d4 k9k9; 4d4d 9k9k 4d4d 9k9k 4d4d 9k9k; k4k4 d9d9 k4k4 d9d9 k4k4 d9d9; 4k4k 9d9d 4k4k 9d9d 4k4k 9d9d; d4r9 k9u4 d4r9 k9u4 d4r9 k9u4; d4r8 k9u4 d4r8 k9u4 d8r9 k9u4; a8dd4 8akk9 as5dr4 5akku9 5s8d4r 8a5k9u a4r9 94u8 9549 94s4 489u4 4r95 49rd5 s4549k a4s98 r4as9 s4a98 s594r d49k5 k98a4 r5a94 a9849 849a 949598",
        "Words": "4 pens, 9 pencils, 49 buses, 5945 items, 99 words, 44 hens, 45 tests, 94 samples, 9454 roads, 94 sticks, 545 villages, 954 seats, 598 labels, 549 calls",
        "Control": "4 44 449 4499 44998 449985 9 94 948 9488 94885 948859 9 98 984 9844 98445 984459 4 48 489 4899 48994 489945",
        "Sentences": "The sum of 44 and 55 is 99. 44 is one less than 45. 89 is one more than 99. 45 is a multiple of 9.",
        "Test": "4 49 94 9445 9844 9845 4589 9845 4458 4459 449 984 995; 4 pens, 45 tests, 5945 items, 99 words, 94 samples; The sum of 44 and 55 is 99. 44 is one less than 45."
      }
    },
    {
      "title": "67",
      "Img": ["img/forefingers.jpg"],
      "guide": "<p>Use the left forefinger to type 6 and the right one to type 7.</p>",
      "subunits": {
        "Grip": "f6f6 j7j7 f6f6 j7j7 f6f6 j7j7; 6f6f 7j7j 6f6f 7j7j 6f6f 7j7j; j6j6 f7f7 j6j6 f7f7 j6j6 f7f7; 6j6j 7f7f 6j6j 7f7f 6j6j 7f7f; f6r7 j7u6 f6r7 j7u6 f6r7 j7u6; asff6 ;ljj7 asffr6 ;ljju7 asff6r ;ljj7u a6r7 76u7 7767 76l6 667u6 6r76 67rl7 s6767j a6s7 r6as7 s6l7r s676r f67j6 j76l6 r6l76 a7667 667a 7677",
        "Words": "6 horses, 7 days, 77 elephants, 67 pipes, 76 stones, 776 eggs, 765 pages, 46 chapters, 78 questions, 56 answers, 664 schools, 779 tricks, 68 pins, 687 bins",
        "Control": "6 66 667 6677 66774 667745 7 76 768 7688 76885 768857 7 78 786 7896 78965 789657 6 68 687 6877 68776 687769",
        "Sentences": "67 is a prime number but 76 isn't. 679 is a multiple of97. 676 is one less than 677. 767 is a multiple of 59.",
        "Test": "66 76 77 78 677 769 976 975 9756 568 485 9478 4588 465; 6 horses, 7 days, 664 schools, 779 tricks, 56 answers; 67 is a prime number but 76 isn't. 676 is one less than 677."
      }
    },
    {
      "title": "30",
      "Img": ["img/ringfingers.jpg"],
      "guide": "<p>Use the left ring finger to type 3 and the right one to type 0.</p>",
      "subunits": {
        "Grip": "s3s3 l0l0 s3s3 l0l0 s3s3 l0l0; 3s3s 0l0l 3s3s 0l0l 3s3s 0l0l; l3l3 s0s0 l3l3 s0s0 l3l3 s0s0; 3l3l 0s0s 3l3l 0s0s 3l3l 0s0s; s3r0 l0u3 s3r0 l0u3 s3r0 l0u3; asss3 ;lll0 asssr3 ;lllu0 asss3r ;lll0u a3r0 03u0 0030 03l3 330u3 3r03 30rl0 s3030l a3s0 q3ks0 s3l0n s303o w30l3 o03l3 m3l03 a0330 330a 0300",
        "Words": "30 days, 300 lions, 303 buses, 367 numbers, 70 years, 73 goals, 40 names, 83 bytes, 50 tables, 80 tables, 35 cars, 307 sets, 360 mails, 630 books, 305 diaries",
        "Control": "3 34 340 3400 34003 340035 0 03 038 0387 03870 038703 0 07 076 0763 07633 076330 3 30 309 3093 30930 309303",
        "Sentences": "April has 30 days. There are 365 days in a year. 390 is a multiple of 3. 37 is a prime number.",
        "Test": "34 30 365 70 30 90 53 80 73 50 3580 3470 9074 7030 7037; 30 days, 630 books, 80 tables, 83 bytes, 307 sets, 35 cars; April has 30 days. There are 365 days in a year."
      }
    },
    {
      "title": "12",
      "Img": ["img/littlefingers.jpg"],
      "guide": "<p>Use the left little finger to type 1 as well as 2.</p>",
      "subunits": {
        "Grip": "a1a1 q2q2 a1a1 q2q2 a1a1 q2q2; 1a1a 2q2q 1a1a 2q2q 1a1a 2q2q; q1q1 a2a2 q1q1 a2a2 q1q1 a2a2; 1q1q 2a2a 1q1q 2a2a 1q1q 2a2a; a1z2 p2q1 a1p2 p2u1 a1z2 q2p1; aaaa1 ;qqq2 aaaar1 ;p1qu2 a2ap1r ;1pq2u a1p2 21z2 2212 21q1 112u1 1r21 12rq2 a1212q a1a2 q1ka2 a1q2n a121o j12q1 o21q1 m1q21 a2112 112a 2122",
        "Words": "12 months, 21 days, 52 weeks, 11 books, 22 notes, 2 pens, 121 points, 132 trials, 82 tosses, 192 attempts, 21 pins, 14 stories, 511 passengers, 122 bottles, 811 buildings",
        "Control": "1 12 121 1218 12182 121822 2 27 271 2719 27192 271922 2 24 241 2415 24158 241581 1 18 182 1821 18211 182112",
        "Sentences": "There are 12 months and 52 weeks in a year. Square of 11 is 121. 22 is one more than 21. 211 is a prime number.",
        "Test": "12 21 52 11 22 2 121 132 82 192 21 14 511 122 811 917; 12 months, 52 weeks, 121 points, 82 tosses, 192 attempts; There are 12 months and 52 weeks in a year. 211 is a prime number. Square of 11 is 121."
      }
    },
    {
      "title": "Number Passages",
      "guide": "<p>Type the number passages with the correct fingers as practiced in the previous units. Type at least five passages before proceeding to next unit.</p>",
      "subunits": {
        "Mathematical constant-e": "Number e 'Euler's number' is aproximately 2.71828. Value of e to 50 decimal places is 2.71828 18284 59045 23536 02874 71352 66249 77572 47093 69995. On function of x power 1 divide by x, maximum occurs exactly at e. Function's maximum is 1.4446 6786 1009 7661 3365 'to 20 decimal places'. Also infinite iteration of x power x converges between 0.0660 and 1.4447. See further reading on Calculus with Analytic Geomory by Taylor and Francis, ISBN 978 0 87150 268 1 and Calculus By springer ISBN 978 0 378 90974 5. Intro to history of Math by Holt, Rinehart and Winston ISBN 978 0 03 029558 4. Derived Functions of Logarithmic Functions, Courier Dover pp. 337, ISBN 0 486 40453 6. See also Roger Cotes 1714, Logometria especially bottom of page 10, Porro eadem ratio est inter 2,718281828459 and The Mathematical Intelligencer. 28 2 1021. doi:10.1007/bf02987150.",
        "English Wikipedia": "As of 11/2020, 11 percent of articles in all Wikipedias belong to the English language edition. Declining from more than 50 percent in 2003. As of 16 September 2020, there were 6,158,783 articles. It surpassed the 6 million mark on 23 01/2020. In 08/2019, it amounted to 16.1GB. Number of user accounts is 39,908,723, number of articles is 6,158,783, number of files is 890,452 and administrators are 1,130. Statistics of articles is as follow: Featured articles is 6,962, featured list 2,030, A class articles 2,139, good 34,302, B class 133,806, C class 345,654, Start class 1,851,016, Stub class 3,401,357, List 257,835, assessed 6,035,101, unassessed 487,572 and total articles are 6,522,673. By rating, top 56,429, High 202,002, Mid 784,326, Low 3,618,548, Unrated 1,861,368 and total again is 6,522,673. In 03/2013, 16.76 percent of articles were in English.",
        "Golden ratio": "Two quantities are in the golden ratio if their ratio is the same as the ratio of their sum to the larger of the two. The value 1.618 033 988 7 etc is a golden ratio of 1 plus root of 5 divide by 2. The golden ratio and of the Fibonacci sequence are intimately interconnected. The Fibonacci sequence 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, etc is closed form expression for the Fibonacci sequence. The golden ratio's decimal expansion can be calculated with 1 plus root of 5 divide by 2 with root of five being 2.236 067 977 499 789 696 4. Sources are Barnes and Noble Books. p. 62. ISBN 978 0 7607 5931 8, Teaching Mathematics in the Block pp. 44, 47, ISBN 1 883 001 51 X, A Musical Analysis. Cambridge University Press. ISBN 978 0 521 31145 8 and Richard Padovan '1999'. Proportion. Taylor and Francis. pp. 305 to 306. ISBN 978 0 419 22780 9.",
        "Fibonacci sequence": "In mathematics, the Fibonacci sequence is the sum of the two preceding ones, starting from 0 and 1. The beginning of the sequence is therefore 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, etc. Knowledge of the Fibonacci sequence was expressed as early as 450 BC to 200 BC. The conversion factor 1.609344 for miles to kilometers is one of application of Fibonacci sequence. The first 21 Fibonacci numbers Fn are 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765. When Fn is bidirectional the sequence becomes negative 21, 13, 8, 5, 3, 2, 1, and positive 1 0 1 1 2 3 5 8 13 21. A closed form expression of Fibonacci leads to golden ratio of 1.61803 39887 etc. Some math puzzle books present as curious the value of 1 divide by 9899 which is 0.0001 0102 0305 0813 2134 55. The first few Fibonacci prime are 2, 3, 5, 13, 89, 233, 1597, 28657, 514229, etc.",
        "Prime numbers": "The first 25 prime numbers 'less 100' are: 2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89 and 97. Euclid numbers are 1 plus '2 . 3 . 5 . 7 . 11 . 13' equals 59 . 509. The largest known primes by times are as follows, Mersenne prime 2 power 82,589,933 minus 1 with digits 24,862,048, Proth prime 10,223 x 2 power 31,172,165 plus 1 with digits 9,383,761, factorial prime 208,003 factorial minus 1 with digits 1,015,843, primorial prime 1,098,133 hash minus 1 with digits 476,311 and twin primes 2,996,863,034,895 x 21,290,000 plus/minus 1 with digits 388,342. The first 5 fermat primes are 3, 5, 17, 257, and 65,537. References; Dyslexia, Dyscalculia and Maths, Henderson, ISBN 978 1 136 63662 2, Math workbook for the SAT 1, Leff, ISBN 978 0 7641 0768 9. Mathematics Magazine. 75 '1': 18 to 29. doi:10.2307/3219180. JSTOR 3219180. MR 2107288.",
        "Africa statistics": "Africa is the second largest and populous continent. At about 30.3 million km with 1.3 billion people as of 2018. The median age in 2012 was 19.7 with worldwide being 30.4. The PPPs peaks of countries per peak year are Egypt 1,427,432 in 2020, Nigeria 1,215,389 in 2019, South Africa 804,688 in 2019, Algeria 668,827 in 2019, Morocco 327,251 in 2019, Ethiopia 253,102 in 2020, Libya 220,503 in 2007, Angola 200,830 in 2019, Tanzania in 198,652 in 2020. GDP of countries per peak years are Nigeria 568,496 in 2014, South Africa 416,879 in 2011, Egypt 353,003 in 2020, Algeria 213,810 in 2014, Angola 145,712 in 2014, Morocco 124,539 in 2020, Kenya 109,128 in 2020, Ethiopia 103,607 in 2020, Libya 79,759 in 2012 and Ghana 72,037 in 1982. The continent is believed to hold 90 percent of the world's cobalt, 90 percent of its platinum, 50 percent of its gold and 98 percent of its chromium.",
        "Real number": "Real number was introduced in 17th century. Consider rational number 415/93 which is 4.4624. 415/93 equals 4 plus 43/93, fractional part is reciprocal of 93/43 which is about 2.1628. Also 4 plus 1/2 equals 4.5 and 93/43 equals 2 plus 7/43. 43/7 equals 6 plus 1/7. Therefore 4 plus 1 divide 2 plus 1 divide 6 plus 1 divide 7 equals 415/93. Irrational numbers can be square root of 2, 1.41421356 and pie, 3.14159265. Some are infinite sequence shortened like 324.823122147. In number theory, Euler proved 2 power 31 minus 1 equals 2,147,483,647 is Mersenne prime. First 50 decimal digits of Pi are 3.14159 26535 89793 23846 26433 83279 50288 41971 69399 37510. First 20 digits in 'base 16' are 3.243F 6A88 85A3 08D3 1319. First 5 sexagesimal 'base 60' are 3;8,29,44,0,47. In convergent series 1/pi equals sum of 4k factorial times 1103 plus 26390k divide k factorial power 4 times 396 power 4k.",
        "Square root of 3": "The square root of 3 is the positive real number. The first sixty digits are 1.73205 08075 68877 29352 74463 41505 87236 69428 05253 81038 06280 5580. In hexadecimal is 1.BB67 AE85 84CA A73B. The fraction 97/56 '1.732142857' is an approximation. Archimedes reported three is less than '1351/780' power 2 and greater than '265/153' power 2, accurate to 1/608400 'six decimal places' and 2/23409 'four decimal places', respectively. The square root of 3 also appears in algebraic expressions including the sines of 3, 12, 15, 21, 24, 33, 39, 48, 51, 57, 66, 69, 75, 78, 84, and 87. Sources are Archive for History of Exact Sciences, 15 '2' 115 to 140, doi:10.1007/bf00348496, JSTOR 41133444, MR 0497462, Mathematics of Computation. 22 '101' 234 to 235. doi:10.2307/2004806. JSTOR 2004806. Proc and Natl. Acad. Sci. U.S.A. 37 '7' 443 to 447. doi:10.1073/pnas.37.7.443. PMC 1063398. PMID 16578382.",
        "Natural logarithm of 2": "The value of the natural logarithm of 2 is 0.693 147 180 559 945 309 417 232 121 458. Common logarithm is 0.301 029 995 663 981 195, its inverse is binary logarithm which is 3.321 928 095. Natural logarithm of 2 is represented as 1 minus 1/2 plus 1/3 minus 1/4 plus 1/5 minus 1/6 in harmonic series. The Engel expansion is 1/2 plus 1/2x3 plus 1/2x3x7 plus 1/2x3x7x9 etc. The following are logarithm of prime numbers, ln 2 is 0.693 147 180 559 945 309 417 232 121 458, ln 3 is 1.098 612 288 668 109 691 395 245 236 92, ln 5 is 1.609 437 912 434 100 374 600 759 333 23, ln 11 is 2.397 895 272 798 370 544 061 943 577 97, ln 13 is 2.564 949 357 461 536 736 053 487 441 57, ln 17 is 2.833 213 344 056 216 080 249 534 617 87, ln 19 is 2.944 438 979 166 440 460 009 027 431 89 and ln 23 is 3.135 494 215 929 149 690 806 752 831 81. Sources are J. ACM. 23 '2' 242 to 251. doi:10.1145/321941.321944. MR 0395314.",
        "Square root of 2": "The square root of 2 is the '1/2'th power of 2. It is approximately 99/70 '1.414 2857'. The 65 decimal places are 1.41421 35623 73095 04880 16887 24209 69807 85696 71875 37694 80731 76679 73799. In hexadecimal is 1.6A09 E667 F3BC C908 B2F. The closest possible three place sexagesimal representation is 1 plus 24/60 plus 51/60squared plus 10/60cubed equaling 305470/216000 equaling 1.4142 1296. The Indian Sulbasutras 'c. 800 to 200 BC', also estimates as follows; 1 plus 1/3 plus 1/3x4 minus 1/3x4x34 equaling 577/408 equaling 1.4142 1568 6274 5098 039. Babylonian method of estimation is the most commonly used, that is 3/2 equals 1.5, 17/12 equals 1.416 etc, 577/408 etc equals 1.4142 15 etc and 665857/470832 equals 1.4142 1356 2374 6 etc. Yasumasa Kanada's team in 1997 calculated its value to 137,438,953,444 decimal places. It also equals to 1 plus 1/2 minus 1/2x4 plus 1x3/2x4x6 minus 1x3x5/2x4x6x8 etc.",
        "Mathematical Pi": "Pi is a mathematical constant. It is approximately equal to 3.14159. Fractional approximations are 22/7, 355/113, 333/106, 52163/16604, 103993/33102, 104348/33215 and 245850922/78256779. The first 50 decimal digits are 3.14159 26535 89793 23846 26433 83279 50288 41971 69399 37510. The first 20 digits in hexadecimal 'base 16' are 3.243F 6A88 85A3 08D3 1319. The first five sexagesimal 'base 60' digits are 3;8,29,44,0,47. Zu Chongzhi, around 480 AD, calculated that pi is greater than 3.1415926 and less than 3.1415927 and approximated it to 355/113 or 3.14159292035 and 22/7 or 3.142857142857 by using Liu Hui's algorithm applied to a 12,288 sided polygon. Newton also used an arcsin to compute the 15 digits of pie in 1665 or 1666. The highest record of known digits of pie was broken repeatedly '7,480 digits in 1957; 10,000 digits in 1958; 100,000 digits in 1961' until 1 million digits were reached in 1973."
      }
    },
    {
      "title": "!@#$",
      "Img": ["img/qwerty.jpg", "img/leftfingers.jpg"],
      "guide": "<p>Use the left fingers, i.e littlefinger to type <b>!</b> ringfinger to type <b>@</b> middlefinger to type <b>#</b> and forefinger to type <b>$</b></p><p>Note: Set your keyboard layout to \"US keyboard layout\" in image above.</p>",
      "subunits": {
        "Grip": "$@!#@ #!$@$ !#!#$ @!#@$ $!@#@ #!$@# !$#@$ !$!#@ @#$!! #$@$@ #!!@$ #$!#@ @$!#! @$#@# !$$!@ ##@!$ #$@!@ !#$#$ !@$@# !#!@$ $!@#@ $!##@ $!!$# @#!$@ #@!$! $@##$ @!@$! #!$#@ !@#$@ $#!$@ !##@$ !#!@$ @$#!$ @!#@$ !#@#! $@#$! !$#@! #@$#$ @!!#$ @@$#! #!@$$ #!@!# @$@$# !$#!@ @$!#@ #$!!# $@@!$ #!@$# #!@$# !$@!@ #$@!# $#!@$ #@$!! $#@#@",
        "Words": "#!@$# @#$@$ #@$#! $#@!@#@ !#@$ !@#$!$ #@#@$@ #@#$# @#!$#!$ !@$ @!#$ @$#!$# @#!#$! #!$!@ $@$!$! #$# @#!# @$@$# !#@$ @!@!$ #$#$@!$ !@#@ $@$!#@ $@$@#!@#$ #!@# $@!#$ #@#$ @#!@#@ !@!@$! @!$!#!@ $!# !$@#@ $!#@$#! #!$@$ !#@!@ !#!@ #$!#@$ #!$!$ #!@! @#$@$! #$# $!@!$! @$@# !@$# @#@!$ @$!@$! @#!# !$#@! $!@!@! #$!@$ !#$@!$ !@!@$ !$!#$@ #$!#!$@# !#$!@$ @$!$@$# !@$!#!@#!",
        "Control": "$100 @2020! #itWorks #NOF easy@pass! $tryAgain$ #xFF03 @ hex #happy! #joyful! @VMSINSTAL #Onetimeinclass! #blessed! $Ulrich$ /dev/sda1@linux $15 @20 each! @smiley! $$money$$ @latest! 9090@666! $650 #retrieved string! ISBN 0!7897!2523! @#!$1999$!#@ Micro$oft $On#April!4@2011 very$tr@ng!Password# 18@907 $10 $50 and $100 @echo off",
        "Sentences": "US$ !618@907! Isle @ Man in 1983. A #2 pencil! #key @ a phone! language is written C#! #FFAA00 color! LDA #10! $#array! Symphony #5! #S is set cardinality! ###, as a marker in text! #NOF is often used for fractured neck @ femur! #xFF03 @ hex number! $ is used in the ALGOL 68! $ is used @ the prompt command! $ matches the end of a line or $ mean excess money such as @ Micro$oft, George Luca$, Lar$ $Ulrich$, Di$ney, Chel$ea and GW$! @ is registered! @ is in email addresses! @VMSINSTAL at the command prompt! @array @@ prefixes",
        "Test": "$ is a symbol! $1 read as 1 dollar. $ denominations are $1 $5 $10 $50 and $100! @ is commonly called the at symbol! Example #1, 7 widgets @ $2 per widget! Example uses are ssh jdoe@example.net and user@host! @ is commonly used to denote a reply, for instance @Jane! @ is used to represent the $ORIGIN in DNS! @echo off is a batch command! Emails john@francis.com gonzaga@novitiate.org and info@jsweb.org! # is used on social networks such as #bluesky #blacklivesmatter and #me2! # is used in C program for special keywords! topics can be #WhydidIsaythat, #Worstfirstdate, to #Onetimeinclass!"
      }
    },
    {
      "title": "&*()",
      "Img": ["img/qwerty.jpg", "img/rightfingers.jpg"],
      "guide": "<p>Use the right fingers, i.e forefinger to type <b>&</b> middlefinger to type <b>*</b> ringfinger to type <b>(</b> and littlefinger to type <b>)</b></p><p>Note: Set your keyboard layout to \"US keyboard layout\" in image above.</p>",
      "subunits": {
        "Grip": ")*(&& *())( &*()* &&)*( )&(*) *&()* (&*)( &(*)& (&)** ()&)& *(()* &*()& )*(&& )*()& (**&) (*)&( &)*() &*(() *&&)( **)(& (*)&) (*&*( )&)(* &()&* &(*)* &())( &*&() **&() ()&*) *(&*& ()&*) ()&*( )(&** (&))( *&)(* &&(*) *)(&* (&)(& *)&)( *)*&( &)*(* &()&) *(&*( )&()* *(&)) *&(*( )&&() *)*(& &*()( *&)&* )(*(& )&)*( *)&(& )*(()",
        "Words": "&)*&( &)(&) *&)*( &*)& *&)&) &*(&*) &*(&*) (&*)(&( &*&) *(&(&) *(&*(& *)(&* )&*&* (&*) (&*)& (&(&* (&*)( &)&*( &*)(& *(&)& *(&*) (&*)( &*)( &*&) &)&)* (&*) (&*)(& *)&)* (&*&) &*(&* (&)&)* (&*(&*) (&*)(&* )(&* (&*)( &*&) (&*)& *(&)& *(&* &*&( &*&() *)&) *&(&*) &)&) (&*)( &*)(&*) &)*(&* )(&*) (&*)( &*(&*) (&*)& )&*&* &*(&( &*)(&*",
        "Control": "& #NOF ALGOL 68! &C (etC) logogram A&P Tiffany & Co AT&T, #FFAA00 color! R&D (4 & 2) is zero HC(CH3)3 (isobutane) test & 1.38064852(79) &func, &a &FF Doc* and D*ment* #xFF03 @ hex! 'b*ll*cks' @@ prefixes $Ulrich$ Ca(NO3)2 (calcium nitrate) !618@907! A* search or C*-algebra (*(@VMSINSTAL) *) A* ('A star') p* is the #key @ a phone &#38 &amp HTM &#65120",
        "Sentences": "Doc* and D*ment* would return this file e.g &x, &func, &a &FF for decimal 255 x, #FFAA00 color! &#38 &amp HTM &#65120 & bitwise AND '*action*' & 1.38064852(79) &func, &a &FF B&B (bed and breakfast), and P&L (profit and loss) #xFF03 @ hex! 'b*ll*cks' @@ prefixes  !618@907! A* search or C*-algebra (*(@VMSINSTAL)*) A* ('A star') & is collaboration than 'and' Court, (1998) 54.",
        "Test": "A&P (supermarkets), Tiffany & Co, AT&T (American Telephone and Telegraph) are firms. Emphasis like (What? Yes, that was her name!) 5** is the highest level in HKDSE '*action*' signifies action. #bluesky #blacklivesmatter and #me2 are social tags. Word *ainlif is a form. $1 reads as 1 dollar and ssh jdoe@example.net and username@localhost! are emails. () are used in chemistry e.g. HC(CH3)3 (isobutane) Ca(NO3)2. The &#38 are for bitwise AND. 107* means '107 not out'. * signify exponent like 5**3 Ruby and Python. In programming /* This is comment */ (*(comment are ignored) *)."
      }
    },
    {
      "title": "!@#$&*()",
      "Img": ["img/qwerty.jpg", "img/allfingers.jpg"],
      "guide": "<p>Use all fingers, that is: the left fingers with littlefinger to type <b>!</b> ringfinger to type <b>@</b> middlefinger to type <b>#</b> and forefinger to type <b>$</b>.The right fingers with forefinger to type <b>&</b> middlefinger to type <b>*</b> ringfinger to type <b>(</b> and littlefinger to type <b>)</b></p><p>Note: Set your keyboard layout to \"US keyboard layout\" in image above.</p>",
      "subunits": {
        "Grip": "#(*)@ &#$!! @$(*& )($(! @$&*# )@#&) !*#(! )!@** &&)($ $#@$) ((*$* @@&)# &!!#* !@$$# (*#@) &(!&) (#$$@ !&@#& **)(! )$)@@ #!($* &(*!& )#!*$ )$()( &!@@# &#*$$ &#@)! (&@*( #)!*@ #!*&$ #$!() )&(*@ (*(#* $#@)! &$)!@ &!&@# *)@($ (!#*$ &)$*# (!@#* !()@& )$&*& #(@$& $#)@! (!)*$ #(#*) (*&!) &!@$@ @(*(* $@!)# #)&&$ !*#(& @*(!@ )&$)#",
        "Words": "@#(@& !($@* @#$#! $&!)&# ()!@* @(!(& @#$*) !#$*& (*)#@) *(#$*$ &)*!#@ #$!#& #)*!& #@!@& #@($*( $&@& $#@)*# $)#!&@ (#*$# @)*!@$ *@#$@) @!#)!& @(#)@ $#&$ @!(@&$ )@*!@ #(&#& @$@*#@ (#@&( #$!$ !(@!*# @#*(@$ #@&#$ @$!&* !(!()# &$)& $!*#$ )(@)$@ #$#@) *#@#$ !@$)*# $#(#@ @!#!(& *#$&!)@ #@#& !@#@) @&*)@ !(&#(# (#@$)& @(@#& *&*(*)#) !$#&",
        "Control": "#bluesky and #me2 are tags & #NOF ALGOL $1 reads as 1 dollar 68! (4 & 2) is 0, (4 & 5) is 4 &C (etC) logogram The 107* means '107 not out' A&P Tiffany & Co AT&T, #FFAA00 color! * is in C*-algebra e.g &x, &func R&D (4 & 2) is zero HC(CH3)3 (isobutane) test & 1.38064852(79) &func, &a &FF Doc* and D*ment* #xFF03 @ hex! 'b*ll*cks' @@ prefixes $Ulrich$ Ca(NO3)2 (calcium nitrate).",
        "Sentences": "'b*ll*cks' (bollocks) 61*. * is in C*-algebra e.g &x, &func. 5** is highest in HKDSE '*action*'. $ is a symbol for $100! #bluesky and #me2 are tags. *ainlif is a form. $1 reads as 1 dollar. root@local.net! is address. () are used in chemistry e.g. Ca(NO3)2. The 107* means '107 not out'. 5**3 is exponent. In coding /* This is comment */. (4 & 2) is 0, (4 & 5) is 4.",
        "Test": "A&P (supermarkets), Tiffany & Co are firms. * is in A* search algorithm or C*-algebra. 5** is the highest level in HKDSE '*action*' signifies action. $ is a symbol for $10 $50! #bluesky #blacklivesmatter and #me2 are social tags. Word *ainlif is a form. $1 reads as 1 dollar and ssh jdoe@example.net and root@localhost! are emails. () are used in chemistry e.g. HC(CH3)3 (isobutane) Ca(NO3)2. The &#38 are for bitwise AND. 107* means '107 not out'. * signify exponent like 5**3 Ruby and Python. In programming /* This is comment */ (*(comment are ignored) *) with *luck or luck*."
      }
    },
    {
      "title": "`-=~%^_+",
      "Img": ["img/qwerty.jpg", "img/littleandforefingers.jpg"],
      "guide": "<p>Use the following fingers: the left littlefinger to type <b>`</b> and <b>~</b> right littlefinger to type <b>-</b>, <b>_</b>, <b>=</b> and <b>+</b> left forefinger to type <b>%</b> and right forefinger to type <b>^</b>.</p><p>Note: Set your keyboard layout to \"US keyboard layout\" in image above.</p>",
      "subunits": {
        "Grip": "-%_`` +^%~~ =+-_= ^~-%_ =`~=+ -^+%` _^^~+ `-^+_ `-=_% %=~^` =%+~^ _-+%- ~_=`+ %^-%- _`~_= ~=+^` ``=-+ ~^_~_ %+-^% =_%`+ %_=~~ +`^-= -^_`^ ~=+%_ +=--^ ~%`%_ ^=-=- ++~%^ `_~`_ `=-%_ `%~^+ -+=~^ `^_%= %~_^- -~+=+ ``+%` ==%^_ ~^~-_ -+=%_ ~=-++ ~`^_% `-^%= `~%^- -=+~_ _+^`= _^~-+ +%^-` %~`_= =+~+= ^``-% ~_^_- %`%`~ %=-+- ^_=+~",
        "Words": "^~_^ %~_+ %_^% _~=_ +%~_ %=~ =`+~ +%+= ^_~= +~%=~ _+~^ ~%`+ ~^=_ `%_^ =~`= %~=^ _^%~^+ %`^% ^~+_~ =~%_ ~%=`% ~=%^`+ _^=~^ %=^~ _%+~ %^~ %`~ +_%~ `^~%+ ~^=^` =+~`+ ^%~`= _^`=~ ^%_`= ~`=^% _`%~^ =_^%~ _=~%^ %=~%^ =_`%~ _~`= %^~` %_=`^+ `~+%=~ _+=%_~ =%^~=+ %^~+=% =~%`= `%_^~+ %+=^~_ %^=_~^+ `^+`~%= _`=^=% `~^+=~ =%`^_ +~^%` %^~`%+ ~%=^",
        "Control": "~ is for ~approximation~. Used_in *E` and Hawai`i. In DOS %1, %2, are parameters. `..` is_spacing + and - = positive_and_negative /* %Use the `printf` function.% */ -5 is minus-five -5^2 = +25..."
      }
    }
  ]
}
