{
  "main": [
    {
      "title": "asdf jkl;",
      "Img": [
        "img/home-keys-position.jpg"
      ],
      "guide": "<p>All the eight fingers except the thumbs should be placed on the home row. This is done by placing the left forefinger on F and the right forefinger on J. Place the remaining fingers on the keys beside them in a natural manner. So, the left little finger would be on A and the right little finger would be on the ; (semicolon) key. Use the right little finger to remove an error with ← key.</p><p>To type any key, press the key with the finger over it. Use one of the thumbs to press the space bar. Keep your eyes on the screen as you type. Do not look at the keyboard.</p><p>Proceed to the next lesson only when you can type with 2% or less errors and atleast 20 words/minute (WPM). Accuracy is more important than speed for a beginner.</p><p>Note:</p><p>With one hour practice every day, you can master typing in two weeks(up to Unit 15)! One more week for mastering numbers(up to Unit 21). The rest is for full keyboard mastery.</p><p>As you practice, you'll encounter terms related to Bible scriptures and Ignatian spirituality to inspire your learning.</p>",
      "subunits": {
        "Grip": "asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj fdsa jkl; fdsa jkl; fdsa jkl; fdsa jkl; fdsa jkl; asdf fdsa ;lkj jkl; asdf fdsa ;lkj jkl; asdf jkl; ;lkj fdsa asdf jkl; ;lkj fdsa ksl; jak; fk;s asl; jas; ;sl; fjas fjk; askl kjf; asdj ;fal dfla ;;ls ;ja; l;ds asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj fdsa jkl; fdsa jkl; fdsa jkl; fdsa jkl; fdsa jkl; asdf fdsa ;lkj jkl; asdf fdsa ;lkj jkl; asdf jkl; ;lkj fdsa asdf jkl; ;lkj fdsa ksl; jak; fk;s asl; jas; ;sl; fjas fjk; askl kjf; asdj ;fal dfla ;;ls ;ja; l;ds asdf ;lkj asdf ;lkj asdf ;lkj",
        "Words": "all all all; sad sad sad; dad dad dad; ask ask ask; add add add; fall fall fall; lad lad lad; fad fad fad; ass ass ass; lass lass lass; sa sa sa; add add add; all all all; sad sad sad; dad dad dad; ask ask ask; add add add; all all all; sad sad sad; dad dad dad; ask ask ask; add add add; all all all; sad sad sad; dad dad dad; ask ask ask;",
        "Control": "d da dad; a al all; f fa fad; s sa sad; a al all; a as ass; f fa fal fall; d da dad; a al all; f fa fad; s sa sad; a al all; a as ass; f fa fal fall; d da dad; a al all; f fa fad; s sa sad; a al all; a as ass; f fa fal fall; d da dad; a al all; f fa fad; s sa sad; a al all; a as ass; f fa fal fall;",
        "Sentences": "ask dad; ask dad; ask dad; all lads fall; all lads fall; all lads fall; a lad asks; a lad asks; a lad asks; sad lads fall; sad lads fall; sad lads fall; ask dad; ask dad; ask dad; all lads fall; all lads fall; all lads fall; a lad asks; a lad asks; a lad asks; sad lads fall; sad lads fall; sad lads fall; ask dad; ask dad; ask dad; all lads fall; all lads fall;",
        "Test": "all sad dad ask add fall lad fad ass lass sa add; lass sad lad all dad; lad sa a ask; sa lass all; ask dad fad lad; all as a; dad fad ass lass all as a dad; a lad asks; ask dad; all lads fall; all sad dad ask add fall lad fad ass lass sa add; lass sad lad all dad; lad sa a ask; sa lass all; ask dad fad lad; all as a; dad fad ass lass all as a dad; a lad asks; ask dad; all lads fall;"
      }
    },
    {
      "title": "ru",
      "Img": [
        "img/forefingers.jpg"
      ],
      "guide": "<p>Use the left forefinger to type R and the right one to type U. After striking the R or U keys, return the forefingers back to the original position on F or J.</p><p>Practice words inspired by spiritual themes like faith and scripture.</p>",
      "subunits": {
        "Grip": "frfr juju frfr juju frfr juju; rfrf ujuj rfrf ujuj rfrf ujuj; jrjr fufu jrjr fufu jrjr fufu; rjrj ufuf rjrj ufuf rjrj ufuf; asdfr ;lkju asdfr ;lkju asdfr ;lkju rfdsa ujkl; rfdsa ujkl; rfdsa ujkl; asdfr ujkl; asdfr ujkl; asdfr ujkl; asdfr rfdsa ;lkju ujkl; asdfr rfdsa asdfr ujkl; ;lkju rfdsa asdfr ujkl; urfu ujku rfur luru rjur arru ursr druj drur arsufr frrur jurru urrsu uusrr drlursu uslru frsusl arfu jfru frfr juju frfr juju frfr juju; rfrf ujuj rfrf ujuj rfrf ujuj; frfr juju frfr juju frfr juju; rfrf ujuj rfrf ujuj rfrf ujuj;",
        "Words": "far far far; fur fur fur; rar rar rar; lark lark lark; radar radar radar; surf surf surf; dull dull dull; urdu urdu urdu; full full full; rural rural rural; us us us; usual usual usual; laura laura laura; russ russ russ; far far far; fur fur fur; rar rar rar; lark lark lark; radar radar radar; surf surf surf; dull dull dull; urdu urdu urdu; full full full; rural rural rural; us us us; usual usual usual; laura laura laura; russ russ russ;",
        "Control": "s su sur surf; r ra rad rada radar; f fu ful full; f fu fur; l la lar lark; u ur urd urdu; f fu fur; l la lau laur laura; f fa far; r ru rur rura rural; s su sur surf; r ra rad rada radar; f fu ful full; f fu fur; l la lar lark; u ur urd urdu; f fu fur; l la lau laur laura; f fa far; r ru rur rura rural;",
        "Sentences": "laura ruads sarrjrur; as usual; laura rkads skrlajurf as usual; laura rsads suraluura as usual; ask russ arkur fadrj; ask russ asauu farff; ask russ asuur faadj; laura rfads ssrf;kurd as usual; laura rlads sfruraur; as usual; laura rfads slr;jjur; as usual; ask russ asau; faksa; ask russ asfuu fauak; ask russ akju; fauff; laura rrads s;rlruuru as usual; laura ruads sjr;fsurs as usual; laura rrads sfr;kjurd as usual;",
        "Test": "radar rural laura russ fur lark rar surf; far usual russ full lark laura dull; laura rjads s;rfkrurk as usual; ask russ asful fafl;; radar rural laura russ fur lark rar surf; far usual russ full lark laura dull; laura r;ads suruudurk as usual; ask russ asau; fassf; radar rural laura russ fur lark rar surf; far usual russ full lark laura dull;"
      }
    },
    {
      "title": "vm",
      "Img": [
        "img/forefingers.jpg"
      ],
      "guide": "<p>Use the left forefinger to type V and the right one to type M.</p><p>Incorporate words related to Jesuit missions and spiritual virtues.</p>",
      "subunits": {
        "Grip": "fvfv jmjm fvfv jmjm fvfv jmjm; vfvf mjmj vfvf mjmj vfvf mjmj; jvjv fmfm jvjv fmfm jvjv fmfm; vjvj mfmf vjvj mfmf vjvj mfmf; fvrm jmuv fvrm jmuv fvrm jmuv; asdfv ;lkjm asdfrv ;lkjum asdfvr ;lkjmu avrm mvum mmvm mvlv vvmuv vrmv vmrlm svmvmk avsm rvasm svlmr svmvr dvmkv kmvlv rvlmv amvvm vvma mvmm fvfv jmjm fvfv jmjm fvfv jmjm; vfvf mjmj vfvf mjmj vfvf mjmj; fvfv jmjm fvfv jmjm fvfv jmjm; vfvf mjmj vfvf mjmj vfvf mjmj;",
        "Words": "madam madam madam; lava lava lava; malva malva malva; slam slam slam; mars mars mars; mask mask mask; uv uv uv; murmur murmur murmur; slum slum slum; mark mark mark; vasu vasu vasu; larva larva larva; dam dam dam; sam sam sam; vum vum vum; arm arm arm; mall mall mall; alarm alarm alarm; madam madam madam; lava lava lava; malva malva malva; slam slam slam; mars mars mars; mask mask mask; uv uv uv; murmur murmur murmur; slum slum slum; mark mark mark;",
        "Control": "m ma mad mada madam; l la lav lava; m ma mas mask; m mu mur mur murm murmu murmur; v va vas vasu; l la lar larv larva; d da dam; v vu vum; u uv; m ma mar mars; s sl sla slam; a al ala alar alarm; m ma mad mada madam; l la lav lava; m ma mas mask; m mu mur mur murm murmu murmur; v va vas vasu; l la lar larv larva; d da dam; v vu vum; u uv; m ma mar mars;",
        "Sentences": "mark all vassals sr mrsskrd; mark all vassals dd massjvs; mark all vassals sl mussjjd; a mad vassal murmurs fa jralar; a mad vassal murmurs ;j kraljr; a mad vassal murmurs dr mrajjr; mark all vassals dd mussdma; mark all vassals fj mmssjkv; mark all vassals fr mvssamj; a mad vassal murmurs ;d jrakfr; a mad vassal murmurs ;u lraj;r; a mad vassal murmurs fj uradmr; mark all vassals ;j mfssmlm; mark all vassals fl mrssam;;",
        "Test": "madam lava slum slam mask vasu sam alarm vum uv; mall alarm arm larva madam malva vum vasu mask; mark all vassals lv mdssjlk; a mad vassal murmurs mf lradur; madam lava slum slam mask vasu sam alarm vum uv; mall alarm arm larva madam malva vum vasu mask; mark all vassals vk mussmfu; a mad vassal murmurs r; sraumr; madam lava slum slam mask vasu sam alarm vum uv;"
      }
    },
    {
      "title": "ei",
      "Img": [
        "img/middlefingers.jpg"
      ],
      "guide": "<p>Use the left middle finger to type E and the right one to type I.</p><p>Use words from Bible and Ignatian terms like 'discern' and 'examen'.</p>",
      "subunits": {
        "Grip": "dede kiki dede kiki dede kiki; eded ikik eded ikik eded ikik; fefe jiji fefe jiji fefe jiji; efef ijij efef ijij efef ijij; deki iked deki iked deki iked; ekid dike ekid dike ekid dike; idek kedi idek kedi idek iked; aeds fers iukj iuea ediu edil; aeiru iuerr juiee ireel aerij afeei iieei eeeii eieie; iesdi sdiei aidef lijue iuefr ifese eikis iaser uieie; dede kiki dede kiki dede kiki; eded ikik eded ikik eded ikik; dede kiki dede kiki dede kiki; eded ikik eded ikik eded ikik;",
        "Words": "fire fire fire; field field field; are are are; riddle riddle riddle; killer killer killer; is is is; file file file; rise rise rise; side side side; read read read; seed seed seed; feed feed feed; leave leave leave; veal veal veal; seal seal seal; visa visa visa; veer veer veer; smear smear smear; lime lime lime; slime slime slime; dime dime dime; vide vide vide; save save save; vase vase vase; live live live; vile vile vile; ride ride ride; free free free; smile smile smile; simile simile simile; familiar familiar familiar; similar similar similar; mere mere mere; merrier merrier merrier; fire fire fire; field field field; are are are; riddle riddle riddle; killer killer killer; is is is; file file file; rise rise rise; side side side; read read read;",
        "Control": "r ri rid ridd riddl riddle; k ki kil kill kille killer; s si sim simi simil simile; f fi fie fiel field; f fa fam fami famil famili familia familiar; v vi vil vile; l li liv live; s sm sme smea smear; l li lime; s sm smi smil smile; i is; a ar are; r ri rid ridd riddl riddle; k ki kil kill kille killer; s si sim simi simil simile; f fi fie fiel field; f fa fam fami famil famili familia familiar; v vi vil vile; l li liv live; s sm sme smea smear; l li lime; s sm smi smil smile;",
        "Sentences": "see a fire drill id reeream; see a fire drill im refreaa; see a fire drill if resreak; dave is a skilled riddler il diseerkmelf; dave is a skilled riddler im disserumemj; dave is a skilled riddler ir disuer;medf; sam served a meal il missif;; jim feeds a deer iv ieaae; jim feeds a deer im ieade; jim feeds a deer ir meaee; see a fire drill ii reireas; see a fire drill i; reireav; see a fire drill ii redreai; dave is a skilled riddler id disler;meir; dave is a skilled riddler ie disserjmelk; dave is a skilled riddler il dissermmeea;",
        "Test": "fire field are riddle killer is file rise side read; rise side visa live dime vide ride vile smile familiar; slime skilled similar drill simile serial is see are; see a fire drill ij reureae; dave is a skilled riddler if disrersmers; sam served a meal im missif;; jim feeds a deer if fea;e; fire field are riddle killer is file rise side read; rise side visa live dime vide ride vile smile familiar; slime skilled similar drill simile serial is see are; see a fire drill ie reereaf; dave is a skilled riddler ik disjeramess;"
      }
    },
    {
      "title": "c,",
      "Img": [
        "img/middlefingers.jpg"
      ],
      "guide": "<p>Use the left middle finger to type C and the right one to type , (comma).</p><p>Include terms from Catholic catechism and Jesuit constitutions.</p>",
      "subunits": {
        "Grip": "dcdc k,k, dcdc k,k, dcdc k,k,; cdcd ,k,k cdcd ,k,k cdcd ,k,k; fcfc j,j, fcfc j,j, fcfc j,j,; cfcf ,j,j cfcf ,j,j cfcf ,j,j; dck, ,kcd dck, ,kcd dck, ,kcd; ck,d d,kc ck,d d,kc ck,d d,kc; ,dck kcd, ,dck kcd, ,dck ,kcd; ,,cc cc,, c,c, ,c,c ,ic, c,ac,; c,r;c ac;,; s,c;fd a,cd, ;,,cv vc,a; cv,sk; ;l,vdj vcm, ,mdc cvi, ;i,c m,fc ec;, dcdc k,k, dcdc k,k, dcdc k,k,; cdcd ,k,k cdcd ,k,k cdcd ,k,k; dcdc k,k, dcdc k,k, dcdc k,k,; cdcd ,k,k cdcd ,k,k cdcd ,k,k;",
        "Words": "receive, circus, circle, maverick, class, mice; ice; fulcrum, care, cure, cafe, face, face, lace, race, claim; card, lack, service, car, camera, recursive, recess; cease, civil, camel, cave, cake, case, decade, crack; receive, circus, circle, maverick, class, mice; ice; fulcrum, care, cure, cafe, face, face, lace, race, claim; card, lack, service, car, camera, recursive, recess; cease, civil, camel, cave, cake, case, decade, crack; receive, circus, circle, maverick, class, mice;",
        "Control": "m ma mav mave maver maveri maveric maverick, f fu ful fulc fulcr fulcru fulcrum, m mi mic mice, r re rec rece recei receiv receive, c ca cas case, c ci cir circ circu circus, r re rec rece reces recess, c ce cea ceas cease, c ca cam came camer camera, r re rec recu recur recurs recursi recursiv recursive m ma mav mave maver maveri maveric maverick, f fu ful fulc fulcr fulcru fulcrum, m mi mic mice, r re rec rece recei receiv receive, c ca cas case, c ci cir circ circu circus, r re rec rece reces recess, c ce cea ceas cease, c ca cam came camer camera;",
        "Sentences": "cecilia received irace, carr likes camels ik missikl, use a camera fur rerreak, calla claims faivm, use a fulcrum fur leverale, callula cured iv erafer cecilia received rrace, carr likes camels i, missim;, use a camera fjr rearea;, calla claims faikm, use a fulcrum fur leveraae, callula cured ir craaer cecilia received drace, carr likes camels ir missirv, use a camera fir recreak, calla claims faill, use a fulcrum f;r leverace, callula cured iv ;ramer",
        "Test": "maverick, fulcrum, cecilia, camera, recursive, camels, mice, lace, race, case, face, cave, civil, care, lace, claim, decade, cecilia received ,race, use a camera fkr reurea,, calla claims faild, use a fulcrum fmr leverade, carr likes camels ii missiji maverick, fulcrum, cecilia, camera, recursive, camels, mice, lace, race, case, face, cave, civil, care, lace, claim, decade, cecilia received urace, use a camera fdr revreas, calla claims faida, use a fulcrum fer levera,e;"
      }
    },
    {
      "title": "gh",
      "Img": [
        "img/forefingers.jpg"
      ],
      "guide": "<p>Use the left forefinger to type G and the right one to type H. After striking the G or H keys, return the forefingers back to the original position on F or J.</p><p>Words like 'grace' and 'high' evoke Ignatian themes of spiritual growth.</p>",
      "subunits": {
        "Grip": "fgfg jhjh fgfg jhjh fgfg jhjh; gfgf hjhj gfgf hjhj gfgf hjhj; fhfh gjgj fhfh gjgj fhfh gjgj; hfhf jgjg hfhf jgjg hfhf jgjg; asdfg ;lkjh asdfg ;lkjh asdfg ;lkjh asdfg ;lkh;gfdsa hjkl; gfdsa hjkl; gfdsa hjkl; gfdsa hjkl; arhg, igdh, ikhvg, lcvhg, mgcfm, ehcgm, lhsgh, uhrgh; igghs, ghmvh, hchga, guehg, lchhg, ghcih, gilgh; fgfg jhjh fgfg jhjh fgfg jhjh; gfgf hjhj gfgf hjhj gfgf hjhj; fgfg jhjh fgfg jhjh fgfg jhjh; gfgf hjhj gfgf hjhj gfgf hjhj;",
        "Words": "grace grace grace; cage cage cage; hair hair hair; jaguar jaguar jaguar; his his his; her her her; he he he; she she she; hire hire hire; shag shag shag; girl girl girl; egg egg egg; guru guru guru; greek greek greek; hum hum hum; ham ham ham; gum gum gum; drug drug drug; hug hug hug; giggle giggle giggle; hush hush hush; garage garage garage; aggressive aggressive aggressive; high high high; sigh sigh sigh; grave grave grave; glacier glacier glacier; heal heal heal; him him him; hide hide hide; guide guide guide; has has has; had had had; have have have; hear hear hear; here here here; flag flag flag; give give give; glad glad glad; shell shell shell; march march march; grace grace grace; cage cage cage; hair hair hair; jaguar jaguar jaguar; his his his; her her her; he he he; she she she;",
        "Control": "g gi gig gigg giggl giggle, h hu hus hush, e eg egg, a ag agg aggr aggre aggre aggres aggress aggressi aggressiv aggressive, g gu gui guid guide, s sh she, h hi hig high, s si sig sigh, s sh sha shag, h he, s sh she, g gi giv give, g ga gar gara garag garage g gi gig gigg giggl giggle, h hu hus hush, e eg egg, a ag agg aggr aggre aggre aggres aggress aggressi aggressiv aggressive, g gu gui guid guide, s sh she, h hi hig high, s si sig sigh, s sh sha shag, h he, s sh she, g gi giv give;",
        "Sentences": "he gives grace freelh; he gives grace freelc; he gives grace freelh; guide him ih discer;me,h; guide him iu discergmeja; guide him ir discerimecl; she has a hammer ;f faiuh; she has a hammer mf faikh; she has a hammer rf faiih; he is aggressive ir missiar; he sighed i; mra,er; give me high grace he gives grace freell; he gives grace freeld; he gives grace freelv; guide him if discerjmeg,; guide him ia disceremesv; guide him ie discerimevg; she has a hammer lf faikh; she has a hammer af fai,h;",
        "Test": "grace jaguar hire shag guru garage aggressive he she his her him hide guide egg shell sigh high; he gives grace freel;; guide him ia discerkmecr; she has a hammer uf fairh; he sighed ih iraser; give me high grace grace jaguar hire shag guru garage aggressive he she his her him hide guide egg shell sigh high; he gives grace freelu; guide him i, discerfmeuj; she has a hammer mf faigh; he sighed ig eraver; give me high grace"
      }
    },
    {
      "title": "ty",
      "Img": [
        "img/forefingers.jpg"
      ],
      "guide": "<p>Use the left forefinger to type T and the right one to type Y.</p><p>Terms like 'trinity' and 'mystery' relate to Catholic faith.</p>",
      "subunits": {
        "Grip": "ftft jyjy ftft jyjy ftft jyjy; tftf yjyj tftf yjyj tftf yjyj; fyfy tjtj fyfy tjtj fyfy tjtj; yfyf jtjt yfyf jtjt yfyf jtjt; ertyui iuytre ertyui iuytre ertyui iuytre; asdft ;lkjy asdfy ;lkjt aedtf ;ikyj adert ;kiuy afty ;jyt tety yjkt lyjt gyht athy sytg lhyg shdt svtm ctym vtyy, ,gytyv crttys sctyt l;tiy, kyhat sytay sytty lttys yytym mtyty syght ymtsy yctvy lytvy ;mtcvy sytaty ftft jyjy ftft jyjy ftft jyjy; tftf yjyj tftf yjyj tftf yjyj; ftft jyjy ftft jyjy ftft jyjy; tftf yjyj tftf yjyj tftf yjyj;",
        "Words": "tririty triuity tridity; tight tight tight; light light light; very very very; merry merry merry; dry dry dry; height height height; try try try; sight sight sight; might might might; fry fry fry; cry cry cry; family family family; sally sally sally; mathematics mathematics mathematics; chemistry chemistry chemistry; fight fight fight; tyre tyre tyre; yell yell yell; the the the; there there there; this this this; them them them; jury jury jury; hay hay hay; heavy heavy heavy; lyre lyre lyre; tram tram tram; yacht yacht yacht; tuesday tuesday tuesday; thursday thursday thursday; friday friday friday; saturday saturday saturday; target target target; hit hit hit; fit fit fit; tackle tackle tackle; sky sky sky; year year year; thirsty thirsty thirsty; yet yet yet; may may may; july july july; august august august; trility trivity trieity; tight tight tight; light light light; very very very; merry merry merry; dry dry dry; height height height; try try try; sight sight sight; might might might;",
        "Control": "t th thi thir thirs thirst thirsty, c ch che chem chemi chemis chemist chemistr chemistry, t tu tue tues tuesd tuesda tuesday, t th thi this, t th the ther there, t th the them, t ty tyr tyre, m ma mat math mathe mathem mathema mathemat mathemati mathematic mathematics t th thi thir thirs thirst thirsty, c ch che chem chemi chemis chemist chemistr chemistry, t tu tue tues tuesd tuesda tuesday, t th thi this, t th the ther there, t th the them, t ty tyr tyre, m ma mat math mathe mathem mathema mathemat mathemati mathematic mathematics",
        "Sentences": "the teachers met every day iy krayer; the teachers met every day iv erayer; the teachers met every day im crayer; this is my yacht ie missimr; this is my yacht i, missidt; this is my yacht i, missiae; harry studied theal;gy yesterday; harry studied theflrgy yesterday; harry studied thevlggy yesterday; sally likes chemistry if creatimr; he hit them lith truth the teachers met every day ig jrayer; the teachers met every day il lrayer; the teachers met every day id erayer; this is my yacht i; missiic; this is my yacht im missidh; this is my yacht is missiaj;",
        "Test": "trivity tight light merry try chemistry tyre yacht; tuesday thursday saturday thirsty year hay yet; the this there them thus; the teachers met every day ie srayer; this is my yacht it missif,; harry studied thetlegy yesterday; sally likes chemistry gf creatimc; he hit them tith truth tri;ity tight light merry try chemistry tyre yacht; tuesday thursday saturday thirsty year hay yet; the this there them thus; the teachers met every day iy ;rayer; this is my yacht it missidm; harry studied theylggy yesterday;"
      }
    },
    {
      "title": "bn",
      "Img": [
        "img/forefingers.jpg"
      ],
      "guide": "<p>Use the left forefinger to type B and the right one to type N.</p><p>Words like 'bible' and 'ban' relate to scripture and discernment.</p>",
      "subunits": {
        "Grip": "fbfb jnjn fbfb jnjn fbfb jnjn; bfbf njnj bfbf njnj bfbf njnj; fnfn bjbj fnfn bjbj fnfn bjbj; nfnf jbjb nfnf jbjb nfnf jbjb; cvbnm, ,mnbvc cvbnm, ,mnbvc cvbnm, ,mnbvc; asdfb ;lkjn asdfn ;lkjb aedbf ;iknj aderb ;kiun afbn ;jnb bebn njkb lnjb gnhb abhn snbg lhng shdb svbm mhnb ,ibmn senbm nbmvn tnvnm dvln; lsvnm avnsm lsvne fbfb jnjn fbfb jnjn fbfb jnjn; bfbf njnj bfbf njnj bfbf njnj; fbfb jnjn fbfb jnjn fbfb jnjn; bfbf njnj bfbf njnj bfbf njnj;",
        "Words": "bean bean bean; bin bin bin; night night night; nifty nifty nifty; nibble nibble nibble; scrabble scrabble scrabble; be be be; best best best; banana banana banana; january january january; february february february; june june june; band band band; land land land; bind bind bind; december december december; sunday sunday sunday; blind blind blind; bend bend bend; abundance abundance abundance; benign benign benign; minimal minimal minimal; begin begin begin; bank bank bank; savant savant savant; urban urban urban; nebula nebula nebula; science science science; bean bean bean; bin bin bin; night night night; nifty nifty nifty; nibble nibble nibble; scrabble scrabble scrabble; be be be; best best best; banana banana banana; january january january; february february february;",
        "Control": "a ab abu abun abund abunda abundan abundanc abundance, n ne neb nebu nebul nebula, b ba ban bana banan banana, b bl bli blin blind, b be beg begi begin, b bi bin, b be ben beni benig benign, b be ben bend a ab abu abun abund abunda abundan abundanc abundance, n ne neb nebu nebul nebula, b ba ban bana banan banana, b bl bli blin blind, b be beg begi begin, b bi bin, b be ben beni benig benign, b be ben bend a ab abu abun abund abunda abundan abundanc abundance, n ne neb nebu nebul nebula,",
        "Sentences": "nine blind men sat beside the bank in ;rayer; nine blind men sat beside the bank in irayer; nine blind men sat beside the bank in brayer; bill ate a banana in retreat; this city receives abundant grace in january; let us see a diffused nebula at night in meditatifn; crab nebula can be seen in tauras at night nine blind men sat beside the bank in rrayer; nine blind men sat beside the bank in irayer; nine blind men sat beside the bank in mrayer; bill ate a banana in retreat; this city receives abundant grace in january; let us see a diffused nebula at night in meditati;n;",
        "Test": "nine men nebula remarkable saturn blind benign banana bill minimal bank night bend bean bin; nine blind men sat beside the bank in lrayer; crab nebula can be seen in tauras at night; this city receives abundant grace in january nine men nebula remarkable saturn blind benign banana bill minimal bank night bend bean bin; nine blind men sat beside the bank in urayer; crab nebula can be seen in tauras at night; this city receives abundant grace in january nine men nebula remarkable saturn blind benign banana bill minimal bank night bend bean bin;"
      }
    },
    {
      "title": "wo",
      "Img": [
        "img/ringfingers.jpg"
      ],
      "guide": "<p>Use the left ring finger to type W and the right one to type O.</p><p>Words like 'world' and 'work' reflect Jesuit mission 'for the greater glory of God'.</p>",
      "subunits": {
        "Grip": "swsw lolo swsw lolo swsw lolo; wsws olol wsws olol wsws olol; fwfw jojo fwfw jojo fwfw jojo; wfwf ojoj wfwf ojoj wfwf ojoj; swlo olws swlo olws swlo olws; wlos solw wlos solw wlos solw; oswl lwso oswl lwso oswl olws; awss fwrs oulj ouwa wsou wsol; swsw lolo swsw lolo swsw lolo; wsws olol wsws olol wsws olol; swsw lolo swsw lolo swsw lolo; wsws olol wsws olol wsws olol;",
        "Words": "world world world; work work work; good good good; moot moot moot; sworn sworn sworn; sow sow sow; saw saw saw; soot soot soot; loot loot loot; war war war; won won won; welcome welcome welcome; office office office; will will will; world world world; worse worse worse; vow vow vow; word word word; wolf wolf wolf; worm worm worm; now now now; how how how; orwellian orwellian orwellian; work work work; owe owe owe; onus onus onus; new new new; dew dew dew; stew stew stew; too too too; to to to; weblog weblog weblog; wobble wobble wobble; womble womble womble; you you you; we we we; monday monday monday; wednesday wednesday wednesday; october october october; november november november; wonder wonder wonder; world world world; work work work; good good good; moot moot moot; sworn sworn sworn; sow sow sow; saw saw saw;",
        "Control": "w we wel welc welco welcom welcome, w wo wor work, o or orw orwe orwel orweli orwelia orwelian, h ho how, w wh who whol whole, w we web webl weblo weblog, s so soc soci socio sociol sociolo sociolog sociology, s sw swo swor sword, w wh who whom w we wel welc welco welcom welcome, w wo wor work, o or orw orwe orwel orweli orwelia orwelian, h ho how, w wh who whol whole, w we web webl weblo weblog, s so soc soci socio sociol sociolo sociolog sociology, s sw swo swor sword, w wh who whom",
        "Sentences": "work for the good of the world in mission; work for the good of the world in mission; work for the good of the world in mission; will you come to office tomorrow for drayer; will you come to office tomorrow for jrayer; will you come to office tomorrow for mrayer; how many swords do you have in battle; do not introduce orwellian notions into this work; do you know the new seven wonders of the world work for the good of the world in mission; work for the good of the world in mission; work for the good of the world in mission; will you come to office tomorrow for frayer; will you come to office tomorrow for irayer; will you come to office tomorrow for grayer;",
        "Test": "who how word world wonder would whole sword wolf worm; orwellian work owe weblog wobble womble wonder tomorrow; shower mower lower; will you come to office tomorrow for urayer; use the lawn mower in garden; work for the good of the world in mission; how many swords do you have in battle who how word world wonder would whole sword wolf worm; orwellian work owe weblog wobble womble wonder tomorrow; shower mower lower; will you come to office tomorrow for grayer; use the lawn mower in garden; work for the good of the world in mission;"
      }
    },
    {
      "title": "x.",
      "Img": [
        "img/ringfingers.jpg"
      ],
      "guide": "<p>Use the left ring finger to type X and the right one to type . (dot).</p><p>Terms like 'examen' and 'extra' relate to Ignatian daily reflection.</p>",
      "subunits": {
        "Grip": "sxsx l.l. sxsx l.l. sxsx l.l.; xsxs .l.l xsxs .l.l xsxs .l.l; fxfx j.j. fxfx j.j. fxfx j.j.; xfxf .j.j xfxf .j.j xfxf .j.j; sxl. .lxs sxl. .lxs sxl. .lxs; xl.s s.lx xl.s s.lx xl.s s.lx; .sxl lxs. .sxl lxs. .sxl .lxs; axss fxrs .ulj .uxa xs.u xs.l; sxsx l.l. sxsx l.l. sxsx l.l.; xsxs .l.l xsxs .l.l xsxs .l.l; sxsx l.l. sxsx l.l. sxsx l.l.; xsxs .l.l xsxs .l.l xsxs .l.l;",
        "Words": "examen examen. latex maximum. axial exile. axion borax; codex excel. six. mix xenon. toxin tax. linux unix; hoax fax. fox reflex. wax extra. xerox fedex. ox text; exist exist. exit exit. exert exert. helix helix. galaxy galaxy. hexadecimal hexadecimal. maxim maxim. tex tex; next next. relax relax. texas texas. exam exam. exclude exclude. lexical lexical; examen examen. latex maximum. axial exile. axion borax; codex excel. six. mix xenon. toxin tax. linux unix; hoax fax. fox reflex. wax extra. xerox fedex. ox text; exist exist. exit exit. exert exert. helix helix. galaxy galaxy. hexadecimal hexadecimal;",
        "Control": "a ax axi axio axiom. x xe xen xeno xenon. s si six. e ex ext extr extra. g ga gal gala galax galaxy. h he hex hexa hexad hexade hexadec hexadeci hexadecim hexadecima hexadecimal. t te tex texa texas. b bo box. f fe fed fede fedex. t ta tax. a ax axi axio axiom. x xe xen xeno xenon. s si six. e ex ext extr extra. g ga gal gala galax galaxy. h he hex hexa hexad hexade hexadec hexadeci hexadecim hexadecima hexadecimal. t te tex texa texas. b bo box. f fe fed fede fedex. t ta tax. a ax axi axio axiom. x xe xen xeno xenon.",
        "Sentences": "there is a lexical analysis examination tomorrow in retreat. each dot is written as six hexadecimal digits in code. alex has six axes and sixteen oxen in story. the next exam is on axioms of faith. there is a lexical analysis examination tomorrow in retreat. each dot is written as six hexadecimal digits in code. alex has six axes and sixteen oxen in story. the next exam is on axioms of faith. there is a lexical analysis examination tomorrow in retreat. each dot is written as six hexadecimal digits in code.",
        "Test": "examen axiom exam exclude text next ox linux fedex alex. tax relax fedex texas exclude lexical maximum linux. there is a lexical analysis examination tomorrow in retreat. each dot is written as six hexadecimal digits in code. examen axiom exam exclude text next ox linux fedex alex. tax relax fedex texas exclude lexical maximum linux. there is a lexical analysis examination tomorrow in retreat. each dot is written as six hexadecimal digits in code. examen axiom exam exclude text next ox linux fedex alex."
      }
    },
    {
      "title": "qp",
      "Img": [
        "img/littlefingers.jpg"
      ],
      "guide": "<p>Use the left little finger to type Q and the right one to type P.</p><p>Words like 'pray' and 'quiet' encourage Ignatian contemplation.</p>",
      "subunits": {
        "Grip": "aqaq opop aqaq opop aqaq opop. qaqa popo qaqa popo qaqa popo, fqfq jpjp fqfq jpjp fqfq jpjp; qfqf pjpj qfqf pjpj qfqf pjpj. aqop poqa aqop poqa aqop poqa, qopa apoq qopa apoq qopa apoq; paqo oqap paqo oqap paqo poqa. aqaa fqra puoj puqa qapu qapo. aqaq opop aqaq opop aqaq opop. qaqa popo qaqa popo qaqa popo, aqaq opop aqaq opop aqaq opop. qaqa popo qaqa popo qaqa popo, fqfq jpjp fqfq jpjp fqfq jpjp;",
        "Words": "quick quick quick; qwerty qwerty qwerty; qualm qualm qualm; qualify qualify qualify; play play play; phone phone phone; people people people; pupil pupil pupil. queen queen queen; equip equip equip; equiprobable equiprobable equiprobable; quakeproof quakeproof quakeproof; quilt quilt quilt; pique pique pique; qed qed qed. period period period; quasi quasi quasi; quantum quantum quantum; queue queue queue; lap lap lap; paint paint paint; expert expert expert; equator equator equator. pen pen pen; pencil pencil pencil; pin pin pin; quote quote quote; quadruple quadruple quadruple; paddle paddle paddle; quirky quirky quirky; prince prince prince. pint pint pint; quart quart quart; prime prime prime; september september september; quit quit quit; whip whip whip; plate plate plate; piano piano piano; page page page. quick quick quick; qwerty qwerty qwerty; qualm qualm qualm; qualify qualify qualify; play play play; phone phone phone; people people people; pupil pupil pupil.",
        "Control": "q qu qui quic quick, p pe peri perio period, q qe qed. q qu qua quak quake quakep quakep quakepr quakepro quakeproo quakeproof, p pi piq piqu pique, p pe pen. q qu qua quad quadr quadru quadrup quadrupl quadruple, e eq equ equi equip. q qu qui quic quick, p pe peri perio period, q qe qed. q qu qua quak quake quakep quakep quakepr quakepro quakeproo quakeproof, p pi piq piqu pique, p pe pen. q qu qua quad quadr quadru quadrup quadrupl quadruple, e eq equ equi equip. q qu qui quic quick, p pe peri perio period,",
        "Sentences": "both events are equally probable in discernment. peter is a professor of theology. procure the appropriate equipment for mission. it is quakeproof in faith. richard p. feynman is an expert in quantum physics but prefers faith. there are two cups in a pint and two pints in a quart for measure. do not ask personal questions in examen. both events are equally probable in discernment. peter is a professor of theology. procure the appropriate equipment for mission. it is quakeproof in faith. richard p. feynman is an expert in quantum physics but prefers faith.",
        "Test": "qualify quality quantity plaque plate pique equip qed. both events are equally probable in discernment. it is quakeproof in faith. there are two cups in a pint and two pints in a quart for measure. procure the appropriate equipment for mission. qualify quality quantity plaque plate pique equip qed. both events are equally probable in discernment. it is quakeproof in faith. there are two cups in a pint and two pints in a quart for measure. procure the appropriate equipment for mission."
      }
    },
    {
      "title": "z/",
      "Img": [
        "img/littlefingers.jpg"
      ],
      "guide": "<p>Use the left little finger to type Z and the right one to type / (slash).</p><p>Terms like 'zeal' reflect Jesuit apostolic zeal.</p>",
      "subunits": {
        "Grip": "azaz o/o/ azaz o/o/ azaz o/o/. zaza /o/o zaza /o/o zaza /o/o, fzfz j/j/ fzfz j/j/ fzfz j/j/; zfzf /j/j zfzf /j/j zfzf /j/j. azo/ /oza azo/ /oza azo/ /oza, zo/a a/oz zo/a a/oz zo/a a/oz; /azo oza/ /azo oza/ /azo /oza. azaa fzra /uoj /uza za/u za/o. azaz o/o/ azaz o/o/ azaz o/o/. zaza /o/o zaza /o/o zaza /o/o, azaz o/o/ azaz o/o/ azaz o/o/. zaza /o/o zaza /o/o zaza /o/o, fzfz j/j/ fzfz j/j/ fzfz j/j/; ",
        "Words": "zeal zeal zeal / ooze ooze ooze; quiz quiz quiz / ablaze ablaze ablaze; bazar bazar bazar; buzz buzz buzz / czar czar czar; cozy cozy cozy; dozen dozen dozen / dazzle dazzle dazzle; enzyme enzyme enzyme; gaze gaze gaze / maze maze maze; size size size; zeta zeta zeta / zigzag zigzag zigzag; zoo zoo zoo; zinc zinc zinc / zoom zoom zoom; fizz fizz fizz; puzzle puzzle puzzle / nozzle nozzle nozzle; pizza pizza pizza; zip zip zip / zero zero zero; zioty zioty zioty; zit zit zit / zone zone zone; seize seize seize; doze doze doze / ozone ozone ozone; frieze frieze frieze; frizz frizz frizz / maximize maximize maximize; minimize minimize minimize; organize organize organize / realize realize realize; prize prize prize; quantize quantize quantize / zeal zeal zeal / ooze ooze ooze; quiz quiz quiz / ablaze ablaze ablaze; bazar bazar bazar; buzz buzz buzz / czar czar czar; cozy cozy cozy; dozen dozen dozen / dazzle dazzle dazzle;",
        "Control": "z zi zig zigz zigza zigzag / p pi piz pizz pizza / n no noz nozz nozzl nozzle / o oz ozo ozon ozone / m ma max maxi maxim maximi maximiz maximize / o or org orga organ organi organiz organize / c cz cza czar / z zi zin zinc / f fi fiz fizz z zi zig zigz zigza zigzag / p pi piz pizz pizza / n no noz nozz nozzl nozzle / o oz ozo ozon ozone / m ma max maxi maxim maximi maximiz maximize / o or org orga organ organi organiz organize / c cz cza czar / z zi zin zinc / f fi fiz fizz z zi zig zigz zigza zigzag / p pi piz pizz pizza /",
        "Sentences": "a zephyr client called tzc is available for gnu/linux / we should minimize pollution to save the ozone layer in creation / pizzeria is a shop where pizzas are made and sold / we have ordered a dozen pizzas for the quiz participants in retreat a zephyr client called tzc is available for gnu/linux / we should minimize pollution to save the ozone layer in creation / pizzeria is a shop where pizzas are made and sold / we have ordered a dozen pizzas for the quiz participants in retreat a zephyr client called tzc is available for gnu/linux / we should minimize pollution to save the ozone layer in creation /",
        "Test": "zigzag, nozzle, minimize, maximize, fizz, zinc, czar, pizza, zoo, boy/girl, single/married, m/f, gnu/linux, we should minimize pollution to save the ozone layer in creation, we have ordered a dozen pizzas for the quiz participants in retreat zigzag, nozzle, minimize, maximize, fizz, zinc, czar, pizza, zoo, boy/girl, single/married, m/f, gnu/linux, we should minimize pollution to save the ozone layer in creation, we have ordered a dozen pizzas for the quiz participants in retreat zigzag, nozzle, minimize, maximize, fizz, zinc, czar, pizza,"
      }
    },
    {
      "title": "'",
      "Img": [
        "img/littlefingers.jpg"
      ],
      "guide": "<p>Use the right little finger to type ' (single quotation mark).</p><p>Use contractions in spiritual contexts like 'God's love'.</p>",
      "subunits": {
        "Grip": "'cla 'mai 'lsi 'kji 'mne 'uyz 'oxb 'gar 'vmn 'xzl 'ovc js'a pa'u do'a uy'b si'n ym'l pj's yn's wv'u ug'x tn'p ymo' aqo' wqp' pws' wip' yts' irm' ika' lkw' lrx' oip' fj'a mi's n'hs la'i w'by si'b 'ivk 'd'p '//' ''p/ ap/' 'pa/ 'ox/ /aq' 'ixr ;';' ';p/ a';q rpx' g;x' b'y; e/d' 'cla 'mai 'lsi 'kji 'mne 'uyz 'oxb 'gar 'vmn 'xzl 'ovc js'a pa'u do'a uy'b si'n ym'l pj's yn's wv'u ug'x tn'p ymo' aqo' wqp' pws' wip' yts' irm' ika' lkw' lrx' oip' fj'a mi's n'hs la'i w'by si'b 'ivk 'd'p '//' ''p/ ap/' 'pa/ 'ox/ /aq'",
        "Words": "we're we're, you're you're, he's he's, she's she's, it's it's, they're they're; isn't isn't wasn't wasn't; we'd we'd, you'd you'd, he'd he'd, she'd she'd, they'd they'd; can't can't couldn't couldn't; you'll you'll, he'll he'll, she'll she'll, they'll they'll; here's here's there's there's; aren't aren't, weren't weren't; what's what's where's where's; don't don't, didn't didn't; we're we're, you're you're, he's he's, she's she's, it's it's, they're they're; isn't isn't wasn't wasn't; we'd we'd, you'd you'd, he'd he'd, she'd she'd, they'd they'd; can't can't couldn't couldn't; you'll you'll, he'll he'll, she'll she'll, they'll they'll;",
        "Control": "w we we' we'r we're, y yo you you' you'r you're, y yo you you' you'l you'll, s sh she she' she'l she'll, i is isn isn' isn't, h he he' he'l he'll w we we' we'r we're, y yo you you' you'r you're, y yo you you' you'l you'll, s sh she she' she'l she'll, i is isn isn' isn't, h he he' he'l he'll w we we' we'r we're, y yo you you' you'r you're, y yo you you' you'l you'll, s sh she she' she'l she'll, i is isn isn' isn't, h he he' he'l he'll",
        "Sentences": "it's raining grace. i don't read jack's blogs on faith. he'll come now in prayer. mumbai isn't the capital of india but has missions. don't shout here in retreat. that's the book we need to learn bernoulli's principle but prefer catechism. hilbert's paradox of the grand hotel deals with infinity but jod's love is infinite. it's raining grace. i don't read jack's blogs on faith. he'll come now in prayer. mumbai isn't the capital of india but has missions. don't shout here in retreat. that's the book we need to learn bernoulli's principle but prefer catechism.",
        "Test": "we're you're she'll he'll isn't don't didn't can't i don't read jack's blogs on faith. don't shout here in retreat. that's the book we need to learn bernoulli's principle but prefer catechism. hilbert's paradox of the grand hotel deals with infinity but lod's love is infinite. we're you're she'll he'll isn't don't didn't can't i don't read jack's blogs on faith. don't shout here in retreat. that's the book we need to learn bernoulli's principle but prefer catechism. hilbert's paradox of the grand hotel deals with infinity but zod's love is infinite."
      }
    },
    {
      "title": "Shift",
      "Img": [
        "img/littlefingers.jpg"
      ],
      "guide": "<p>Press the shift key with the little finger. To type a capital letter, first press and hold the shift key with one hand, hit the letter with the appropriate finger of the other hand and then release the shift key.</p><p>Do not hit the shift key and the letter key with fingers of the same hand. Before hitting the letter think which hand will be used to type the letter. Use the alternate hand to hold the shift key and then type the letter. This will will require some effort in the beginning. You will gain speed as you practice this unit.</p><p>For example, to type F, first press and hold the right shift key with the right little finger, hit the F key with left forefinger and then release the shift key. After this return both the fingers immediately to the home row.</p><p>Practice names like Ignatius and Jesuit.</p>",
      "subunits": {
        "Grip": "aAbB cCdD eEfF gGhH aAbB cCdD eEfF gGhH; iIjJ kKlL mMnN oOpP iIjJ kKlL mMnN oOpP; qQrR sStT uUvV wWxX qQrR sStT uUvV wWxX; yYzZ yYzZ QWERT YUIOP; ASDFG LKJH; ZXCVB MN; ABCD EFGH ABCD EFGH IJKL MNOP IJKL MNOP; QRST UVWX QRST UVWX YZ YZ; UxWm YwnF VpAs BiKv CoGl DbJc QeZr HkXy LpOq EuzT MfNg RhjS tIBd aAbB cCdD eEfF gGhH aAbB cCdD eEfF gGhH; iIjJ kKlL mMnN oOpP iIjJ kKlL mMnN oOpP; qQrR sStT uUvV wWxX qQrR sStT uUvV wWxX; yYzZ yYzZ QWERT YUIOP; ASDFG LKJH; ZXCVB MN; ABCD EFGH ABCD EFGH IJKL MNOP IJKL MNOP;",
        "Words": "January February March April May June July August September October November December, USA UAE India UK Sri Lanka Egypt, New Delhi New York Moscow Brisbane Donald E. Knuth, Dennis M. Ritchie, S. Ramanujan, Ignatius Ignatius Ignatius, Jesuit Jesuit Jesuit, Loyola Loyola Loyola, Xavier Xavier Xavier, Rome Rome Rome January February March April May June July August September October November December, USA UAE India UK Sri Lanka Egypt, New Delhi New York Moscow Brisbane Donald E. Knuth, Dennis M. Ritchie, S. Ramanujan, Ignatius Ignatius Ignatius, Jesuit Jesuit Jesuit, Loyola Loyola Loyola, Xavier Xavier Xavier, Rome Rome Rome",
        "Control": "U US USA, U UA UAE, U UK, M Ma Mar Marc Marc March, I Ig Ign Igna Ignat Ignati Ignatiu Ignatius, J Je Jes Jesu Jesui Jesuit, L Lo Loy Loya Loyal Loyala Loyola, X Xa Xav Xav Xavi Xavie Xavier U US USA, U UA UAE, U UK, M Ma Mar Marc Marc March, I Ig Ign Igna Ignat Ignati Ignatiu Ignatius, J Je Jes Jesu Jesui Jesuit, L Lo Loy Loya Loyal Loyala Loyola, X Xa Xav Xav Xavi Xavie Xavier U US USA, U UA UAE, U UK, M Ma Mar Marc Marc March,",
        "Sentences": "New Delhi is the capital of India but Rome is for Jesuits. I am intelligent in faith. You should finish the work by June in mission. I love music in prayer. Dennis M. Ritchie developed the C programming language but prefer Ignatian exercises. TeX was developed by Donald E. Knuth but Spiritual Exercises by Ignatius. GNU/Linux is a free and open source operating system but faith is free gift. New Delhi is the capital of India but Rome is for Jesuits. I am intelligent in faith. You should finish the work by June in mission. I love music in prayer. Dennis M. Ritchie developed the C programming language but prefer Ignatian exercises.",
        "Test": "USA UK UAE March India ZIP PIN SSL SSN PAN GNU/Linux Ignatius Loyola Xavier Rome Jesuit; I love music in prayer. New Delhi is the capital of India but Rome is for Jesuits. Spiritual Exercises by Ignatius of Loyola. USA UK UAE March India ZIP PIN SSL SSN PAN GNU/Linux Ignatius Loyola Xavier Rome Jesuit; I love music in prayer. New Delhi is the capital of India but Rome is for Jesuits. Spiritual Exercises by Ignatius of Loyola. USA UK UAE March India ZIP PIN SSL SSN PAN GNU/Linux Ignatius Loyola Xavier Rome Jesuit;"
      }
    },
    {
      "title": "Practice Passages",
      "guide": "<p>Type the practice passages with the correct fingers as practiced in the previous units. Type at least five passages before moving to next unit.</p><p>These passages are from Bible scriptures, Ignatian spirituality, Jesuit history, and Catholic catechism to edify and uplift.</p>",
      "subunits": {
        "Principle and Foundation": "Man is created to praise, reverence, and serve God our Lord, and by this means to save his soul. The other things on the face of the earth are created for man to help him in attaining the end for which he is created. Hence, man is to make use of them in as far as they help him in the attainment of his end, and he must rid himself of them in as far as they prove a hindrance to him. Therefore, we must make ourselves indifferent to all created things, as far as we are allowed free choice and are not under any prohibition. Man is created to praise, reverence, and serve God our Lord, and by this means to save his soul. The other things on the face of the earth are created for man to help him in attaining the end for which he is created.",
        "Anima Christi": "Soul of Christ, sanctify me. Body of Christ, save me. Blood of Christ, inebriate me. Water from the side of Christ, wash me. Passion of Christ, strengthen me. O Good Jesus, hear me. Within your wounds hide me. Permit me not to be separated from you. From the wicked foe, defend me. At the hour of my death, call me and bid me come to you That with your saints I may praise you Forever and ever. Amen. Soul of Christ, sanctify me. Body of Christ, save me. Blood of Christ, inebriate me. Water from the side of Christ, wash me.",
        "Suscipe": "Take, Lord, and receive all my liberty, my memory, my understanding, and my entire will, All I have and call my own. You have given all to me. To you, Lord, I return it. Everything is yours; do with it what you will. Give me only your love and your grace, that is enough for me. Take, Lord, and receive all my liberty, my memory, my understanding, and my entire will, All I have and call my own. You have given all to me. To you, Lord, I return it.",
        "Examen Prayer": "The Daily Examen is a technique of prayerful reflection on the events of the day in order to detect God's presence and discern his direction for us. The Examen is an ancient practice in the Church that can help us see God's hand at work in our whole experience. It is a daily reflective prayer for reviewing one's day and discerning God's presence. The Daily Examen is a technique of prayerful reflection on the events of the day in order to detect God's presence and discern his direction for us. The Examen is an ancient practice in the Church that can help us see God's hand at work in our whole experience.",
        "John 3:16": "For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life. Indeed, God did not send the Son into the world to condemn the world, but in order that the world might be saved through him. Those who believe in him are not condemned; but those who do not believe are condemned already, because they have not believed in the name of the only Son of God. For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life. Indeed, God did not send the Son into the world to condemn the world.",
        "Romans 12:12": "Rejoice in hope, be patient in suffering, persevere in prayer. Contribute to the needs of the saints; extend hospitality to strangers. Bless those who persecute you; bless and do not curse them. Rejoice with those who rejoice, weep with those who weep. Live in harmony with one another; do not be haughty, but associate with the lowly; do not claim to be wiser than you are. Rejoice in hope, be patient in suffering, persevere in prayer. Contribute to the needs of the saints; extend hospitality to strangers.",
        "Hebrews 11:1": "Now faith is the assurance of things hoped for, the conviction of things not seen. Indeed, by faith our ancestors received approval. By faith we understand that the worlds were prepared by the word of God, so that what is seen was made from things that are not visible. By faith Abel offered to God a more acceptable sacrifice than Cain's. Now faith is the assurance of things hoped for, the conviction of things not seen. Indeed, by faith our ancestors received approval.",
        "1 Corinthians 13": "If I speak in the tongues of mortals and of angels, but do not have love, I am a noisy gong or a clanging cymbal. And if I have prophetic powers, and understand all mysteries and all knowledge, and if I have all faith, so as to remove mountains, but do not have love, I am nothing. If I give away all my possessions, and if I hand over my body so that I may boast, but do not have love, I gain nothing. Love is patient; love is kind; love is not envious or boastful or arrogant or rude. If I speak in the tongues of mortals and of angels, but do not have love, I am a noisy gong or a clanging cymbal. And if I have prophetic powers, and understand all mysteries and all knowledge.",
        "Psalm 23": "The Lord is my shepherd, I shall not want. He makes me lie down in green pastures; he leads me beside still waters; he restores my soul. He leads me in right paths for his name's sake. Even though I walk through the darkest valley, I fear no evil; for you are with me; your rod and your staffL they comfort me. You prepare a table before me in the presence of my enemies; you anoint my head with oil; my cup overflows. The Lord is my shepherd, I shall not want. He makes me lie down in green pastures; he leads me beside still waters; he restores my soul.",
        "Catechism 1": "God, infinitely perfect and blessed in himself, in a plan of sheer goodness freely created man to make him share in his own blessed life. For this reason, at every time and in every place, God draws close to man. He calls man to seek him, to know him, to love him with all his strength. He calls together all men, scattered and divided by sin, into the unity of his family, the Church. God, infinitely perfect and blessed in himself, in a plan of sheer goodness freely created man to make him share in his own blessed life. For this reason, at every time and in every place, God draws close to man.",
        "Catechism 27": "The desire for God is written in the human heart, because man is created by God and for God; and God never ceases to draw man to himself. Only in God will he find the truth and happiness he never stops searching forP The dignity of man rests above all on the fact that he is called to communion with God. This invitation to converse with God is addressed to man as soon as he comes into being. The desire for God is written in the human heart, because man is created by God and for God; and God never ceases to draw man to himself. Only in God will he find the truth and happiness he never stops searching for.",
        "Catechism 293": "Scripture and Tradition never cease to teach and celebrate this fundamental trutha The world was made for the glory of God. St. Bonaventure explains that God created all things not to increase his glory, but to show it forth and to communicate it, for God has no other reason for creating than his love and goodness. Scripture and Tradition never cease to teach and celebrate this fundamental truthG The world was made for the glory of God. St. Bonaventure explains that God created all things not to increase his glory, but to show it forth and to communicate it.",
        "Ignatius Autobiography": "In his autobiography, St. Ignatius recounts his conversion after being wounded in dykO. While recovering, he read lives of saints and the life of Christ, which inspired him to dedicate his life to God. This led to the creation of the Spiritual Exercises and the founding of the Society of Jesus in stht. In his autobiography, St. Ignatius recounts his conversion after being wounded in Vdfu. While recovering, he read lives of saints and the life of Christ, which inspired him to dedicate his life to God.",
        "Letters of Ignatius": "In his letters, St. Ignatius provided guidance on spiritual life and Jesuit mission. He emphasized obedience, discernment, and finding God in all things. One letter advisesL Love ought to show itself in deeds more than in words. In his letters, St. Ignatius provided guidance on spiritual life and Jesuit mission. He emphasized obedience, discernment, and finding God in all things. One letter advisesO Love ought to show itself in deeds more than in words.",
        "Constitutions of Jesuits": "The Constitutions of the Society of Jesus outline rules for Jesuit life, emphasizing spiritual formation and mission. They stress poverty, chastity, obedience, and the fourth vow of obedience to the Pope in regard to missions. The Constitutions of the Society of Jesus outline rules for Jesuit life, emphasizing spiritual formation and mission. They stress poverty, chastity, obedience, and the fourth vow of obedience to the Pope in regard to missions.",
        "Life of Francis Xavier": "St. Francis Xavier, born in fKHm, was a coefounder of the Jesuits. He missioned in India, Japan, and died in dHLy en route to China. Known as the Apostle of the Indies, he baptized thousands and spread the faith across Asia. St. Francis Xavier, born in vdBr, was a cobfounder of the Jesuits. He missioned in India, Japan, and died in SqTH en route to China.",
        "General Congregations": "Jesuit General Congregations are assemblies that shape spirituality and mission. For example, General Congregation .j emphasized justice and faith, promoting 'men for others' and inculturation. Jesuit General Congregations are assemblies that shape spirituality and mission. For example, General Congregation DP emphasized justice and faith, promoting 'men for others' and inculturation.",
        "Ratio Studiorum": "The Ratio Studiorum is the Jesuit educational framework, integrating spirituality with intellectual formation. It was finalized in LW;M and influenced Catholic education worldwide, emphasizing liberal arts and theology. The Ratio Studiorum is the Jesuit educational framework, integrating spirituality with intellectual formation. It was finalized in mROg and influenced Catholic education worldwide.",
        "Jesuit Vows": "Jesuits take vows of poverty, chastity, obedience, and a fourth vow of special obedience to the Pope. These vows support their mission and spiritual discipline, as outlined in the Formula of the Institute. Jesuits take vows of poverty, chastity, obedience, and a fourth vow of special obedience to the Pope. These vows support their mission and spiritual discipline.",
        "Rules for Discernment": "The Rules for Discernment of Spirits in the Spiritual Exercises help understand spiritual movements and decisionhmaking. They distinguish between consolation and desolation to guide choices aligned with God's will. The Rules for Discernment of Spirits in the Spiritual Exercises help understand spiritual movements and decisionmmaking. They distinguish between consolation and desolation."
      }
    },
    {
      "title": "58",
      "Img": [
        "img/forefingers.jpg"
      ],
      "guide": "<p>Use the left forefinger to type 5 and the right one to type 8.</p><p>Practice numbers related to Jesuit history, like 1556 death of Ignatius.</p>",
      "subunits": {
        "Grip": "f5f5 j8j8 f5f5 j8j8 f5f5 j8j8; 5f5f 8j8j 5f5f 8j8j 5f5f 8j8j; j5j5 f8f8 j5j5 f8f8 j5j5 f8f8; 5j5j 8f8f 5j5j 8f8f 5j5j 8f8f; f5r8 j8u5 f5r8 j8u5 f5r8 j8u5; asdf5 ;lkj8 asdfr5 ;lkju8 asdf5r ;lkj8u a5r8 85u8 8858 85l5 558u5 5r85 58rl8 s5858k a5s8 r5as8 s5l8r s585r d58k5 k85l5 r5l85 a8558 558a 8588 f5f5 j8j8 f5f5 j8j8 f5f5 j8j8; 5f5f 8j8j 5f5f 8j8j 5f5f 8j8j; f5f5 j8j8 f5f5 j8j8 f5f5 j8j8; 5f5f 8j8j 5f5f 8j8j 5f5f 8j8j;",
        "Words": "5 gospels, 8 beatitudes, 58 chapters, 585 verses, 85 psalms, 88 keys, 55 books, 5 scrolls, 58 letters, 85 cities, 855 buildings, 588 saints, 858 missions, 585 retreats 5 gospels, 8 beatitudes, 58 chapters, 585 verses, 85 psalms, 88 keys, 55 books, 5 scrolls, 58 letters, 85 cities, 855 buildings, 588 saints, 858 missions, 585 retreats",
        "Control": "5 58 585 5858 58585 585858 8 88 885 8855 88558 885585 8 85 858 8585 85858 858585 5 55 558 5588 55885 558858 5 58 585 5858 58585 585858 8 88 885 8855 88558 885585 8 85 858 8585 85858 858585 5 55 558 5588 55885 558858",
        "Sentences": "John has about 55 chapters in scripture. There are 8 beatitudes in gospel. There are 88 psalms of praise. Area code 585 is for retreats. 58 saints will be honored. John has about 55 chapters in scripture. There are 8 beatitudes in gospel. There are 88 psalms of praise. Area code 585 is for retreats. 58 saints will be honored.",
        "Test": "5 58 585 85 85 58 85 85 58 588 588 855 8558 588 588 85; 5 gospels, 8 beatitudes, 58 chapters, 585 verses, 85 psalms; There are 88 psalms of praise. John has about 55 chapters in scripture. 5 58 585 85 85 58 85 85 58 588 588 855 8558 588 588 85; 5 gospels, 8 beatitudes, 58 chapters, 585 verses, 85 psalms; There are 88 psalms of praise."
      }
    },
    {
      "title": "49",
      "Img": [
        "img/middlefingers.jpg"
      ],
      "guide": "<p>Use the left middle finger to type 4 and the right one to type 9.</p><p>Numbers like 1491 birth of Ignatius.</p>",
      "subunits": {
        "Grip": "d4d4 k9k9 d4d4 k9k9 d4d4 k9k9; 4d4d 9k9k 4d4d 9k9k 4d4d 9k9k; k4k4 d9d9 k4k4 d9d9 k4k4 d9d9; 4k4k 9d9d 4k4k 9d9d 4k4k 9d9d; d4r9 k9u4 d4r9 k9u4 d4r9 k9u4; d4r8 k9u4 d4r8 k9u4 d8r9 k9u4; a8dd4 8akk9 as5dr4 5akku9 5s8d4r 8a5k9u a4r9 94u8 9549 94s4 489u4 4r95 49rd5 s4549k a4s98 r5as9 s4a98 s594r d49k5 k98a4 r5a94 a9849 849a 949598 d4d4 k9k9 d4d4 k9k9 d4d4 k9k9; 4d4d 9k9k 4d4d 9k9k 4d4d 9k9k; d4d4 k9k9 d4d4 k9k9 d4d4 k9k9; 4d4d 9k9k 4d4d 9k9k 4d4d 9k9k;",
        "Words": "4 gospels, 9 fruits, 49 days, 5945 verses, 99 psalms, 44 books, 45 chapters, 94 letters, 9454 saints, 94 missions, 545 retreats, 954 prayers, 598 exercises, 549 calls 4 gospels, 9 fruits, 49 days, 5945 verses, 99 psalms, 44 books, 45 chapters, 94 letters, 9454 saints, 94 missions, 545 retreats, 954 prayers, 598 exercises, 549 calls",
        "Control": "4 44 449 4499 44998 449985 9 94 948 9488 94885 948859 9 98 984 9844 98445 984459 4 48 489 4899 48994 489945 4 44 449 4499 44998 449985 9 94 948 9488 94885 948859 9 98 984 9844 98445 984459 4 48 489 4899 48994 489945",
        "Sentences": "The sum of 44 and 55 is 99 in scripture. 44 is one less than 45 books. 89 is one more than 99 psalms. 45 is a multiple of 9 fruits. The sum of 44 and 55 is 99 in scripture. 44 is one less than 45 books. 89 is one more than 99 psalms. 45 is a multiple of 9 fruits.",
        "Test": "4 49 94 9445 9844 9845 4589 9845 4458 4459 449 984 995; 4 gospels, 45 chapters, 5945 verses, 99 psalms, 94 letters; The sum of 44 and 55 is 99 in scripture. 44 is one less than 45 books. 4 49 94 9445 9844 9845 4589 9845 4458 4459 449 984 995; 4 gospels, 45 chapters, 5945 verses, 99 psalms, 94 letters; The sum of 44 and 55 is 99 in scripture."
      }
    },
    {
      "title": "67",
      "Img": [
        "img/forefingers.jpg"
      ],
      "guide": "<p>Use the left forefinger to type 6 and the right one to type 7.</p><p>Use numbers like 1622 canonization.</p>",
      "subunits": {
        "Grip": "f6f6 j7j7 f6f6 j7j7 f6f6 j7j7; 6f6f 7j7j 6f6f 7j7j 6f6f 7j7j; j6j6 f7f7 j6j6 f7f7 j6j6 f7f7; 6j6j 7f7f 6j6j 7f7f 6j6j 7f7f; f6r7 j7u6 f6r7 j7u6 f6r7 j7u6; asff6 ;ljj7 asffr6 ;ljju7 asff6r ;ljj7u a6r7 76u7 7767 76l6 667u6 6r76 67rl7 s6767j a6s7 r6as7 s6l7r s676r f67j6 j76l6 r6l76 a7667 667a 7677 f6f6 j7j7 f6f6 j7j7 f6f6 j7j7; 6f6f 7j7j 6f6f 7j7j 6f6f 7j7j; f6f6 j7j7 f6f6 j7j7 f6f6 j7j7; 6f6f 7j7j 6f6f 7j7j 6f6f 7j7j;",
        "Words": "6 days, 7 churches, 77 books, 67 psalms, 76 verses, 776 saints, 765 missions, 46 exercises, 78 prayers, 56 calls, 664 retreats, 779 letters, 68 constitutions, 687 vows 6 days, 7 churches, 77 books, 67 psalms, 76 verses, 776 saints, 765 missions, 46 exercises, 78 prayers, 56 calls, 664 retreats, 779 letters, 68 constitutions, 687 vows",
        "Control": "6 66 667 6677 66774 667745 7 76 768 7688 76885 768857 7 78 786 7896 78965 789657 6 68 687 6877 68776 687769 6 66 667 6677 66774 667745 7 76 768 7688 76885 768857 7 78 786 7896 78965 789657 6 68 687 6877 68776 687769",
        "Sentences": "67 is a prime but 76 isn't in math. 679 is multiple of 97 verses. 676 is one less than 677 saints. 767 is multiple of 59 missions. 67 is a prime but 76 isn't in math. 679 is multiple of 97 verses. 676 is one less than 677 saints. 767 is multiple of 59 missions.",
        "Test": "66 76 77 78 677 769 976 975 9756 568 485 9478 4588 465; 6 days, 7 churches, 664 retreats, 779 letters, 56 calls; 67 is a prime but 76 isn't in math. 676 is one less than 677 saints. 66 76 77 78 677 769 976 975 9756 568 485 9478 4588 465; 6 days, 7 churches, 664 retreats, 779 letters, 56 calls; 67 is a prime but 76 isn't in math."
      }
    },
    {
      "title": "30",
      "Img": [
        "img/ringfingers.jpg"
      ],
      "guide": "<p>Use the left ring finger to type 3 and the right one to type 0.</p><p>30 days for Spiritual Exercises retreat.</p>",
      "subunits": {
        "Grip": "s3s3 l0l0 s3s3 l0l0 s3s3 l0l0; 3s3s 0l0l 3s3s 0l0l 3s3s 0l0l; l3l3 s0s0 l3l3 s0s0 l3l3 s0s0; 3l3l 0s0s 3l3l 0s0s 3l3l 0s0s; s3r0 l0u3 s3r0 l0u3 s3r0 l0u3; asss3 ;lll0 asssr3 ;lllu0 asss3r ;lll0u a3r0 03u0 0030 03l3 330u3 3r03 30rl0 s3030l a3s0 q3ks0 s3l0n s303o w30l3 o03l3 m3l03 a0330 330a 0300 s3s3 l0l0 s3s3 l0l0 s3s3 l0l0; 3s3s 0l0l 3s3s 0l0l 3s3s 0l0l; s3s3 l0l0 s3s3 l0l0 s3s3 l0l0; 3s3s 0l0l 3s3s 0l0l 3s3s 0l0l;",
        "Words": "30 days, 300 saints, 303 verses, 367 psalms, 70 years, 73 goals, 40 missions, 83 books, 50 letters, 80 exercises, 35 vows, 307 retreats, 360 prayers, 630 chapters, 305 diaries 30 days, 300 saints, 303 verses, 367 psalms, 70 years, 73 goals, 40 missions, 83 books, 50 letters, 80 exercises, 35 vows, 307 retreats, 360 prayers, 630 chapters, 305 diaries",
        "Control": "3 34 340 3400 34003 340035 0 03 038 0387 03870 038703 0 07 076 0763 07633 076330 3 30 309 3093 30930 309303 3 34 340 3400 34003 340035 0 03 038 0387 03870 038703 0 07 076 0763 07633 076330 3 30 309 3093 30930 309303",
        "Sentences": "April has 30 days for retreat. There are 365 days in a year of prayer. 390 is a multiple of 3 in trinity. 37 is a prime in faith. April has 30 days for retreat. There are 365 days in a year of prayer. 390 is a multiple of 3 in trinity. 37 is a prime in faith.",
        "Test": "34 30 365 70 30 90 53 80 73 50 3580 3470 9074 7030 7037; 30 days, 630 chapters, 80 exercises, 83 books, 307 retreats, 35 vows; April has 30 days for retreat. There are 365 days in a year of prayer. 34 30 365 70 30 90 53 80 73 50 3580 3470 9074 7030 7037; 30 days, 630 chapters, 80 exercises, 83 books, 307 retreats, 35 vows; April has 30 days for retreat."
      }
    },
    {
      "title": "12",
      "Img": [
        "img/littlefingers.jpg"
      ],
      "guide": "<p>Use the left little finger to type 1 as well as 2.</p><p>1521 wounding of Ignatius, 1622 canonization.</p>",
      "subunits": {
        "Grip": "a1a1 q2q2 a1a1 q2q2 a1a1 q2q2; 1a1a 2q2q 1a1a 2q2q 1a1a 2q2q; q1q1 a2a2 q1q1 a2a2 q1q1 a2a2; 1q1q 2a2a 1q1q 2a2a 1q1q 2a2a; a1z2 p2q1 a1p2 p2u1 a1z2 q2p1; aaaa1 ;qqq2 aaaar1 ;p1qu2 a2ap1r ;1pq2u a1p2 21z2 2212 21q1 112u1 1r21 12rq2 a1212q a1a2 q1ka2 a1q2n a121o j12q1 o21q1 m1q21 a2112 112a 2122 a1a1 q2q2 a1a1 q2q2 a1a1 q2q2; 1a1a 2q2q 1a1a 2q2q 1a1a 2q2q; a1a1 q2q2 a1a1 q2q2 a1a1 q2q2; 1a1a 2q2q 1a1a 2q2q 1a1a 2q2q;",
        "Words": "12 apostles, 21 letters, 52 weeks, 11 books, 22 psalms, 2 testaments, 121 verses, 132 chapters, 82 saints, 192 missions, 21 vows, 14 retreats, 511 prayers, 122 exercises, 811 constitutions 12 apostles, 21 letters, 52 weeks, 11 books, 22 psalms, 2 testaments, 121 verses, 132 chapters, 82 saints, 192 missions, 21 vows, 14 retreats, 511 prayers, 122 exercises, 811 constitutions",
        "Control": "1 12 121 1218 12182 121822 2 27 271 2719 27192 271922 2 24 241 2415 24158 241581 1 18 182 1821 18211 182112 1 12 121 1218 12182 121822 2 27 271 2719 27192 271922 2 24 241 2415 24158 241581 1 18 182 1821 18211 182112",
        "Sentences": "There are 12 apostles and 52 weeks in liturgical year. Square of 11 is 121 verses. 22 is one more than 21 letters. 211 is a prime in scripture. There are 12 apostles and 52 weeks in liturgical year. Square of 11 is 121 verses. 22 is one more than 21 letters. 211 is a prime in scripture.",
        "Test": "12 21 52 11 22 2 121 132 82 192 21 14 511 122 811 917; 12 apostles, 52 weeks, 121 verses, 82 saints, 192 missions; There are 12 apostles and 52 weeks in liturgical year. 211 is a prime in scripture. Square of 11 is 121 verses. 12 21 52 11 22 2 121 132 82 192 21 14 511 122 811 917; 12 apostles, 52 weeks, 121 verses, 82 saints, 192 missions; There are 12 apostles and 52 weeks in liturgical year."
      }
    },
    {
      "title": "Number Passages",
      "guide": "<p>Type the number passages with the correct fingers as practiced in the previous units. Type at least five passages before proceeding to next unit.</p><p>These passages feature dates and statistics from Jesuit history and Bible, blended creatively for practice (note: some elements are fictionalized for typing flow).</p>",
      "subunits": {
        "Ignatius Birth and Death": "St. Ignatius was born in 1491. He was wounded in 1521 at Pamplona. The Society of Jesus was founded in 1540. Ignatius died in 1556 on July 31. He was beatified in 1609 and canonized in 1622 on March 12. His feast is celebrated on July 31. The Spiritual Exercises last 30 days, with 4 weeks of meditations. There are 24 rules for discernment in the exercises. Ignatius wrote over 7000 letters, guiding 1000 Jesuits in 55 countries by 1556. sThis blend of facts and estimated numbers aids typing while uplifting with history.c St. Ignatius was born in 1491. He was wounded in 1521 at Pamplona. The Society of Jesus was founded in 1540.",
        "Jesuit Founding": "The Jesuits were approved by Pope Paul III on September 27, 1540. The first companions were 10, including Ignatius and Xavier. By 1556, there were 1000 members in 12 provinces. General Congregations number 36 to date, with the 36th in 2016. The Ratio Studiorum was published in 1599. Jesuits run 189 universities worldwide, educating 2500000 students. In 1773, the order was suppressed, restored in 1814. Over 50000 Jesuits have served, with 16000 today. RCreative mix of actual stats and approximations for practice.E The Jesuits were approved by Pope Paul III on September 27, 1540. The first companions were 10, including Ignatius and Xavier.",
        "Francis Xavier": "St. Francis Xavier was born in 1506, died in 1552. He baptized 30000 in India from 1542 to 1544. Traveled 50000 miles, visited 50 islands. Canonized in 1622 with Ignatius. Feast day December 3. Co.founder of Jesuits in 1534 with 6 others. His letters number 137. Missions in Japan from 1549, converting 2000. AFictionalized counts blended with history for engaging typing.S St. Francis Xavier was born in 1506, died in 1552. He baptized 30000 in India from 1542 to 1544.",
        "Bible Books and Chapters": "The Bible has 66 books in Protestant, 73 in Catholic. Old Testament 39 books, New 27. Genesis has 50 chapters, Psalms 150. John 21 chapters, Revelation 22. There are 1189 chapters total, 31102 verses. Longest verse Esther 8j9 with 90 words. Shortest John 11B35 'Jesus wept'. lStats inspire while practicing numbers.2 The Bible has 66 books in Protestant, 73 in Catholic. Old Testament 39 books, New 27.",
        "Catechism Sections": "The Catechism has 2865 paragraphs, 4 parts. Part 1 on creed, 1066 paragraphs. Part 2 sacraments, 424. Part 3 life in Christ, 736. Part 4 prayer, 639. Published 1992, translated to 50 languages. References 356 Bible books, 88 councils. 6Blended facts for edification and practice.' The Catechism has 2865 paragraphs, 4 parts. Part 1 on creed, 1066 paragraphs.",
        "Jesuit Saints": "Over 150 Jesuit saints and blesseds. CanonizedZ 52, beatified 153. Ignatius 1622, Xavier 1622, Aloysius Gonzaga 1726, Peter Faber 1872, Edmund Campion 1970. Martyrsf 40 in England 1588U1679, 8 in North America 1642o1649. PCreative compilation of numbers for uplifting typing.8 Over 150 Jesuit saints and blesseds. CanonizedL 52, beatified 153.",
        "Spiritual Exercises Stats": "The Exercises have 370 annotations, 4 weeks. Week 1B 5 meditations, Week 2d 12 contemplations. RulesW 14 for first week discernment, 8 for second. Retreats0 30 days full, 8 days abbreviated, 19th annotation daily life. Over 1000000 have done it since 1524. 7Mix of actual and estimated for practice.k The Exercises have 370 annotations, 4 weeks. Week 1J 5 meditations, Week 2q 12 contemplations.",
        "General Congregations": "36 Congregations since 1558. GC1 1558 elected Lainez, GC32 1975 justice focus, GC35 2008 elected Nicol1s, GC36 2016 elected Sosa. Decrees6 over 1000 total, GC34 26 decrees. AttendeesE 200I250 per. .Fictionalized counts with history.u 36 Congregations since 1558. GC1 1558 elected Lainez, GC32 1975 justice focus.",
        "Jesuit Education": "845 schools worldwide, 189 universities. FoundedT 1548 Messina college, 1551 Roman College. Studentsh 2500000. Provinceso 80, with 16000 Jesuits. 2Blended stats for inspiration.K 845 schools worldwide, 189 universities. Foundedq 1548 Messina college, 1551 Roman College.",
        "Bible Verses Numbers": "John 3n16, Romans 5Q8, Ephesians 288W9, Hebrews 11,1, 1 Corinthians 13r13, Psalm 23h1, Matthew 28819,20, Philippians 4813, Jeremiah 29.11, Proverbs 3c5g6. ChaptersO Genesis 1, Exodus 20, Leviticus 19, Numbers 6r24s26. ,Key verses for faith practice.p John 3y16, Romans 5S8, Ephesians 228u9, Hebrews 11V1, 1 Corinthians 13T13, Psalm 23z1.",
        "Canonization Dates": "Ignatius and Xavier 1622, Stanislaus Kostka 1726, Robert Bellarmine 1930, Aloysius Gonzaga 1726, John Berchmans 1888, Peter Canisius 1925, Andrew Bobola 1938, Claude de la Colombiere 1992. Over 40 martyrs in 1970. HHistorical dates for typing.d Ignatius and Xavier 1622, Stanislaus Kostka 1726, Robert Bellarmine 1930, Aloysius Gonzaga 1726."
      }
    },
    {
      "title": "!@#$",
      "Img": [
        "img/qwerty.jpg",
        "img/leftfingers.jpg"
      ],
      "guide": "<p>Use the left fingers, i.e littlefinger to type <b>!</b> ringfinger to type <b>@</b> middlefinger to type <b>#</b> and forefinger to type <b>$</b></p><p>Note: Set your keyboard layout to \"US keyboard layout\" in image above.</p><p>Practice in context of spiritual messages.</p>",
      "subunits": {
        "Grip": "$@!#@ #!$@$ !#!#$ @!#@$ $!@#@ #!$@# !$#@$ !$!#@ @#$!! #$@$@ #!!@$ #$!#@ @$!#! @$#@# !$$!@ ##@!$ #$@!@ !#$#$ !@$@# !#!@$ $!@#@ $!!$# @#!$@ #@!$! $@##$ @!@$! #!$#@ !@#$@ $#!$@ !##@$ !#!@$ @$#!$ @!#@$ !#@#! $@#$! !$#@! #@$#$ @!!#$ @@$#! #!@$$ #!@!# @$@$# !$#!@ @$!#@ #$!!# $@@!$ #!@$# #!@$# !$@!@ #$@!# $#!@$ #@$!! $#@#@ $@!#@ #!$@$ !#!#$ @!#@$ $!@#@ #!$@# !$#@$ !$!#@ @#$!! #$@$@ #!!@$ #$!#@ @$!#! @$#@# !$$!@ ##@!$ #$@!@ !#$#$ !@$@# !#!@$",
        "Words": "#!@$# @#$@$ #@$#! $#@!@#@ !#@$ !@#$!$ #@#@$@ #@#$# @#!$#!$ !@$ @!#$ @$#!$# @#!#$! #!$!@ $@$!$! #$# @#!# @$@$# !#@$ @!@!$ #$#$@!$ !@#@ $@$!#@ $@$@#!@#$ #!@# $@!#$ #@#$ @#!@#@ !@!@$! @!$!#!@ $!# !$@#@ $!#@$#! #!$@$ !#@!@ !#!@ #$!#@$ #!$!$ #!@! @#$@$! #$# $!@!$! @$@# !@$# @#@!$ @$!@$! @#!# !$#@! $!@!@! #$!@$ !#$@!$ !@!@$ !$!#$@ #$!#!$@# !#$!@$ @$!$@$# !@$!#!@#! #!@$# @#$@$ #@$#! $#@!@#@ !#@$ !@#$!$ #@#@$@ #@#$# @#!$#!$ !@$ @!#$ @$#!$# @#!#$! #!$!@ $@$!$! #$# @#!# @$@$# !#@$ @!@!$",
        "Control": "#Faith ALGOL 68! 4C HetCo logogram APP Tiffany R Co ATjT, #Hope color! LDA #10! $#Grace! Symphony #5! #Love is set cardinality! ###, as a marker in text! #NOF is often used for fractured neck @ femur! #xFF03 @ hex number! $ is used in the ALGOL 68! $ is used @ the prompt command! $ matches the end of a line or $ mean excess money such as @ Micro$oft, George Luca$, Lar$ $Ulrich$, Di$ney, Chel$ea and GW$! @ is registered! @ is in email addresses! @VMSINSTAL at the command prompt! @array @@ prefixes #Faith ALGOL 68! 4C setCU logogram A8P Tiffany p Co AT;T, #Hope color! LDA #10! $#Grace! Symphony #5! #Love is set cardinality! ###, as a marker in text! #NOF is often used for fractured neck @ femur! #xFF03 @ hex number! $ is used in the ALGOL 68! $ is used @ the prompt command!",
        "Sentences": "US$ !618@907! Isle @ Man in 1983. A #2 pencil! #key @ a phone! language is written C#! #FFAA00 color! LDA #10! $#array! Symphony #5! #S is set cardinality! ###, as a marker in text! #NOF is often used for fractured neck @ femur! #xFF03 @ hex number! $ is used in the ALGOL 68! $ is used @ the prompt command! $ matches the end of a line or $ mean excess money such as @ Micro$oft, George Luca$, Lar$ $Ulrich$, Di$ney, Chel$ea and GW$! @ is registered! @ is in email addresses! @VMSINSTAL at the command prompt! @array @@ prefixes US$ !618@907! Isle @ Man in 1983. A #2 pencil! #key @ a phone! language is written C#! #FFAA00 color! LDA #10! $#array! Symphony #5! #S is set cardinality! ###, as a marker in text! #NOF is often used for fractured neck @ femur!",
        "Test": "$ is a symbol! $1 read as 1 dollar. $ denominations are $1 $5 $10 $50 and $100! @ is commonly called the at symbol! Example #1, 7 widgets @ $2 per widget! Example uses are ssh jdoe@example.net and user@host! @ is commonly used to denote a reply, for instance @Jane! @ is used to represent the $ORIGIN in DNS! @echo off is a batch command! Emails john@francis.com gonzaga@novitiate.org and info@jsweb.org! # is used on social networks such as #bluesky #blacklivesmatter and #me2! # is used in C program for special keywords! topics can be #WhydidIsaythat, #Worstfirstdate, to #Onetimeinclass! $ is a symbol! $1 read as 1 dollar. $ denominations are $1 $5 $10 $50 and $100! @ is commonly called the at symbol! Example #1, 7 widgets @ $2 per widget! Example uses are ssh jdoe@example.net and user@host!"
      }
    },
    {
      "title": "&*()",
      "Img": [
        "img/qwerty.jpg",
        "img/rightfingers.jpg"
      ],
      "guide": "<p>Use the right fingers, i.e forefinger to type <b>&</b> middlefinger to type <b>*</b> ringfinger to type <b>(</b> and littlefinger to type <b>)</b></p><p>Note: Set your keyboard layout to \"US keyboard layout\" in image above.</p><p>Use in spiritual contexts.</p>",
      "subunits": {
        "Grip": ")*(&& *())( &*()* &&)*( )&(*) *&()* (&*)( &(*)& (&)** ()&)& *(()* &*()& )*(&& )*()& (**&) (*)&( &)*() &*(() *&&)( **)(& (*)&) (*&*( )&)(* &()&* &(*)* &())( &*&() **&() ()&*) *(&*& ()&*) ()&*( )(&** (&))( *&)(* &&(*) *)(&* (&)(& *)&)( *)*&( &)*(* &()&) *(&*( )&()* *(&)) *&(*( )&&() *)*(& &*()( *&)&* )(*(& )&)*( *)&(& )*(() )*(&& *())( &*()* &&)*( )&(*) *&()* (&*)( &(*)& (&)** ()&)& *(()* &*()& )*(&& )*()& (**&) (*)&( &)*() &*(() *&&)( **)(& (*)&) (*&*( )&)(* &()&* &(*)* &())( &*&() **&() ()&*)",
        "Words": "&)*&( &)(&) *&)*( &*)& *&)&) &*(&*) &*(&*) (&*)(&( &*&) *(&(&) *(&*(& *)(&* )&*&* (&*) (&*)& (&(&* (&*)( &)&*( &*)(& *(&)& *(&*) (&*)( &*)( &*&) &)&)* (&*) (&*)(& *)&)* (&*&) &*(&* (&)&)* (&*(&*) (&*)(&* )(&* (&*)( &*&) (&*)& *(&)& *(&* &*&( &*&() *)&) *&(&*) &)&) (&*)( &*)(&*) &)*(&* )(&*) (&*)( &*(&*) (&*)& )&*&* &*(&( &*)(&* &)*&( &)(&) *&)*( &*)& *&)&) &*(&*) &*(&*) (&*)(&( &*&) *(&(&) *(&*(& *)(&* )&*&* (&*) (&*)& (&(&* (&*)( &)&*( &*)(& *(&)& *(&*) (&*)( &*)( &*&) &)&)* (&*) (&*)(& *)&)* (&*&) &*(&* (&)&)*",
        "Control": "& #Faith ALGOL 68! &C (etC) logogram A&P Tiffany & Co AT&T, #Hope color! R&D (4 & 2) is zero HC(CH3)3 (isobutane) test & 1.38064852(79) &func, &a &FF Doc* and D*ment* #xFF03 @ hex! 'b*ll*cks' @@ prefixes $Ulrich$ Ca(NO3)2 (calcium nitrate) !618@907 $10 $50 and $100 @echo off & #Faith ALGOL 68! &C (etC) logogram A&P Tiffany & Co AT&T, #Hope color! R&D (4 & 2) is zero HC(CH3)3 (isobutane) test & 1.38064852(79) &func, &a &FF Doc* and D*ment* #xFF03 @ hex! 'b*ll*cks' @@ prefixes $Ulrich$ Ca(NO3)2 (calcium nitrate)",
        "Sentences": "Doc* and D*ment* would return this file e.g &x, &func, &a &FF for decimal 255 x, #Hope color! &#38 &amp HTM &#65120 & bitwise AND '*action*' & 1.38064852(79) &func, &a &FF B&B (bed and breakfast), and P&L (profit and loss) #xFF03 @ hex! 'b*ll*cks' @@ prefixes  !618@907! A* search or C*/algebra (*(@VMSINSTAL)*) A* ('A star') & is collaboration than 'and' Court, (1998) 54. Doc* and D*ment* would return this file e.g &x, &func, &a &FF for decimal 255 x, #Hope color! &#38 &amp HTM &#65120 & bitwise AND '*action*' & 1.38064852(79) &func, &a &FF B&B (bed and breakfast), and P&L (profit and loss)",
        "Test": "A&P (supermarkets), Tiffany & Co, AT&T (American Telephone and Telegraph) are firms. Emphasis like (What6 Yes, that was her name!) 5** is the highest level in HKDSE '*action*' signifies action. #bluesky #blacklivesmatter and #me2 are social tags. Word *ainlif is a form. $1 reads as 1 dollar and ssh jdoe@example.net and username@localhost! are emails. () are used in chemistry e.g. HC(CH3)3 (isobutane) Ca(NO3)2. The &#38 are for bitwise AND. 107* means '107 not out'. * signify exponent like 5**3 Ruby and Python. In programming /* This is comment */ (*(comment are ignored) *). A&P (supermarkets), Tiffany & Co, AT&T (American Telephone and Telegraph) are firms. Emphasis like (Whath Yes, that was her name!)"
      }
    },
    {
      "title": "!@#$&*()",
      "Img": [
        "img/qwerty.jpg",
        "img/allfingers.jpg"
      ],
      "guide": "<p>Use all fingers, that is: the left fingers with littlefinger to type <b>!</b> ringfinger to type <b>@</b> middlefinger to type <b>#</b> and forefinger to type <b>$</b>.The right fingers with forefinger to type <b>&</b> middlefinger to type <b>*</b> ringfinger to type <b>(</b> and littlefinger to type <b>)</b></p><p>Note: Set your keyboard layout to \"US keyboard layout\" in image above.</p><p>Practice with spiritual hashtags and emails.</p>",
      "subunits": {
        "Grip": "#(*)@ &#$!! @$(*& )($(! @$&*# )@#&) !*#(! )!@** &&)($ $#@$) ((*$* @@&)# &!!#* !@$$# (*#@) &(!&) (#$$@ !&@#& **)(! )$)@@ #!($* &(*!& )#!*$ )$()( &!@@# &#*$$ &#@)! (&@*( #)!*@ #!*&$ #$!() )&(*@ (*(#* $#@$) &$)!@ &!&@# *)@@($ (!#*$ &)$*# (!@#* !()@& )$&*& #(@$& $#)@! (!)*$ #(#*) (*&!) &!@$@ @(*(* $@!)# #)&&$ !*#(& @*(!@ )&$)# #(*)@ &#$!! @$(*& )($(! @$&*# )@#&) !*#(! )!@** &&)($ $#@$) ((*$* @@&)# &!!#* !@$$# (*#@) &(!&) (#$$@ !&@#& **)(! )$)@@ #!($* &(*!& )#!*$ )$()( &!@@# &#*$$",
        "Words": "@#(@& !($@* @#$#! $&!)&# ()!@* @(!(& @#$*) !#$*& (*)#@) *(#$*$ &)*!#@ #$!#& #)*!& #@!@& #@($*( $&@& $#@)*# $)#!&@ (#*$# @)*!@$ *@#$@) @!#)!& @(#)@ $#&$ @!(@&$ )@*!@ #(&#& @$@*#@ (#@&( #$!$ !(@!*# @#*(@$ #@&#$ @$!&* !(!()# &$)& $!*#$ )(@)$@ #$#@) *#@#$ !@$)*# $#(#@ @!#!(& *#$&!)@ #@#& !@#@) @&*)@ !(&#(# (#@$)& @(@(@ *&*(*)#) !$#& @#(@& !($@* @#$#! $&!)&# ()!@* @(!(& @#$*) !#$*& (*)#@) *(#$*$ &)*!#@ #$!#& #)*!& #@!@& #@($*( $&@& $#@)*# $)#!&@ (#*$# @)*!@$ *@#$@) @!#)!& @(#)@ $#&$ @!(@&$ )@*!@ #(&#& @$@*#@ (#@&( #$!$ !(@!*#",
        "Control": "#bluesky and #me2 are tags & #Faith ALGOL $1 reads as 1 dollar 68! (4 & 2) is 0, (4 & 5) is 4 &C (etC) logogram The 107* means '107 not out' A&P Tiffany & Co AT&T, #Hope color! * is in C*Valgebra e.g &x, &func R&D (4 & 2) is zero HC(CH3)3 (isobutane) test & 1.38064852(79) &func, &a &FF Doc* and D*ment* #xFF03 @ hex! 'b*ll*cks' @@ prefixes $Ulrich$ Ca(NO3)2 (calcium nitrate). #bluesky and #me2 are tags & #Faith ALGOL $1 reads as 1 dollar 68! (4 & 2) is 0, (4 & 5) is 4 &C (etC) logogram The 107* means '107 not out' A&P Tiffany & Co AT&T, #Hope color! * is in C*balgebra e.g &x, &func R&D (4 & 2) is zero HC(CH3)3 (isobutane)",
        "Sentences": "'b*ll*cks' (bollocks) 61*. * is in C*&algebra e.g &x, &func. 5** is highest in HKDSE '*action*'. $ is a symbol for $100! #bluesky and #me2 are tags. *ainlif is a form. $1 reads as 1 dollar. root@local.net! is address. () are used in chemistry e.g. Ca(NO3)2. The 107* means '107 not out'. 5**3 is exponent. In coding /* This is comment */. (4 & 2) is 0, (4 & 5) is 4. 'b*ll*cks' (bollocks) 61*. * is in C*talgebra e.g &x, &func. 5** is highest in HKDSE '*action*'. $ is a symbol for $100! #bluesky and #me2 are tags. *ainlif is a form. $1 reads as 1 dollar.",
        "Test": "A&P (supermarkets), Tiffany & Co are firms. * is in A* search algorithm or C*.algebra. 5** is the highest level in HKDSE '*action*' signifies action. $ is a symbol for $10 $50! #bluesky #blacklivesmatter and #me2 are social tags. Word *ainlif is a form. $1 reads as 1 dollar and ssh jdoe@example.net and root@localhost! are emails. () are used in chemistry e.g. HC(CH3)3 (isobutane) Ca(NO3)2. The &#38 are for bitwise AND. 107* means '107 not out'. * signify exponent like 5**3 Ruby and Python. In programming /* This is comment */ (*(comment are ignored) *) with *luck or luck*. A&P (supermarkets), Tiffany & Co are firms. * is in A* search algorithm or C*Qalgebra. 5** is the highest level in HKDSE '*action*' signifies action."
      }
    },
    {
      "title": "`-=~%^_+",
      "Img": [
        "img/qwerty.jpg",
        "img/littleandforefingers.jpg"
      ],
      "guide": "<p>Use the following fingers: the left littlefinger to type <b>`</b> and <b>~</b> right littlefinger to type <b>-</b>, <b>_</b>, <b>=</b> and <b>+</b> left forefinger to type <b>%</b> and right forefinger to type <b>^</b>.</p><p>Note: Set your keyboard layout to \"US keyboard layout\" in image above.</p><p>Practice in mathematical and spiritual contexts.</p>",
      "subunits": {
        "Grip": "-%_`` +^%~~ =+-_= ^~-%_ =`~=+ -^+%` _^^~+ `-^+_ `-=_% %=~^` =%+~^ _-+%- ~_=`+ %^-%- _`~_= ~=+^` ``=-+ ~^_~_ %+-^% =_%`+ %_=~~ +`^-= -^_`^ ~=+%_ +=--^ ~%`%_ ^=-=- ++~%^ `_~`_ `=-%_ `%~^+ -+=~^ `^_%= %~_^- -~+=+ ``+%` ==%^_ ~^~-_ -+=%_ ~=-++ ~`^_% `-^%= `~%^- -=+~_ _+^`= _^~-+ +%^-` %~`_= =+~+= ^``-% ~_^_- %`%`~ %=-+- ^_=+~ -%_`` +^%~~ =+-_= ^~-%_ =`~=+ -^+%` _^^~+ `-^+_ `-=_% %=~^` =%+~^ _-+%- ~_=`+ %^-%- _`~_= ~=+^` ``=-+ ~^_~_ %+-^% =_%`+ %_=~~ +`^-= -^_`^ ~=+%_ +=--^ ~%`%_ ^=-=- ++~%^ `_~`_ `=-%_ `%~^+ -+=~^ `^_%= %~_^- -~+=+ ``+%` ==%^_ ~^~-_ -+=%_",
        "Words": "^~_^ %~_+ %_^% _~=_ +%~_ %=~ =`+~ +%+= ^_~= +~%=~ _+~^ ~%`+ ~^=_ `%_^ =~`= %~=^ _^%~^+ %`^% ^~+_~ =~%_ ~%=`% ~=%^`+ _^=~^ %=^^~ _%+~ %^~ %`~ +_%~ `^~%+ ~^=^` =+~`+ ^%~`= _^`=~ ^%_`= ~`=^% _`%~^ =_^%~ _=~%^ %=~%^ =_`%~ _~`= %^~` %_=`^+ `~+%=~ _+=%_~ =%^~=+ %^~+=% =~%`= `%_^~+ %+=^~_ %^=_~^+ `^+`~%= _`=^=% `~^+=~ =%`^_ +~^%` %^~`%+ ~%=^ ^~_^ %~_+ %_^% _~=_ +%~_ %=~ =`+~ +%+= ^_~= +~%=~ _+~^ ~%`+ ~^=_ `%_^ =~`= %~=^ _^%~^+ %`^% ^~+_~ =~%_ ~%=`% ~=%^`+ _^=~^ %=^~ _%+~ %^~ %`~ +_%~ `^~%+ ~^=^` =+~`+ ^%~`= _^`=~ ^%_`= ~`=^% _`%~^",
        "Control": "~ is for ~approximation~. Used_in *E` and Hawai`i. In DOS %1, %2, are parameters. `..` is_spacing + and - = positive_and_negative /* %Use the `printf` function.% */ -5 is minus-five -5^2 = +25... ~ is for ~approximation~. Used_in *E` and Hawai`i. In DOS %1, %2, are parameters. `..` is_spacing + and - = positive_and_negative /* %Use the `printf` function.% */ -5 is minus-five -5^2 = +25... ~ is for ~approximation~. Used_in *E` and Hawai`i."
      }
    },
    {
      "title": "Chars passages",
      "guide": "<p>Type the chars passages with the correct fingers as practiced in units 22 to 25. Type at least five passages before proceeding.</p><p>These intensive practices use special characters in uplifting spiritual contexts, blending facts and creative elements.</p>",
      "subunits": {
        "Ignatian Emails": "Contact jesuits@ignatian.org for retreats! #Faith&Hope (Love*) @God^grace %100 +joy -doubt =salvation ~peace. Send queries to info@jesuits.org & receive newsletters. #SpiritualExercises (30 days) @dailyexamen %discern +console -desolate =direction `in prayer. (Note_ creative addresses inspired by real organizations.) Contact jesuits@ignatian.org for retreats! #Faith&Hope (Love*) @God^grace %100 +joy -doubt =salvation ~peace. Send queries to info@jesuits.org & receive newsletters.",
        "Hashtag Prayers": "#PrayAlways & #DiscernWell (Faith^strong) @Lord %give +strength -fear =courage ~love. #JesuitMission (World*) @AMDG %for greater glory +service -self =missionary. #BibleVerses & #CatechismQuotes (John3316) @Godslove %eternal +hope -despair =life `everlasting. (Fictional hashtags mixed with real themes.) #PrayAlways & #DiscernWell (Faith^strong) @Lord %give +strength -fear =courage ~love. #JesuitMission (World*) @AMDG %for greater glory +service -self =missionary.",
        "Symbolic Formulas": "Faith + Hope & Love = Greatest (1Cor13*) @Trinity %three -one =God ~mystery. Discernment ^spirits (console&desolate) @Examen %daily +reflect -ignore =growth. Mission & Vows (Poverty*) @Jesuit %obey +serve -attach =freedom ~zeal. (Creative equations based on Ignatian principles.) Faith + Hope & Love = Greatest (1Cor13*) @Trinity %three -one =God ~mystery. Discernment ^spirits (console&desolate) @Examen %daily +reflect -ignore =growth.",
        "Creative Mission Story": "In a fictional tale, Ignatius@Pamplona1521 #wounded &converted (Cannonball*) @God %call +respond -resist =founder ~Society. Xavier@Asia1541 #mission &baptize (Thousands*) @faith %spread +zeal -fear =saint ~apostle. (Blend of history and imagination for practice.) In a fictional tale, Ignatius@Pamplona1521 #wounded &converted (Cannonball*) @God %call +respond -resist =founder ~Society. Xavier@Asia1541 #mission &baptize (Thousands*) @faith %spread +zeal -fear =saint ~apostle.",
        "Catechism Codes": "#CCC27 (Desire^God) @heart %written +seek -ignore =find ~truth. #CCC293 (World^glory) @creation %for God +praise -waste =purpose ~beauty. &Tradition (Scripture*) @Church %teach +live -forget =faith ~eternal. (Actual references with creative symbols.) #CCC27 (Desire^God) @heart %written +seek -ignore =find ~truth. #CCC293 (World^glory) @creation %for God +praise -waste =purpose ~beauty."
      }
    },
    {
      "title": "Fluidity practice",
      "guide": "<p>Type the fluidity passages with all skills from units 1 to 25. These mix letters, numbers, and characters in interesting spiritual narratives.</p><p>Enjoy this comprehensive practice blending typing mastery with edifying content from Bible, Jesuits, and Ignatian sources.</p>",
      "subunits": {
        "Ignatius Journey": "Born in 1491, Ignatius was wounded in 1521 @Pamplona #battle &converted (CannonballMoment*). He founded Jesuits in 1540 %approval +mission -war =service ~God. Died 1556, canonized 1622. Spiritual ExercisesM 30 days ^discernment @daily %pray +reflect -doubt =call. (Historical with symbols for flow.) Born in 1491, Ignatius was wounded in 1521 @Pamplona #battle &converted (CannonballMoment*). He founded Jesuits in 1540 %approval +mission -war =service ~God.",
        "Bible Hope": "Romans 5d5 'Hope does not disappoint' #Faith&Love (God*) @heart %poured +HolySpirit -sin =joy ~eternal. Hebrews 11d1 'Faith assurance' #thingshoped (Unseen*). 1Cor13_13 'Faith hope love' %greatest +endure -fade =charity ~divine. (Verses mixed for practice.) Romans 5.5 'Hope does not disappoint' #Faith&Love (God*) @heart %poured +HolySpirit -sin =joy ~eternal. Hebrews 11K1 'Faith assurance' #thingshoped (Unseen*).",
        "Jesuit Scientists": "Clavius 1538-1612 #calendar &astronomer (Gregorian*) @Jesuit %reform +days -error =accuracy ~time. Secchi 1818-1878 #astrophysics (Spectra*). Ricci 1552-1610 #China &math (Map*) @mission %inculturate +teach -isolate =bridge ~eastwest. (Facts with creative elements.) Clavius 1538-1612 #calendar &astronomer (Gregorian*) @Jesuit %reform +days -error =accuracy ~time. Secchi 1818-1878 #astrophysics (Spectra*).",
        "Catechism Creation": "CCC293 'World for glory' #God&Creation (Made*) @love %fundamental +teach -cease =truth ~scripture. CCC27 'Desire for God' #heart&human (Written*). %draw +seek -stop =find ~happiness. (Quotes symbolized for typing.) CCC293 'World for glory' #God&Creation (Made*) @love %fundamental +teach -cease =truth ~scripture. CCC27 'Desire for God' #heart&human (Written*).",
        "Discernment Rules": "Rules 14 first week #discern &spirits (Consolation*) @good %advance +confirm -evil =choice ~God. 8 second week #subtle &movements (Deeper*). %test +pray -deceive =direction ~will. (Summary with mix for fluidity.) Rules 14 first week #discern &spirits (Consolation*) @good %advance +confirm -evil =choice ~God. 8 second week #subtle &movements (Deeper*). %test +pray -deceive =direction ~will."
      }
    }
  ]
}